ch4/ch4.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2015-10-05 Mon 16:05 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Structure and Interpretation of Computer Programs (SICP)</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Robert Irelan" />
</head>
<body>
<div id="content">
<h1 class="title">Structure and Interpretation of Computer Programs (SICP)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline122"><span class="todo nilTODO">TODO</span> Chapter 4: Metalinguistic Abstraction <code>[%]</code></a>
<ul>
<li><a href="#orgheadline1"><span class="todo nilTODO">TODO</span> 4.1: The Metacircular Evaluator <code>[28%]</code></a>
<ul>
<li><a href="#orgheadline2">Code</a></li>
<li><a href="#orgheadline5"><span class="done nilDONE">DONE</span> 4.1.1: The Core of the Evaluator <code>[2/2]</code></a>
<ul>
<li><a href="#orgheadline3"><span class="done nilDONE">DONE</span> Read SICP 4.1.1</a></li>
<li><a href="#orgheadline4"><span class="done nilDONE">DONE</span> Exercise 4.1</a></li>
</ul>
</li>
<li><a href="#orgheadline17"><span class="todo nilNEXT">NEXT</span> 4.1.2: Representing Expressions <code>[7/10]</code></a>
<ul>
<li><a href="#orgheadline6">Code</a></li>
<li><a href="#orgheadline7"><span class="done nilDONE">DONE</span> Read SICP 4.1.2</a></li>
<li><a href="#orgheadline8"><span class="done nilDONE">DONE</span> Exercise 4.2</a></li>
<li><a href="#orgheadline9"><span class="done nilDONE">DONE</span> Exercise 4.3</a></li>
<li><a href="#orgheadline10"><span class="done nilDONE">DONE</span> Exercise 4.4</a></li>
<li><a href="#orgheadline11"><span class="done nilDONE">DONE</span> Exercise 4.5</a></li>
<li><a href="#orgheadline12"><span class="done nilDONE">DONE</span> Exercise 4.6</a></li>
<li><a href="#orgheadline13"><span class="done nilDONE">DONE</span> Exercise 4.7</a></li>
<li><a href="#orgheadline14"><span class="todo nilNEXT">NEXT</span> Exercise 4.8</a></li>
<li><a href="#orgheadline15"><span class="todo nilNEXT">NEXT</span> Exercise 4.9</a></li>
<li><a href="#orgheadline16"><span class="todo nilNEXT">NEXT</span> Exercise 4.10</a></li>
</ul>
</li>
<li><a href="#orgheadline23"><span class="todo nilNEXT">NEXT</span> 4.1.3: Evaluator Data Structures <code>[3/4]</code></a>
<ul>
<li><a href="#orgheadline18">Code</a></li>
<li><a href="#orgheadline19"><span class="done nilDONE">DONE</span> Read SICP 4.1.3</a></li>
<li><a href="#orgheadline20"><span class="done nilDONE">DONE</span> Exercise 4.11</a></li>
<li><a href="#orgheadline21"><span class="done nilDONE">DONE</span> Exercise 4.12</a></li>
<li><a href="#orgheadline22"><span class="todo nilTODO">TODO</span> Exercise 4.13</a></li>
</ul>
</li>
<li><a href="#orgheadline27"><span class="done nilDONE">DONE</span> 4.1.4: Running the Evaluator as a Program <code>[2/2]</code></a>
<ul>
<li><a href="#orgheadline24">Code</a></li>
<li><a href="#orgheadline25"><span class="done nilDONE">DONE</span> Read SICP 4.1.4</a></li>
<li><a href="#orgheadline26"><span class="done nilDONE">DONE</span> Exercise 4.14</a></li>
</ul>
</li>
<li><a href="#orgheadline30"><span class="todo nilTODO">TODO</span> 4.1.5: Data as Programs <code>[1/2]</code></a>
<ul>
<li><a href="#orgheadline28"><span class="done nilDONE">DONE</span> Read SICP 4.1.5</a></li>
<li><a href="#orgheadline29"><span class="todo nilTODO">TODO</span> Exercise 4.15</a></li>
</ul>
</li>
<li><a href="#orgheadline38"><span class="todo nilTODO">TODO</span> 4.1.6: Internal Definitions <code>[/]</code></a>
<ul>
<li><a href="#orgheadline31"><span class="todo nilTODO">TODO</span> Read SICP 4.1.6</a></li>
<li><a href="#orgheadline32"><span class="todo nilTODO">TODO</span> Exercise 4.16</a></li>
<li><a href="#orgheadline33"><span class="todo nilTODO">TODO</span> Exercise 4.17</a></li>
<li><a href="#orgheadline34"><span class="todo nilTODO">TODO</span> Exercise 4.18</a></li>
<li><a href="#orgheadline35"><span class="todo nilTODO">TODO</span> Exercise 4.19</a></li>
<li><a href="#orgheadline36"><span class="todo nilTODO">TODO</span> Exercise 4.20</a></li>
<li><a href="#orgheadline37"><span class="todo nilTODO">TODO</span> Exercise 4.21</a></li>
</ul>
</li>
<li><a href="#orgheadline43"><span class="todo nilTODO">TODO</span> 4.1.7: Separating Syntactic Analysis from Execution <code>[0/4]</code></a>
<ul>
<li><a href="#orgheadline39"><span class="todo nilNEXT">NEXT</span> Read SICP 4.1.7</a></li>
<li><a href="#orgheadline40"><span class="todo nilNEXT">NEXT</span> Exercise 4.22</a></li>
<li><a href="#orgheadline41"><span class="todo nilTODO">TODO</span> Exercise 4.23</a></li>
<li><a href="#orgheadline42"><span class="todo nilTODO">TODO</span> Exercise 4.24</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline60"><span class="todo nilTODO">TODO</span> 4.2: Variations on a Scheme &#x2013; Lazy Evaluation <code>[%]</code></a>
<ul>
<li><a href="#orgheadline47"><span class="todo nilTODO">TODO</span> 4.2.1: Normal Order and Applicative Order <code>[/]</code></a>
<ul>
<li><a href="#orgheadline44"><span class="todo nilTODO">TODO</span> Read SICP 4.2.1</a></li>
<li><a href="#orgheadline45"><span class="todo nilTODO">TODO</span> Exercise 4.25</a></li>
<li><a href="#orgheadline46"><span class="todo nilTODO">TODO</span> Exercise 4.26</a></li>
</ul>
</li>
<li><a href="#orgheadline54"><span class="todo nilTODO">TODO</span> 4.2.2: An Interpreter with Lazy Evaluation <code>[/]</code></a>
<ul>
<li><a href="#orgheadline48"><span class="todo nilTODO">TODO</span> Read SICP 4.2.2</a></li>
<li><a href="#orgheadline49"><span class="todo nilTODO">TODO</span> Exercise 4.29</a></li>
<li><a href="#orgheadline50"><span class="todo nilTODO">TODO</span> Exercise 4.28</a></li>
<li><a href="#orgheadline51"><span class="todo nilTODO">TODO</span> Exercise 4.29</a></li>
<li><a href="#orgheadline52"><span class="todo nilTODO">TODO</span> Exercise 4.30</a></li>
<li><a href="#orgheadline53"><span class="todo nilTODO">TODO</span> Exercise 4.31</a></li>
</ul>
</li>
<li><a href="#orgheadline59"><span class="todo nilTODO">TODO</span> 4.2.3: Streams as Lazy Lists <code>[/]</code></a>
<ul>
<li><a href="#orgheadline55"><span class="todo nilTODO">TODO</span> Read SICP 4.2.3</a></li>
<li><a href="#orgheadline56"><span class="todo nilTODO">TODO</span> Exercise 4.32</a></li>
<li><a href="#orgheadline57"><span class="todo nilTODO">TODO</span> Exercise 4.33</a></li>
<li><a href="#orgheadline58"><span class="todo nilTODO">TODO</span> Exercise 4.34</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline87"><span class="todo nilTODO">TODO</span> 4.3: Variations on a Scheme &#x2013; Nondeterministic Computing <code>[%]</code></a>
<ul>
<li><a href="#orgheadline65"><span class="todo nilTODO">TODO</span> 4.3.1: Amb and Search <code>[3/4]</code></a>
<ul>
<li><a href="#orgheadline61"><span class="done nilDONE">DONE</span> Read SICP 4.3.1</a></li>
<li><a href="#orgheadline62"><span class="done nilDONE">DONE</span> Exercise 4.35</a></li>
<li><a href="#orgheadline63"><span class="todo nilTODO">TODO</span> Exercise 4.36</a></li>
<li><a href="#orgheadline64"><span class="done nilDONE">DONE</span> Exercise 4.37</a></li>
</ul>
</li>
<li><a href="#orgheadline79"><span class="todo nilTODO">TODO</span> 4.3.2: Examples of Nondeterministic Programs <code>[4/13]</code></a>
<ul>
<li><a href="#orgheadline66"><span class="done nilDONE">DONE</span> Read SICP 4.3.2</a></li>
<li><a href="#orgheadline67"><span class="todo nilTODO">TODO</span> Exercise 4.38</a></li>
<li><a href="#orgheadline68"><span class="todo nilTODO">TODO</span> Exercise 4.39</a></li>
<li><a href="#orgheadline69"><span class="done nilDONE">DONE</span> Exercise 4.40</a></li>
<li><a href="#orgheadline70"><span class="done nilDONE">DONE</span> Exercise 4.41</a></li>
<li><a href="#orgheadline71"><span class="done nilDONE">DONE</span> Exercise 4.42</a></li>
<li><a href="#orgheadline72"><span class="todo nilNEXT">NEXT</span> Exercise 4.43</a></li>
<li><a href="#orgheadline73"><span class="todo nilTODO">TODO</span> Exercise 4.44</a></li>
<li><a href="#orgheadline74"><span class="todo nilTODO">TODO</span> Exercise 4.45</a></li>
<li><a href="#orgheadline75"><span class="todo nilTODO">TODO</span> Exercise 4.46</a></li>
<li><a href="#orgheadline76"><span class="todo nilTODO">TODO</span> Exercise 4.47</a></li>
<li><a href="#orgheadline77"><span class="todo nilTODO">TODO</span> Exercise 4.48</a></li>
<li><a href="#orgheadline78"><span class="todo nilTODO">TODO</span> Exercise 4.49</a></li>
</ul>
</li>
<li><a href="#orgheadline86"><span class="todo nilTODO">TODO</span> 4.3.3: Implementing the Amb Evaluator <code>[/]</code></a>
<ul>
<li><a href="#orgheadline80"><span class="todo nilTODO">TODO</span> Read SICP 4.3.3</a></li>
<li><a href="#orgheadline81"><span class="todo nilTODO">TODO</span> Exercise 4.50</a></li>
<li><a href="#orgheadline82"><span class="todo nilTODO">TODO</span> Exercise 4.51</a></li>
<li><a href="#orgheadline83"><span class="todo nilTODO">TODO</span> Exercise 4.52</a></li>
<li><a href="#orgheadline84"><span class="todo nilTODO">TODO</span> Exercise 4.53</a></li>
<li><a href="#orgheadline85"><span class="todo nilTODO">TODO</span> Exercise 4.54</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline121"><span class="todo nilTODO">TODO</span> 4.4: Logic Programming <code>[%]</code></a>
<ul>
<li><a href="#orgheadline88"><span class="todo nilTODO">TODO</span> 4.4.1: Deductive Information Retrieval <code>[7/10]</code></a>
<ul>
<li><a href="#orgheadline89"><span class="done nilDONE">DONE</span> Read SICP 4.4.1</a></li>
<li><a href="#orgheadline90"><span class="done nilDONE">DONE</span> Exercise 4.55</a></li>
<li><a href="#orgheadline91"><span class="done nilDONE">DONE</span> Exercise 4.56</a></li>
<li><a href="#orgheadline92"><span class="done nilDONE">DONE</span> Exercise 4.57</a></li>
<li><a href="#orgheadline93"><span class="done nilDONE">DONE</span> Exercise 4.58</a></li>
<li><a href="#orgheadline94"><span class="done nilDONE">DONE</span> Exercise 4.59</a></li>
<li><a href="#orgheadline95"><span class="done nilDONE">DONE</span> Exercise 4.60</a></li>
<li><a href="#orgheadline96"><span class="todo nilTODO">TODO</span> Exercise 4.61</a></li>
<li><a href="#orgheadline97"><span class="todo nilTODO">TODO</span> Exercise 4.62</a></li>
<li><a href="#orgheadline98"><span class="todo nilTODO">TODO</span> Exercise 4.63</a></li>
</ul>
</li>
<li><a href="#orgheadline99"><span class="todo nilTODO">TODO</span> 4.4.2: How the Query System Works <code>[/]</code></a>
<ul>
<li><a href="#orgheadline100"><span class="todo nilTODO">TODO</span> Read SICP 4.4.2</a></li>
</ul>
</li>
<li><a href="#orgheadline108"><span class="todo nilTODO">TODO</span> 4.4.3: Is Logic Programming Mathematical Logic? <code>[/]</code></a>
<ul>
<li><a href="#orgheadline101"><span class="todo nilTODO">TODO</span> Read SICP 4.4.3</a></li>
<li><a href="#orgheadline102"><span class="todo nilTODO">TODO</span> Exercise 4.64</a></li>
<li><a href="#orgheadline103"><span class="todo nilTODO">TODO</span> Exercise 4.65</a></li>
<li><a href="#orgheadline104"><span class="todo nilTODO">TODO</span> Exercise 4.66</a></li>
<li><a href="#orgheadline105"><span class="todo nilTODO">TODO</span> Exercise 4.67</a></li>
<li><a href="#orgheadline106"><span class="todo nilTODO">TODO</span> Exercise 4.68</a></li>
<li><a href="#orgheadline107"><span class="todo nilTODO">TODO</span> Exercise 4.69</a></li>
</ul>
</li>
<li><a href="#orgheadline120"><span class="todo nilTODO">TODO</span> 4.4.4: Implementing the Query System <code>[/]</code></a>
<ul>
<li><a href="#orgheadline109"><span class="todo nilTODO">TODO</span> Read SICP 4.4.4</a></li>
<li><a href="#orgheadline110"><span class="todo nilTODO">TODO</span> Exercise 4.70</a></li>
<li><a href="#orgheadline111"><span class="todo nilTODO">TODO</span> Exercise 4.71</a></li>
<li><a href="#orgheadline112"><span class="todo nilTODO">TODO</span> Exercise 4.72</a></li>
<li><a href="#orgheadline113"><span class="todo nilTODO">TODO</span> Exercise 4.73</a></li>
<li><a href="#orgheadline114"><span class="todo nilTODO">TODO</span> Exercise 4.74</a></li>
<li><a href="#orgheadline115"><span class="todo nilTODO">TODO</span> Exercise 4.75</a></li>
<li><a href="#orgheadline116"><span class="todo nilTODO">TODO</span> Exercise 4.76</a></li>
<li><a href="#orgheadline117"><span class="todo nilTODO">TODO</span> Exercise 4.77</a></li>
<li><a href="#orgheadline118"><span class="todo nilTODO">TODO</span> Exercise 4.78</a></li>
<li><a href="#orgheadline119"><span class="todo nilTODO">TODO</span> Exercise 4.79</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline122" class="outline-2">
<h2 id="orgheadline122"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-25.html#%_chap_4">Chapter 4: Metalinguistic Abstraction</a> <code>[%]</code></h2>
<div class="outline-text-2" id="text-orgheadline122">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-26.html#%_sec_4.1">4.1: The Metacircular Evaluator</a> <code>[28%]</code></h3>
<div class="outline-text-3" id="text-orgheadline1">
<ul class="org-ul">
<li>Note taken on <span class="timestamp-wrapper"><span class="timestamp">[2015-02-01 Sun 19:22] </span></span> <br  />
We seem to have a working evaluator now.</li>
</ul>
<ul class="org-ul">
<li>Note taken on <span class="timestamp-wrapper"><span class="timestamp">[2015-02-01 Sun 17:51] </span></span> <br  />
Will take a pass through this section to implement the entire evaluator before
doing more of the exercises.</li>
</ul>
</div>
