ch4/ch4.org
*** Code
    :PROPERTIES:
    :VISIBILITY: folded
    :END:

For convenience, put the entire metacircular interpreter here:

#+BEGIN_SRC scheme :tangle interp-sec-4-1.scm
  <<primitive-expressions>>
  <<derived-expressions>>
  <<evaluator-structs>>
  <<evaluator-running>>
  <<eval-sec-4-1>>
#+END_SRC

- Main body of ~eval~:

  #+NAME: eval-sec-4-1
  #+BEGIN_SRC scheme
    <<eval-sec-4-1-aux>>
    (define (eval-4-1 exp env)
      (cond ((self-evaluating? exp) exp)
            ((boolean-object? exp) (make-boolean-object exp))
            ((variable? exp) (lookup-variable-value exp env))
            ((quoted? exp) (text-of-quotation exp))
            ((assignment? exp) (eval-assignment exp env))
            ((definition? exp) (eval-definition exp env))
            ((if? exp) (eval-if exp env))
            ((lambda? exp)
             (make-procedure (lambda-parameters exp)
                             (lambda-body exp)
                             env))
            ((begin? exp)
             (eval-sequence (begin-actions exp) env))
            ((cond? exp) (eval-4-1 (cond->if exp) env))
            ((application? exp)
             (apply-4-1 (eval-4-1 (operator exp) env)
                        (list-of-values (operands exp) env)))
            (else
             (error "Unknown expression type -- EVAL" exp))))
  #+END_SRC

- Auxiliary procedures:

  #+NAME: eval-sec-4-1-aux
  #+BEGIN_SRC scheme
    (define (apply-4-1 procedure arguments)
      (cond ((primitive-procedure? procedure)
             (apply-primitive-procedure procedure arguments))
            ((compound-procedure? procedure)
             (eval-sequence
              (procedure-body procedure)
              (extend-environment
               (procedure-parameters procedure)
               arguments
               (procedure-environment procedure))))
            (else
             (error
              "Unknown procedure type -- APPLY-4-1" procedure))))

    (define (list-of-values exps env)
      (if (no-operands? exps)
          '()
          (cons (eval-4-1 (first-operand exps) env)
                (list-of-values (rest-operands exps) env))))

    (define (eval-if exp env)
      (if (true? (eval-4-1 (if-predicate exp) env))
          (eval-4-1 (if-consequent exp) env)
          (eval-4-1 (if-alternative exp) env)))

    (define (eval-sequence exps env)
      (cond ((last-exp? exps) (eval-4-1 (first-exp exps) env))
            (else (eval-4-1 (first-exp exps) env)
                  (eval-sequence (rest-exps exps) env))))

    <<ex-4-4-eval-and-or>>
    <<ex-4-5-cond-recipient>>

    (define (eval-assignment exp env)
      (set-variable-value! (assignment-variable exp)
                           (eval-4-1 (assignment-value exp) env)
                           env)
      'ok)

    (define (eval-definition exp env)
      (define-variable! (definition-variable exp)
        (eval-4-1 (definition-value exp) env)
        env)
      'ok)
  #+END_SRC

*** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-26.html#%_sec_4.1.1][4.1.1: The Core of the Evaluator]] [2/2]
**** DONE Read SICP 4.1.1
     SCHEDULED: <2015-01-10 Sat>
     CLOCK: [2015-01-10 Sat 12:53]--[2015-01-10 Sat 13:04] =>  0:11
     :PROPERTIES:
     :Effort:   0:15
     :END:
