ch4/ch4.html

<div id="outline-container-orgheadline2" class="outline-4">
<h4 id="orgheadline2">Code</h4>
<div class="outline-text-4" id="text-orgheadline2">
<p>
For convenience, put the entire metacircular interpreter here:
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #228b22;">&lt;&lt;primitive-expressions&gt;&gt;</span>
<span style="color: #228b22;">&lt;&lt;derived-expressions&gt;&gt;</span>
<span style="color: #228b22;">&lt;&lt;evaluator-structs&gt;&gt;</span>
<span style="color: #228b22;">&lt;&lt;evaluator-running&gt;&gt;</span>
<span style="color: #228b22;">&lt;&lt;eval-sec-4-1&gt;&gt;</span>
</pre>
</div>

<ul class="org-ul">
<li><p>
Main body of <code>eval</code>:
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock1"><span style="color: #228b22;">&lt;&lt;eval-sec-4-1-aux&gt;&gt;</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">eval-4-1</span> exp env<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>self-evaluating? exp<span style="color: #709870;">)</span> exp<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>boolean-object? exp<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>make-boolean-object exp<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>variable? exp<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>lookup-variable-value exp env<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>quoted? exp<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>text-of-quotation exp<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>assignment? exp<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>eval-assignment exp env<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>definition? exp<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>eval-definition exp env<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>if? exp<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>eval-if exp env<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>lambda? exp<span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>make-procedure <span style="color: #907373;">(</span>lambda-parameters exp<span style="color: #907373;">)</span>
                         <span style="color: #907373;">(</span>lambda-body exp<span style="color: #907373;">)</span>
                         env<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>begin? exp<span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>eval-sequence <span style="color: #907373;">(</span>begin-actions exp<span style="color: #907373;">)</span> env<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>cond? exp<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>eval-4-1 <span style="color: #907373;">(</span>cond-&gt;if exp<span style="color: #907373;">)</span> env<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>application? exp<span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>apply-4-1 <span style="color: #907373;">(</span>eval-4-1 <span style="color: #6276ba;">(</span>operator exp<span style="color: #6276ba;">)</span> env<span style="color: #907373;">)</span>
                    <span style="color: #907373;">(</span>list-of-values <span style="color: #6276ba;">(</span>operands exp<span style="color: #6276ba;">)</span> env<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #a020f0;">else</span>
         <span style="color: #709870;">(</span>error <span style="color: #8b2252;">"Unknown expression type -- EVAL"</span> exp<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div></li>

<li><p>
Auxiliary procedures:
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock2"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">apply-4-1</span> procedure arguments<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>primitive-procedure? procedure<span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>apply-primitive-procedure procedure arguments<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>compound-procedure? procedure<span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>eval-sequence
          <span style="color: #907373;">(</span>procedure-body procedure<span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>extend-environment
           <span style="color: #6276ba;">(</span>procedure-parameters procedure<span style="color: #6276ba;">)</span>
           arguments
           <span style="color: #6276ba;">(</span>procedure-environment procedure<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #a020f0;">else</span>
         <span style="color: #709870;">(</span>error
          <span style="color: #8b2252;">"Unknown procedure type -- APPLY-4-1"</span> procedure<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">list-of-values</span> exps env<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">if</span> <span style="color: #909183;">(</span>no-operands? exps<span style="color: #909183;">)</span>
      '<span style="color: #909183;">()</span>
      <span style="color: #909183;">(</span>cons <span style="color: #709870;">(</span>eval-4-1 <span style="color: #907373;">(</span>first-operand exps<span style="color: #907373;">)</span> env<span style="color: #709870;">)</span>
            <span style="color: #709870;">(</span>list-of-values <span style="color: #907373;">(</span>rest-operands exps<span style="color: #907373;">)</span> env<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">eval-if</span> exp env<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">if</span> <span style="color: #909183;">(</span>true? <span style="color: #709870;">(</span>eval-4-1 <span style="color: #907373;">(</span>if-predicate exp<span style="color: #907373;">)</span> env<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>eval-4-1 <span style="color: #709870;">(</span>if-consequent exp<span style="color: #709870;">)</span> env<span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>eval-4-1 <span style="color: #709870;">(</span>if-alternative exp<span style="color: #709870;">)</span> env<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">eval-sequence</span> exps env<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>last-exp? exps<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>eval-4-1 <span style="color: #907373;">(</span>first-exp exps<span style="color: #907373;">)</span> env<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #a020f0;">else</span> <span style="color: #709870;">(</span>eval-4-1 <span style="color: #907373;">(</span>first-exp exps<span style="color: #907373;">)</span> env<span style="color: #709870;">)</span>
              <span style="color: #709870;">(</span>eval-sequence <span style="color: #907373;">(</span>rest-exps exps<span style="color: #907373;">)</span> env<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #228b22;">&lt;&lt;ex-4-4-eval-and-or&gt;&gt;</span>
<span style="color: #228b22;">&lt;&lt;ex-4-5-cond-recipient&gt;&gt;</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">eval-assignment</span> exp env<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>set-variable-value! <span style="color: #909183;">(</span>assignment-variable exp<span style="color: #909183;">)</span>
                       <span style="color: #909183;">(</span>eval-4-1 <span style="color: #709870;">(</span>assignment-value exp<span style="color: #709870;">)</span> env<span style="color: #909183;">)</span>
                       env<span style="color: #7388d6;">)</span>
  'ok<span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">eval-definition</span> exp env<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>define-variable! <span style="color: #909183;">(</span>definition-variable exp<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>eval-4-1 <span style="color: #709870;">(</span>definition-value exp<span style="color: #709870;">)</span> env<span style="color: #909183;">)</span>
    env<span style="color: #7388d6;">)</span>
  'ok<span style="color: #707183;">)</span>
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-4">
<h4 id="orgheadline5"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-26.html#%_sec_4.1.1">4.1.1: The Core of the Evaluator</a> <code>[2/2]</code></h4>
<div class="outline-text-4" id="text-orgheadline5">
</div><div id="outline-container-orgheadline3" class="outline-5">
<h5 id="orgheadline3"><span class="done DONE">DONE</span> Read SICP 4.1.1</h5>
<div class="outline-text-5" id="text-orgheadline3">
<p>
:Effort:   0:15
</p>
</div>
</div>
