ch4/ch4.org
**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-26.html#%_thm_4.1][Exercise 4.1]]
     SCHEDULED: <2015-01-10 Sat>
     CLOCK: [2015-01-10 Sat 16:48]--[2015-01-10 Sat 17:23] =>  0:35

In the original version of the ~list-of-values~ procedure (shown here),

#+BEGIN_SRC scheme
(define (list-of-values exps env)
(if (no-operands? exps)
    '()
    (cons (eval-4-1 (first-operand exps) env)
          (list-of-values (rest-operands exps) env))))
#+END_SRC

whether the first or the rest of the operands of the list is evaluated
first depends on the evaluation order of the underlying
Lisp. Specifically, if the Lisp evaluates from left to right,
~first-operand~ will be called before ~rest-operands~; if the Lisp
evaluates from right to left, ~rest-operands~ is instead called first,
producing a right-to-left evaluating version of ~list-of-values~.

To guarantee the order of execution, one can take advantage of the fact
that the ~begin~ form is guaranteed to evaluate its arguments in order to
write both an explicitly left-to-right version

#+BEGIN_SRC scheme :tangle ex-4-1-ltr.scm
(define (list-of-values exps env)
(if (no-operands? exps)
    '()
    (begin
      ;; First evaluate the leftmost expression, then the rest of the
      ;; expression on the right.
      (define first-expr (eval-4-1 (first-operand exps) env))
      (define rest-expr (list-of-values (rest-operands exps) env))
      (cons first-expr rest-expr))))
#+END_SRC

and a right-to-left version:

#+BEGIN_SRC scheme :tangle ex-4-1-rtl.scm
(define (list-of-values exps env)
(if (no-operands? exps)
    '()
    (begin
      ;; First evaluate the expressions on the right, then the leftmost
      ;; expression.
      (define rest-expr (list-of-values (rest-operands exps) env))
      (define first-expr (eval-4-1 (first-operand exps) env))
      (cons first-expr rest-expr))))
#+END_SRC

Test to confirm:

#+BEGIN_SRC scheme :tangle ex-4-1-test.scm
  (include "interp-sec-4-1")
  (use test)

  ;; Override EVAL for ease of testing
  (define *test-list* '())
  (define eval-4-1
    (lambda (expr env)
      (set! *test-list* (append *test-list* (list expr)))))
  (define input-list '(0 1 2 3 4 5))

  (include "ex-4-1-ltr")
  (set! *test-list* '())
  (list-of-values input-list '())
  (test '(0 1 2 3 4 5) *test-list*)

  (include "ex-4-1-rtl")
  (set! *test-list* '())
  (list-of-values input-list '())
  (test '(5 4 3 2 1 0) *test-list*)
#+END_SRC

     :PROPERTIES:
     :Effort:   0:30
     :END:
*** NEXT [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-26.html#%_sec_4.1.2][4.1.2: Representing Expressions]] [7/10]
