ch4/ch4.html
<div id="outline-container-orgheadline4" class="outline-5">
<h5 id="orgheadline4"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-26.html#%_thm_4.1">Exercise 4.1</a></h5>
<div class="outline-text-5" id="text-orgheadline4">
<p>
In the original version of the <code>list-of-values</code> procedure (shown here),
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">list-of-values</span> exps env<span style="color: #7388d6;">)</span>
<span style="color: #7388d6;">(</span><span style="color: #a020f0;">if</span> <span style="color: #909183;">(</span>no-operands? exps<span style="color: #909183;">)</span>
    '<span style="color: #909183;">()</span>
    <span style="color: #909183;">(</span>cons <span style="color: #709870;">(</span>eval-4-1 <span style="color: #907373;">(</span>first-operand exps<span style="color: #907373;">)</span> env<span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span>list-of-values <span style="color: #907373;">(</span>rest-operands exps<span style="color: #907373;">)</span> env<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
whether the first or the rest of the operands of the list is evaluated
first depends on the evaluation order of the underlying
Lisp. Specifically, if the Lisp evaluates from left to right,
<code>first-operand</code> will be called before <code>rest-operands</code>; if the Lisp
evaluates from right to left, <code>rest-operands</code> is instead called first,
producing a right-to-left evaluating version of <code>list-of-values</code>.
</p>

<p>
To guarantee the order of execution, one can take advantage of the fact
that the <code>begin</code> form is guaranteed to evaluate its arguments in order to
write both an explicitly left-to-right version
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">list-of-values</span> exps env<span style="color: #7388d6;">)</span>
<span style="color: #7388d6;">(</span><span style="color: #a020f0;">if</span> <span style="color: #909183;">(</span>no-operands? exps<span style="color: #909183;">)</span>
    '<span style="color: #909183;">()</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">begin</span>
      <span style="color: #b22222;">;; </span><span style="color: #b22222;">First evaluate the leftmost expression, then the rest of the</span>
      <span style="color: #b22222;">;; </span><span style="color: #b22222;">expression on the right.</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">first-expr</span> <span style="color: #907373;">(</span>eval-4-1 <span style="color: #6276ba;">(</span>first-operand exps<span style="color: #6276ba;">)</span> env<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">rest-expr</span> <span style="color: #907373;">(</span>list-of-values <span style="color: #6276ba;">(</span>rest-operands exps<span style="color: #6276ba;">)</span> env<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>cons first-expr rest-expr<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
and a right-to-left version:
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">list-of-values</span> exps env<span style="color: #7388d6;">)</span>
<span style="color: #7388d6;">(</span><span style="color: #a020f0;">if</span> <span style="color: #909183;">(</span>no-operands? exps<span style="color: #909183;">)</span>
    '<span style="color: #909183;">()</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">begin</span>
      <span style="color: #b22222;">;; </span><span style="color: #b22222;">First evaluate the expressions on the right, then the leftmost</span>
      <span style="color: #b22222;">;; </span><span style="color: #b22222;">expression.</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">rest-expr</span> <span style="color: #907373;">(</span>list-of-values <span style="color: #6276ba;">(</span>rest-operands exps<span style="color: #6276ba;">)</span> env<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">first-expr</span> <span style="color: #907373;">(</span>eval-4-1 <span style="color: #6276ba;">(</span>first-operand exps<span style="color: #6276ba;">)</span> env<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>cons first-expr rest-expr<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
Test to confirm:
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span>include <span style="color: #8b2252;">"interp-sec-4-1"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> test<span style="color: #707183;">)</span>

<span style="color: #b22222;">;; </span><span style="color: #b22222;">Override EVAL for ease of testing</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">*test-list*</span> '<span style="color: #7388d6;">()</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">eval-4-1</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #909183;">(</span>expr env<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">set!</span> *test-list* <span style="color: #709870;">(</span>append *test-list* <span style="color: #907373;">(</span>list expr<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">input-list</span> '<span style="color: #7388d6;">(</span>0 1 2 3 4 5<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span>include <span style="color: #8b2252;">"ex-4-1-ltr"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">set!</span> *test-list* '<span style="color: #7388d6;">()</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>list-of-values input-list '<span style="color: #7388d6;">()</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test '<span style="color: #7388d6;">(</span>0 1 2 3 4 5<span style="color: #7388d6;">)</span> *test-list*<span style="color: #707183;">)</span>

<span style="color: #707183;">(</span>include <span style="color: #8b2252;">"ex-4-1-rtl"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">set!</span> *test-list* '<span style="color: #7388d6;">()</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>list-of-values input-list '<span style="color: #7388d6;">()</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test '<span style="color: #7388d6;">(</span>5 4 3 2 1 0<span style="color: #7388d6;">)</span> *test-list*<span style="color: #707183;">)</span>
</pre>
</div>

<p>
:Effort:   0:30
</p>
</div>
</div>
</div>
<div id="outline-container-orgheadline17" class="outline-4">
<h4 id="orgheadline17"><span class="todo NEXT">NEXT</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-26.html#%_sec_4.1.2">4.1.2: Representing Expressions</a> <code>[7/10]</code></h4>
