ch4/ch4.org
**** Code
     :PROPERTIES:
     :VISIBILITY: folded
     :END:

Here's the code for the basic constructs of the interpreter, as defined in
the text:

- Primitive expressions:

  #+NAME: primitive-expressions
  #+BEGIN_SRC scheme
    <<self-evaluating>>
    <<booleans>>
    <<variables>>
    <<quotations>>
    <<assignments>>
    <<definitions>>
    <<lambda-expressions>>
    <<conditionals>>
    <<sequences>>
    <<procedure-application>>
  #+END_SRC

- Self-evaluating items:

  #+NAME: self-evaluating
  #+BEGIN_SRC scheme
    (define (self-evaluating? exp)
      (cond ((number? exp) #t)
            ((string? exp) #t)
            ((boolean? exp) #t)
            (else #f)))
  #+END_SRC

- Boolean:

  #+NAME: booleans
  #+BEGIN_SRC scheme
    (define (boolean-object? exp)
      (or (eq? exp #t) (eq? exp #f)))
    (define (make-boolean-object exp)
      (cond ((eq? exp #t) true)
            ((eq? exp #f) false)
            (else (error "MAKE-BOOLEAN -- passed non-boolean"))))
  #+END_SRC

- Variables:

  #+NAME: variables
  #+BEGIN_SRC scheme
    (define (variable? exp) (symbol? exp))
  #+END_SRC

- Quotations:

  #+NAME: quotations
  #+BEGIN_SRC scheme
    (define (quoted? exp)
      (tagged-list? exp 'quote))

    (define (text-of-quotation exp) (cadr exp))

    (define (tagged-list? exp tag)
      (if (pair? exp)
          (eq? (car exp) tag)
          #f))
  #+END_SRC

- Assignments:

  #+NAME: assignments
  #+BEGIN_SRC scheme
    (define (assignment? exp)
      (tagged-list? exp 'set!))
    (define (assignment-variable exp) (cadr exp))
    (define (assignment-value exp) (caddr exp))
  #+END_SRC

  - Definitions:

  #+NAME: definitions
  #+BEGIN_SRC scheme
    (define (definition? exp)
      (tagged-list? exp 'define))
    (define (definition-variable exp)
      (if (symbol? (cadr exp))
          (cadr exp)
          (caadr exp)))
    (define (definition-value exp)
      (if (symbol? (cadr exp))
          (caddr exp)
          (make-lambda (cdadr exp)   ; formal parameters
                       (cddr exp)))) ; body
  #+END_SRC

  - Lambda expressions:

  #+NAME: lambda-expressions
  #+BEGIN_SRC scheme
    (define (lambda? exp) (tagged-list? exp 'lambda))
    (define (lambda-parameters exp) (cadr exp))
    (define (lambda-body exp) (cddr exp))

    (define (make-lambda parameters body)
      (cons 'lambda (cons parameters body)))

  #+END_SRC

- Conditionals:

  #+NAME: conditionals
  #+BEGIN_SRC scheme
    (define (if? exp) (tagged-list? exp 'if))
    (define (if-predicate exp) (cadr exp))
    (define (if-consequent exp) (caddr exp))
    (define (if-alternative exp)
      (if (not (null? (cdddr exp)))
          (cadddr exp)
          'false))

    (define (make-if predicate consequent alternative)
      (list 'if predicate consequent alternative))
  #+END_SRC

- Sequences:

  #+NAME: sequences
  #+BEGIN_SRC scheme
    (define (begin? exp) (tagged-list? exp 'begin))
    (define (begin-actions exp) (cdr exp))
    (define (last-exp? seq) (null? (cdr seq)))
    (define (first-exp seq) (car seq))
    (define (rest-exps seq) (cdr seq))

    (define (sequence->exp seq)
      (cond ((null? seq) seq)
            ((last-exp? seq) (first-exp seq))
            (else (make-begin seq))))
    (define (make-begin seq) (cons 'begin seq))
  #+END_SRC

- Procedure application:

  #+NAME: procedure-application
  #+BEGIN_SRC scheme
    (define (application? exp) (pair? exp))
    (define (operator exp) (car exp))
    (define (operands exp) (cdr exp))
    (define (no-operands? ops) (null? ops))
    (define (first-operand ops) (car ops))
    (define (rest-operands ops) (cdr ops))
  #+END_SRC

  - Derived expressions:

  #+NAME: derived-expressions
  #+BEGIN_SRC scheme
    <<derived-expressions-cond>>
    <<derived-expressions-let>>
    <<derived-expressions-while>>
  #+END_SRC

    - ~cond~:

    #+NAME: derived-expressions-cond
    #+BEGIN_SRC scheme
      (define (cond? exp) (tagged-list? exp 'cond))
      (define (cond-clauses exp) (cdr exp))
      (define (cond-else-clause? clause)
        (eq? (cond-predicate clause) 'else))
      (define (cond-predicate clause) (car clause))
      (define (cond-actions clause) (cdr clause))
      (define (cond->if exp)
        (expand-clauses (cond-clauses exp)))

      (define (expand-clauses clauses)
        (if (null? clauses)
            'false                          ; no else clause
            (let ((first (car clauses))
                  (rest (cdr clauses)))
              (if (cond-else-clause? first)
                  (if (null? rest)
                      (sequence->exp (cond-actions first))
                      (error "ELSE clause isn't last -- COND->IF"
                             clauses))
                  (make-if (cond-predicate first)
                           (sequence->exp (cond-actions first))
                           (expand-clauses rest))))))
    #+END_SRC

    - ~let~:

    #+NAME: derived-expressions-let
    #+BEGIN_SRC scheme
      <<ex-4-7-let-star>>
      <<ex-4-8-let-named>>
    #+END_SRC

    - ~while~:

    #+NAME: derived-expressions-while
    #+BEGIN_SRC scheme
      <<ex-4-9-while>>
    #+END_SRC

