ch4/ch4.html
<div class="outline-text-4" id="text-orgheadline17">
</div><div id="outline-container-orgheadline6" class="outline-5">
<h5 id="orgheadline6">Code</h5>
<div class="outline-text-5" id="text-orgheadline6">
<p>
Here's the code for the basic constructs of the interpreter, as defined in
the text:
</p>

<ul class="org-ul">
<li><p>
Primitive expressions:
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock3"><span style="color: #228b22;">&lt;&lt;self-evaluating&gt;&gt;</span>
<span style="color: #228b22;">&lt;&lt;booleans&gt;&gt;</span>
<span style="color: #228b22;">&lt;&lt;variables&gt;&gt;</span>
<span style="color: #228b22;">&lt;&lt;quotations&gt;&gt;</span>
<span style="color: #228b22;">&lt;&lt;assignments&gt;&gt;</span>
<span style="color: #228b22;">&lt;&lt;definitions&gt;&gt;</span>
<span style="color: #228b22;">&lt;&lt;lambda-expressions&gt;&gt;</span>
<span style="color: #228b22;">&lt;&lt;conditionals&gt;&gt;</span>
<span style="color: #228b22;">&lt;&lt;sequences&gt;&gt;</span>
<span style="color: #228b22;">&lt;&lt;procedure-application&gt;&gt;</span>
</pre>
</div></li>

<li><p>
Self-evaluating items:
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock4"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">self-evaluating?</span> exp<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>number? exp<span style="color: #709870;">)</span> #t<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>string? exp<span style="color: #709870;">)</span> #t<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>boolean? exp<span style="color: #709870;">)</span> #t<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #a020f0;">else</span> #f<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div></li>

<li><p>
Boolean:
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock5"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">boolean-object?</span> exp<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">or</span> <span style="color: #909183;">(</span>eq? exp #t<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>eq? exp #f<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">make-boolean-object</span> exp<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>eq? exp #t<span style="color: #709870;">)</span> true<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>eq? exp #f<span style="color: #709870;">)</span> false<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #a020f0;">else</span> <span style="color: #709870;">(</span>error <span style="color: #8b2252;">"MAKE-BOOLEAN -- passed non-boolean"</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div></li>

<li><p>
Variables:
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock6"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">variable?</span> exp<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>symbol? exp<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div></li>

<li><p>
Quotations:
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock7"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">quoted?</span> exp<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>tagged-list? exp 'quote<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">text-of-quotation</span> exp<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>cadr exp<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">tagged-list?</span> exp tag<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">if</span> <span style="color: #909183;">(</span>pair? exp<span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>eq? <span style="color: #709870;">(</span>car exp<span style="color: #709870;">)</span> tag<span style="color: #909183;">)</span>
      #f<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div></li>

<li><p>
Assignments:
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock8"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">assignment?</span> exp<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>tagged-list? exp 'set!<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">assignment-variable</span> exp<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>cadr exp<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">assignment-value</span> exp<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>caddr exp<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<ul class="org-ul">
<li>Definitions:</li>
</ul>
<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock9"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">definition?</span> exp<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>tagged-list? exp 'define<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">definition-variable</span> exp<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">if</span> <span style="color: #909183;">(</span>symbol? <span style="color: #709870;">(</span>cadr exp<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>cadr exp<span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>caadr exp<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">definition-value</span> exp<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">if</span> <span style="color: #909183;">(</span>symbol? <span style="color: #709870;">(</span>cadr exp<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>caddr exp<span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>make-lambda <span style="color: #709870;">(</span>cdadr exp<span style="color: #709870;">)</span>   <span style="color: #b22222;">; </span><span style="color: #b22222;">formal parameters</span>
                   <span style="color: #709870;">(</span>cddr exp<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span> <span style="color: #b22222;">; </span><span style="color: #b22222;">body</span>
</pre>
</div>

<ul class="org-ul">
<li>Lambda expressions:</li>
</ul>
<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock10"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">lambda?</span> exp<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>tagged-list? exp 'lambda<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">lambda-parameters</span> exp<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>cadr exp<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">lambda-body</span> exp<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>cddr exp<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">make-lambda</span> parameters body<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>cons 'lambda <span style="color: #909183;">(</span>cons parameters body<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div></li>

<li><p>
Conditionals:
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock11"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">if?</span> exp<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>tagged-list? exp 'if<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">if-predicate</span> exp<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>cadr exp<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">if-consequent</span> exp<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>caddr exp<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">if-alternative</span> exp<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">if</span> <span style="color: #909183;">(</span>not <span style="color: #709870;">(</span>null? <span style="color: #907373;">(</span>cdddr exp<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>cadddr exp<span style="color: #909183;">)</span>
      'false<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">make-if</span> predicate consequent alternative<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>list 'if predicate consequent alternative<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div></li>

<li><p>
Sequences:
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock12"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">begin?</span> exp<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>tagged-list? exp 'begin<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">begin-actions</span> exp<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>cdr exp<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">last-exp?</span> seq<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>null? <span style="color: #909183;">(</span>cdr seq<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">first-exp</span> seq<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>car seq<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">rest-exps</span> seq<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>cdr seq<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">sequence-&gt;exp</span> seq<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>null? seq<span style="color: #709870;">)</span> seq<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>last-exp? seq<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>first-exp seq<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #a020f0;">else</span> <span style="color: #709870;">(</span>make-begin seq<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">make-begin</span> seq<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>cons 'begin seq<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div></li>

<li><p>
Procedure application:
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock13"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">application?</span> exp<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>pair? exp<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">operator</span> exp<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>car exp<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">operands</span> exp<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>cdr exp<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">no-operands?</span> ops<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>null? ops<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">first-operand</span> ops<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>car ops<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">rest-operands</span> ops<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>cdr ops<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<ul class="org-ul">
<li>Derived expressions:</li>
</ul>
<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock14"><span style="color: #228b22;">&lt;&lt;derived-expressions-cond&gt;&gt;</span>
<span style="color: #228b22;">&lt;&lt;derived-expressions-let&gt;&gt;</span>
<span style="color: #228b22;">&lt;&lt;derived-expressions-while&gt;&gt;</span>
</pre>
</div>

<ul class="org-ul">
<li><code>cond</code>:</li>
</ul>
<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock15"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">cond?</span> exp<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>tagged-list? exp 'cond<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">cond-clauses</span> exp<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>cdr exp<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">cond-else-clause?</span> clause<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>eq? <span style="color: #909183;">(</span>cond-predicate clause<span style="color: #909183;">)</span> 'else<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">cond-predicate</span> clause<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>car clause<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">cond-actions</span> clause<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>cdr clause<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">cond-&gt;if</span> exp<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>expand-clauses <span style="color: #909183;">(</span>cond-clauses exp<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">expand-clauses</span> clauses<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">if</span> <span style="color: #909183;">(</span>null? clauses<span style="color: #909183;">)</span>
      'false                          <span style="color: #b22222;">; </span><span style="color: #b22222;">no else clause</span>
      <span style="color: #909183;">(</span><span style="color: #a020f0;">let</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>first <span style="color: #6276ba;">(</span>car clauses<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span>rest <span style="color: #6276ba;">(</span>cdr clauses<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span><span style="color: #a020f0;">if</span> <span style="color: #907373;">(</span>cond-else-clause? first<span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span><span style="color: #a020f0;">if</span> <span style="color: #6276ba;">(</span>null? rest<span style="color: #6276ba;">)</span>
                <span style="color: #6276ba;">(</span>sequence-&gt;exp <span style="color: #858580;">(</span>cond-actions first<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
                <span style="color: #6276ba;">(</span>error <span style="color: #8b2252;">"ELSE clause isn't last -- COND-&gt;IF"</span>
                       clauses<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span>make-if <span style="color: #6276ba;">(</span>cond-predicate first<span style="color: #6276ba;">)</span>
                     <span style="color: #6276ba;">(</span>sequence-&gt;exp <span style="color: #858580;">(</span>cond-actions first<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
                     <span style="color: #6276ba;">(</span>expand-clauses rest<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<ul class="org-ul">
<li><code>let</code>:</li>
</ul>
<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock16"><span style="color: #228b22;">&lt;&lt;ex-4-7-let-star&gt;&gt;</span>
<span style="color: #228b22;">&lt;&lt;ex-4-8-let-named&gt;&gt;</span>
</pre>
</div>

<ul class="org-ul">
<li><code>while</code>:</li>
</ul>
<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock17"><span style="color: #228b22;">&lt;&lt;ex-4-9-while&gt;&gt;</span>
</pre>
</div></li>
</ul>
</div>
</div>
