ch4/ch4.org
**** DONE Read SICP 4.1.2
    SCHEDULED: <2015-01-10 Sat>
    CLOCK: [2015-01-10 Sat 17:54]--[2015-01-10 Sat 18:09] =>  0:15

    :PROPERTIES:
    :Effort:   0:15
    :END:
**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-26.html#%_thm_4.2][Exercise 4.2]]
     SCHEDULED: <2015-01-10 Sat>
     CLOCK: [2015-01-10 Sat 18:13]--[2015-01-10 Sat 18:26] =>  0:13

- Louis' modification to the interpreter will fail if the operator is a
special form rather than a function that can be applied, since the
arguments to special forms might need to be evaluated in a different
manner from those to normal procedures. For example, if Louis' ~eval~ is
called on ~(define x 3)~, it will evaluate ~x~ to its value, rather than
treating ~x~ as the assignment target.

- In order to make Louis' plan work, we need to eliminate the ambiguity
between special forms and ordinary procedures in the syntax. One simple
way to do this is to denote procedure application by the special form
~call~. This can be accomplished by the following modification to the
interpreter:

  #+BEGIN_SRC scheme
    (define (application? exp)
      (and (pair? exp)
           (tagged-list? exp 'call)))
    (define (operator exp) (cadr exp))
    (define (operands exp) (cddr exp))
  #+END_SRC

  :PROPERTIES:
     :Effort:   0:15
     :END:
