ch4/ch4.html

<div id="outline-container-orgheadline7" class="outline-5">
<h5 id="orgheadline7"><span class="done DONE">DONE</span> Read SICP 4.1.2</h5>
<div class="outline-text-5" id="text-orgheadline7">
<p>
:Effort:   0:15
</p>
</div>
</div>
<div id="outline-container-orgheadline8" class="outline-5">
<h5 id="orgheadline8"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-26.html#%_thm_4.2">Exercise 4.2</a></h5>
<div class="outline-text-5" id="text-orgheadline8">
<ul class="org-ul">
<li>Louis' modification to the interpreter will fail if the operator is a</li>
</ul>
<p>
special form rather than a function that can be applied, since the
arguments to special forms might need to be evaluated in a different
manner from those to normal procedures. For example, if Louis' <code>eval</code> is
called on <code>(define x 3)</code>, it will evaluate <code>x</code> to its value, rather than
treating <code>x</code> as the assignment target.
</p>

<ul class="org-ul">
<li>In order to make Louis' plan work, we need to eliminate the ambiguity</li>
</ul>
<p>
between special forms and ordinary procedures in the syntax. One simple
way to do this is to denote procedure application by the special form
<code>call</code>. This can be accomplished by the following modification to the
interpreter:
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">application?</span> exp<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">and</span> <span style="color: #909183;">(</span>pair? exp<span style="color: #909183;">)</span>
       <span style="color: #909183;">(</span>tagged-list? exp 'call<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">operator</span> exp<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>cadr exp<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">operands</span> exp<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>cddr exp<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
:Effort:   0:15
</p>
</div>
</div>
