ch4/ch4.org
**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-26.html#%_thm_4.3][Exercise 4.3]]
     SCHEDULED: <2015-02-16 Mon>
     CLOCK: [2015-02-01 Sun 16:45]--[2015-02-01 Sun 17:12] =>  0:27
     CLOCK: [2015-01-10 Sat 18:41]--[2015-01-10 Sat 19:18] =>  0:37

     #+BEGIN_SRC scheme :tangle symbol-table.scm
       (use srfi-69)                           ; Import hash table procs
       (define (put table op type proc)
         (hash-table-set! table (cons op type) proc))
       (define (get table op type)
         (hash-table-ref/default table (cons op type) '()))
     #+END_SRC

     #+BEGIN_SRC scheme :tangle ex-4-3.scm
       <<primitive-expressions>>
       <<derived-expressions>>
       <<evaluator-structs>>
       <<evaluator-running>>
       <<eval-sec-4-1-aux>>

       (include "symbol-table")
       (define *eval-4-1-op-table* (make-parameter (make-hash-table equal?)))
       (define (eval-4-1-get type)
         (get (*eval-4-1-op-table*) 'eval type))
       (define (eval-4-1-put type proc)
         (put (*eval-4-1-op-table*) 'eval type proc))

       (define (eval-4-1 exp env)
         (cond ((self-evaluating? exp) exp)
               ((variable? exp) (lookup-variable-value exp env))
               (else (let ((method (eval-4-1-get (car exp))))
                       (cond ((not (null? method))
                              (method exp env))
                             ((application? exp)
                              (apply-4-1 (eval-4-1 (operator exp) env)
                                         (list-of-values (operands exp) env)))
                             (else
                              (error "Unknown expression type: EVAL" exp)))))))

       (eval-4-1-put 'quote
                     (lambda (exp env)
                       (text-of-quotation exp)))
       (eval-4-1-put 'set!
                     (lambda (exp env)
                       (eval-assignment exp env)))
       (eval-4-1-put 'define
                     (lambda (exp env)
                       (eval-definition exp env)))
       (eval-4-1-put 'if
                     (lambda (exp env)
                       (eval-if exp env)))
       (eval-4-1-put 'lambda
                     (lambda (exp env)
                       (make-procedure (lambda-parameters exp)
                                       (lambda-body exp)
                                       env)))
       (eval-4-1-put 'begin
                     (lambda (exp env)
                       (eval-sequence (begin-actions exp) env)))
       (eval-4-1-put 'cond
                     (lambda (exp env)
                       (eval-4-1 (cond->if exp) env)))

       <<ex-4-4-eval-and-or-dispatch>>
       <<ex-4-5-cond-recipient-dispatch>>
       <<ex-4-7-let-star-dispatch>>
       <<ex-4-8-let-named-dispatch>>
       <<ex-4-9-while-dispatch>>
       <<ex-4-13-make-unbound-dispatch>>
     #+END_SRC

     :PROPERTIES:
     :Effort:   0:30
     :END:
