ch4/ch4.html
<div id="outline-container-orgheadline9" class="outline-5">
<h5 id="orgheadline9"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-26.html#%_thm_4.3">Exercise 4.3</a></h5>
<div class="outline-text-5" id="text-orgheadline9">
<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> srfi-69<span style="color: #707183;">)</span>                           <span style="color: #b22222;">; </span><span style="color: #b22222;">Import hash table procs</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">put</span> table op type proc<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>hash-table-set! table <span style="color: #909183;">(</span>cons op type<span style="color: #909183;">)</span> proc<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">get</span> table op type<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>hash-table-ref/default table <span style="color: #909183;">(</span>cons op type<span style="color: #909183;">)</span> '<span style="color: #909183;">()</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #228b22;">&lt;&lt;primitive-expressions&gt;&gt;</span>
<span style="color: #228b22;">&lt;&lt;derived-expressions&gt;&gt;</span>
<span style="color: #228b22;">&lt;&lt;evaluator-structs&gt;&gt;</span>
<span style="color: #228b22;">&lt;&lt;evaluator-running&gt;&gt;</span>
<span style="color: #228b22;">&lt;&lt;eval-sec-4-1-aux&gt;&gt;</span>

<span style="color: #707183;">(</span>include <span style="color: #8b2252;">"symbol-table"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">*eval-4-1-op-table*</span> <span style="color: #7388d6;">(</span>make-parameter <span style="color: #909183;">(</span>make-hash-table equal?<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">eval-4-1-get</span> type<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>get <span style="color: #909183;">(</span>*eval-4-1-op-table*<span style="color: #909183;">)</span> 'eval type<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">eval-4-1-put</span> type proc<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>put <span style="color: #909183;">(</span>*eval-4-1-op-table*<span style="color: #909183;">)</span> 'eval type proc<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">eval-4-1</span> exp env<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>self-evaluating? exp<span style="color: #709870;">)</span> exp<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>variable? exp<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>lookup-variable-value exp env<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #a020f0;">else</span> <span style="color: #709870;">(</span><span style="color: #a020f0;">let</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>method <span style="color: #858580;">(</span>eval-4-1-get <span style="color: #80a880;">(</span>car exp<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
                <span style="color: #907373;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>not <span style="color: #80a880;">(</span>null? method<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                       <span style="color: #858580;">(</span>method exp env<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
                      <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>application? exp<span style="color: #858580;">)</span>
                       <span style="color: #858580;">(</span>apply-4-1 <span style="color: #80a880;">(</span>eval-4-1 <span style="color: #887070;">(</span>operator exp<span style="color: #887070;">)</span> env<span style="color: #80a880;">)</span>
                                  <span style="color: #80a880;">(</span>list-of-values <span style="color: #887070;">(</span>operands exp<span style="color: #887070;">)</span> env<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
                      <span style="color: #6276ba;">(</span><span style="color: #a020f0;">else</span>
                       <span style="color: #858580;">(</span>error <span style="color: #8b2252;">"Unknown expression type: EVAL"</span> exp<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span>eval-4-1-put 'quote
              <span style="color: #7388d6;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #909183;">(</span>exp env<span style="color: #909183;">)</span>
                <span style="color: #909183;">(</span>text-of-quotation exp<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>eval-4-1-put 'set!
              <span style="color: #7388d6;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #909183;">(</span>exp env<span style="color: #909183;">)</span>
                <span style="color: #909183;">(</span>eval-assignment exp env<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>eval-4-1-put 'define
              <span style="color: #7388d6;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #909183;">(</span>exp env<span style="color: #909183;">)</span>
                <span style="color: #909183;">(</span>eval-definition exp env<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>eval-4-1-put 'if
              <span style="color: #7388d6;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #909183;">(</span>exp env<span style="color: #909183;">)</span>
                <span style="color: #909183;">(</span>eval-if exp env<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>eval-4-1-put 'lambda
              <span style="color: #7388d6;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #909183;">(</span>exp env<span style="color: #909183;">)</span>
                <span style="color: #909183;">(</span>make-procedure <span style="color: #709870;">(</span>lambda-parameters exp<span style="color: #709870;">)</span>
                                <span style="color: #709870;">(</span>lambda-body exp<span style="color: #709870;">)</span>
                                env<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>eval-4-1-put 'begin
              <span style="color: #7388d6;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #909183;">(</span>exp env<span style="color: #909183;">)</span>
                <span style="color: #909183;">(</span>eval-sequence <span style="color: #709870;">(</span>begin-actions exp<span style="color: #709870;">)</span> env<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>eval-4-1-put 'cond
              <span style="color: #7388d6;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #909183;">(</span>exp env<span style="color: #909183;">)</span>
                <span style="color: #909183;">(</span>eval-4-1 <span style="color: #709870;">(</span>cond-&gt;if exp<span style="color: #709870;">)</span> env<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #228b22;">&lt;&lt;ex-4-4-eval-and-or-dispatch&gt;&gt;</span>
<span style="color: #228b22;">&lt;&lt;ex-4-5-cond-recipient-dispatch&gt;&gt;</span>
<span style="color: #228b22;">&lt;&lt;ex-4-7-let-star-dispatch&gt;&gt;</span>
<span style="color: #228b22;">&lt;&lt;ex-4-8-let-named-dispatch&gt;&gt;</span>
<span style="color: #228b22;">&lt;&lt;ex-4-9-while-dispatch&gt;&gt;</span>
<span style="color: #228b22;">&lt;&lt;ex-4-13-make-unbound-dispatch&gt;&gt;</span>
</pre>
</div>

<p>
:Effort:   0:30
</p>
</div>
</div>
