ch4/ch4.org
**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-26.html#%_thm_4.4][Exercise 4.4]]
     SCHEDULED: <2015-02-16 Mon>
     CLOCK: [2015-02-16 Mon 13:49]--[2015-02-16 Mon 14:02] =>  0:13

We implement these short-circuiting special forms by iterating down the list:

#+NAME: ex-4-4-eval-and-or
#+BEGIN_SRC scheme
  (define (eval-and exps env)
    (if (null? exps)
        true
        (let ((first (first-exp exps)))
             (cond ((last-exp? exps) (eval-4-1 first env))
                   ((not (true? first)) false)
                   (else (eval-and (rest-exps exps) env))))))

  (define (eval-or exps env)
    (if (null? exps)
        false
        (let ((first (first-exp exps)))
             (cond ((true? first) first)
                   (else (eval-or (rest-exps exps) env))))))
#+END_SRC

Just add them to the data-dispatch interpreter like so:

#+NAME: ex-4-4-eval-and-or-dispatch
#+BEGIN_SRC scheme
  (eval-4-1-put 'and
                (lambda (exp env)
                  (eval-and exp env)))
  (eval-4-1-put 'or
                (lambda (exp env)
                  (eval-or exp env)))
#+END_SRC

Here's a short test to ensure that they work:

#+BEGIN_SRC scheme :tangle ex-4-4-test.scm
  (include "ex-4-3")
  (use test)

  (test #t (eval-4-1 '(and) '()))
#+END_SRC

     :PROPERTIES:
     :Effort:   0:15
     :END:
