ch4/ch4.html
<div id="outline-container-orgheadline10" class="outline-5">
<h5 id="orgheadline10"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-26.html#%_thm_4.4">Exercise 4.4</a></h5>
<div class="outline-text-5" id="text-orgheadline10">
<p>
We implement these short-circuiting special forms by iterating down the list:
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock18"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">eval-and</span> exps env<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">if</span> <span style="color: #909183;">(</span>null? exps<span style="color: #909183;">)</span>
      true
      <span style="color: #909183;">(</span><span style="color: #a020f0;">let</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>first <span style="color: #6276ba;">(</span>first-exp exps<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
           <span style="color: #709870;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>last-exp? exps<span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>eval-4-1 first env<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
                 <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>not <span style="color: #858580;">(</span>true? first<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span> false<span style="color: #907373;">)</span>
                 <span style="color: #907373;">(</span><span style="color: #a020f0;">else</span> <span style="color: #6276ba;">(</span>eval-and <span style="color: #858580;">(</span>rest-exps exps<span style="color: #858580;">)</span> env<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">eval-or</span> exps env<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">if</span> <span style="color: #909183;">(</span>null? exps<span style="color: #909183;">)</span>
      false
      <span style="color: #909183;">(</span><span style="color: #a020f0;">let</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>first <span style="color: #6276ba;">(</span>first-exp exps<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
           <span style="color: #709870;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>true? first<span style="color: #6276ba;">)</span> first<span style="color: #907373;">)</span>
                 <span style="color: #907373;">(</span><span style="color: #a020f0;">else</span> <span style="color: #6276ba;">(</span>eval-or <span style="color: #858580;">(</span>rest-exps exps<span style="color: #858580;">)</span> env<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
Just add them to the data-dispatch interpreter like so:
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock19"><span style="color: #707183;">(</span>eval-4-1-put 'and
              <span style="color: #7388d6;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #909183;">(</span>exp env<span style="color: #909183;">)</span>
                <span style="color: #909183;">(</span>eval-and exp env<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>eval-4-1-put 'or
              <span style="color: #7388d6;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #909183;">(</span>exp env<span style="color: #909183;">)</span>
                <span style="color: #909183;">(</span>eval-or exp env<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
Here's a short test to ensure that they work:
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span>include <span style="color: #8b2252;">"ex-4-3"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> test<span style="color: #707183;">)</span>

<span style="color: #707183;">(</span>test #t <span style="color: #7388d6;">(</span>eval-4-1 '<span style="color: #909183;">(</span><span style="color: #a020f0;">and</span><span style="color: #909183;">)</span> '<span style="color: #909183;">()</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
:Effort:   0:15
</p>
</div>
</div>
