ch4/ch4.org
**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-26.html#%_thm_4.5][Exercise 4.5]]
     CLOCK: [2015-02-16 Mon 14:02]--[2015-02-16 Mon 14:19] =>  0:17

Let's desugar ~cond~ expressions. The ordinary ~cond~ can be desugared to a
chain of if-elses:

#+BEGIN_SRC scheme
  (cond (a b) (c d) (else e)
        ;; Equivalent to (if a b (if c d e))
        )
#+END_SRC

The ~cond~ with recipient is a little more complex. The result of evaluating
the test needs to be referred to twice, once to determine which branch to take
and once to pass to the procedure evaluated if the "true" branch is
taken. In order to make sure no variables in the test, the recipient, or the
alternate shadow each other, use \alpha-conversion to convert an if-statement of
expressions into a lambda taking these expressions as arguments. Since Scheme
is lexically scoped, the bindings in the lambda will not shadow any bindings
inside the arguments:

#+BEGIN_SRC scheme
  (cond (a => proc) (else b)
        ;; Equivalent to (if a (proc a) b)
        ;; Equivalent to ((lambda (x y p) (if x (p x) y)) a b proc)
        )
#+END_SRC

With this realization, it's possible to transform this extended form of ~cond~
into a chain of ~if~ statements without using the environment.

#+NAME: ex-4-5-cond-recipient
#+BEGIN_SRC scheme
  (define (cond? exp) (tagged-list? exp 'cond))
  (define (cond-clauses exp) (cdr exp))
  (define (cond-else-clause? clause)
    (eq? (cond-predicate clause) 'else))
  (define (cond-recipient-clause? clause)
    (eq? (cadr clause) '=>))
  (define (cond-predicate clause) (car clause))
  (define (cond-actions clause) (cdr clause))
  (define (cond->if exp)
    (expand-clauses (cond-clauses exp)))

  (define (expand-clauses clauses)
    (if (null? clauses)
        'false                          ; no else clause
        (let ((first (car clauses))
              (rest (cdr clauses)))
          (cond ((cond-else-clause? first)
                 (if (null? rest)
                     (sequence->exp (cond-actions first))
                     (error "ELSE clause isn't last -- COND->IF"
                            clauses)))
                ((cond-recipient-clause? first)
                 `(,(make-lambda
                     '(test recipient alternate)
                     `(,(make-if 'test '(recipient test) 'alternate)))
                   ,(car first) ,(caddr first) ,(expand-clauses rest)))
                (else (make-if (cond-predicate first)
                               (sequence->exp (cond-actions first))
                               (expand-clauses rest)))))))
#+END_SRC

#+NAME: ex-4-5-cond-recipient-dispatch
#+BEGIN_SRC scheme
  (eval-4-1-put 'cond
                (lambda (exp env)
                  (cond->if exp)))
#+END_SRC

     :PROPERTIES:
     :Effort:   0:30
     :END:
