ch4/ch4.html
<div id="outline-container-orgheadline11" class="outline-5">
<h5 id="orgheadline11"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-26.html#%_thm_4.5">Exercise 4.5</a></h5>
<div class="outline-text-5" id="text-orgheadline11">
<p>
Let's desugar <code>cond</code> expressions. The ordinary <code>cond</code> can be desugared to a
chain of if-elses:
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #7388d6;">(</span>a b<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>c d<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span><span style="color: #a020f0;">else</span> e<span style="color: #7388d6;">)</span>
      <span style="color: #b22222;">;; </span><span style="color: #b22222;">Equivalent to (if a b (if c d e))</span>
      <span style="color: #707183;">)</span>
</pre>
</div>

<p>
The <code>cond</code> with recipient is a little more complex. The result of evaluating
the test needs to be referred to twice, once to determine which branch to take
and once to pass to the procedure evaluated if the "true" branch is
taken. In order to make sure no variables in the test, the recipient, or the
alternate shadow each other, use &alpha;-conversion to convert an if-statement of
expressions into a lambda taking these expressions as arguments. Since Scheme
is lexically scoped, the bindings in the lambda will not shadow any bindings
inside the arguments:
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #7388d6;">(</span>a =&gt; proc<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span><span style="color: #a020f0;">else</span> b<span style="color: #7388d6;">)</span>
      <span style="color: #b22222;">;; </span><span style="color: #b22222;">Equivalent to (if a (proc a) b)</span>
      <span style="color: #b22222;">;; </span><span style="color: #b22222;">Equivalent to ((lambda (x y p) (if x (p x) y)) a b proc)</span>
      <span style="color: #707183;">)</span>
</pre>
</div>

<p>
With this realization, it's possible to transform this extended form of <code>cond</code>
into a chain of <code>if</code> statements without using the environment.
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock20"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">cond?</span> exp<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>tagged-list? exp 'cond<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">cond-clauses</span> exp<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>cdr exp<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">cond-else-clause?</span> clause<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>eq? <span style="color: #909183;">(</span>cond-predicate clause<span style="color: #909183;">)</span> 'else<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">cond-recipient-clause?</span> clause<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>eq? <span style="color: #909183;">(</span>cadr clause<span style="color: #909183;">)</span> '=&gt;<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">cond-predicate</span> clause<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>car clause<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">cond-actions</span> clause<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>cdr clause<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">cond-&gt;if</span> exp<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>expand-clauses <span style="color: #909183;">(</span>cond-clauses exp<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">expand-clauses</span> clauses<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">if</span> <span style="color: #909183;">(</span>null? clauses<span style="color: #909183;">)</span>
      'false                          <span style="color: #b22222;">; </span><span style="color: #b22222;">no else clause</span>
      <span style="color: #909183;">(</span><span style="color: #a020f0;">let</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>first <span style="color: #6276ba;">(</span>car clauses<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span>rest <span style="color: #6276ba;">(</span>cdr clauses<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>cond-else-clause? first<span style="color: #6276ba;">)</span>
               <span style="color: #6276ba;">(</span><span style="color: #a020f0;">if</span> <span style="color: #858580;">(</span>null? rest<span style="color: #858580;">)</span>
                   <span style="color: #858580;">(</span>sequence-&gt;exp <span style="color: #80a880;">(</span>cond-actions first<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                   <span style="color: #858580;">(</span>error <span style="color: #8b2252;">"ELSE clause isn't last -- COND-&gt;IF"</span>
                          clauses<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
              <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>cond-recipient-clause? first<span style="color: #6276ba;">)</span>
               `<span style="color: #6276ba;">(</span>,<span style="color: #858580;">(</span>make-lambda
                   '<span style="color: #80a880;">(</span>test recipient alternate<span style="color: #80a880;">)</span>
                   `<span style="color: #80a880;">(</span>,<span style="color: #887070;">(</span>make-if 'test '<span style="color: #707183;">(</span>recipient test<span style="color: #707183;">)</span> 'alternate<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                 ,<span style="color: #858580;">(</span>car first<span style="color: #858580;">)</span> ,<span style="color: #858580;">(</span>caddr first<span style="color: #858580;">)</span> ,<span style="color: #858580;">(</span>expand-clauses rest<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
              <span style="color: #907373;">(</span><span style="color: #a020f0;">else</span> <span style="color: #6276ba;">(</span>make-if <span style="color: #858580;">(</span>cond-predicate first<span style="color: #858580;">)</span>
                             <span style="color: #858580;">(</span>sequence-&gt;exp <span style="color: #80a880;">(</span>cond-actions first<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                             <span style="color: #858580;">(</span>expand-clauses rest<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock21"><span style="color: #707183;">(</span>eval-4-1-put 'cond
              <span style="color: #7388d6;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #909183;">(</span>exp env<span style="color: #909183;">)</span>
                <span style="color: #909183;">(</span>cond-&gt;if exp<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
:Effort:   0:30
</p>
</div>
</div>
