ch4/ch4.org
**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-26.html#%_thm_4.6][Exercise 4.6]]
     CLOCK: [2015-02-16 Mon 14:19]--[2015-02-16 Mon 14:22] =>  0:03

#+NAME: ex-4-6-let
#+BEGIN_SRC scheme
  (use srfi-1)

  (define (let->combination exp)
    (let* ((clauses (cdr exp))
           (bindings (car clauses))
           (body (cdr clauses)))
      (let* (
             ;; Partition list of bindings ((a 1) (b 2) ...) into a pair of a
             ;; parameter list and an argument list ((a b ...) . (1 2 ...)).
             (res (fold-right
                   (lambda (e ls)
                     (cons
                      (cons (car e) (car ls))
                      (cons (cadr e) (cdr ls))))
                   '(() . ())
                   bindings))
             (params (car res))
             (args (cdr res)))
        `(,(make-lambda params body)
          ,@args))))
#+END_SRC

#+NAME: ex-4-6-let-dispatch
#+BEGIN_SRC scheme
  (eval-4-1-put 'let
                (lambda (exp env)
                  (eval-4-1 (let->combination exp) env)))
#+END_SRC

#+BEGIN_SRC scheme :tangle ex-4-6-test.scm
  (include "ex-4-3")
  (use test)

  (test-group "test-4-6"
              (test 5
                    (eval-4-1 '(let ((x 2)) (+ x 3)) (setup-environment))))
#+END_SRC

     :PROPERTIES:
     :Effort:   0:30
     :END:
**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-26.html#%_thm_4.7][Exercise 4.7]]
     CLOCK: [2015-05-23 Sat 16:27]--[2015-05-23 Sat 16:47] =>  0:20

#+NAME: ex-4-7-let-star
#+BEGIN_SRC scheme
  (use srfi-1)

  (define (let*->nested-lets exp)
    (let* ((clauses (cdr exp))
           (bindings (car clauses))
           (body (cdr clauses)))
      ;; The let expressions must be wrapped in parentheses, while the body must
      ;; be spliced into the innermost let clause. However, the recursion below
      ;; doesn't allow the body to be spliced in, since that would require
      ;; looking ahead past the current binding. So we wrap the generated let
      ;; expressions in an extra pair of parentheses and splice in all results of
      ;; ITER, making BODY spliced in but the LET expressions still wrapped in
      ;; parentheses at the end. Finally, we need to remove the outermost layer
      ;; of parentheses with the CAR.
      (car
       (let iter ((bindings bindings))
         (if (null? bindings)
             body
             `((let ((,(caar bindings) ,(cadar bindings)))
                 ,@(iter (cdr bindings)))))))))
#+END_SRC

#+NAME: ex-4-7-let-star-dispatch
#+BEGIN_SRC scheme
  (eval-4-1-put 'let*
                (lambda (exp env)
                  (eval-4-1 (let*->nested-lets exp) env)))
#+END_SRC

#+BEGIN_SRC scheme :tangle ex-4-7-test.scm
  (include "ex-4-3")
  (use test)

  (test-group "test-4-7"
              (test 9
                    (eval-4-1 '(let* ((x 2)
                                      (y (+ x 3)))
                                 (+ y 4))
                              (setup-environment))))
#+END_SRC
     :PROPERTIES:
     :Effort:   0:15
     :END:
