ch4/ch4.html
<div id="outline-container-orgheadline12" class="outline-5">
<h5 id="orgheadline12"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-26.html#%_thm_4.6">Exercise 4.6</a></h5>
<div class="outline-text-5" id="text-orgheadline12">
<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock22"><span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> srfi-1<span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">let-&gt;combination</span> exp<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let*</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>clauses <span style="color: #907373;">(</span>cdr exp<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>bindings <span style="color: #907373;">(</span>car clauses<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>body <span style="color: #907373;">(</span>cdr clauses<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">let*</span> <span style="color: #709870;">(</span>
           <span style="color: #b22222;">;; </span><span style="color: #b22222;">Partition list of bindings ((a 1) (b 2) ...) into a pair of a</span>
           <span style="color: #b22222;">;; </span><span style="color: #b22222;">parameter list and an argument list ((a b ...) . (1 2 ...)).</span>
           <span style="color: #907373;">(</span>res <span style="color: #6276ba;">(</span>fold-right
                 <span style="color: #858580;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #80a880;">(</span>e ls<span style="color: #80a880;">)</span>
                   <span style="color: #80a880;">(</span>cons
                    <span style="color: #887070;">(</span>cons <span style="color: #707183;">(</span>car e<span style="color: #707183;">)</span> <span style="color: #707183;">(</span>car ls<span style="color: #707183;">)</span><span style="color: #887070;">)</span>
                    <span style="color: #887070;">(</span>cons <span style="color: #707183;">(</span>cadr e<span style="color: #707183;">)</span> <span style="color: #707183;">(</span>cdr ls<span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                 '<span style="color: #858580;">(</span><span style="color: #80a880;">()</span> . <span style="color: #80a880;">()</span><span style="color: #858580;">)</span>
                 bindings<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span>params <span style="color: #6276ba;">(</span>car res<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span>args <span style="color: #6276ba;">(</span>cdr res<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      `<span style="color: #709870;">(</span>,<span style="color: #907373;">(</span>make-lambda params body<span style="color: #907373;">)</span>
        ,@args<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock23"><span style="color: #707183;">(</span>eval-4-1-put 'let
              <span style="color: #7388d6;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #909183;">(</span>exp env<span style="color: #909183;">)</span>
                <span style="color: #909183;">(</span>eval-4-1 <span style="color: #709870;">(</span>let-&gt;combination exp<span style="color: #709870;">)</span> env<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span>include <span style="color: #8b2252;">"ex-4-3"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> test<span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">test-group</span> <span style="color: #8b2252;">"test-4-6"</span>
            <span style="color: #7388d6;">(</span>test 5
                  <span style="color: #909183;">(</span>eval-4-1 '<span style="color: #709870;">(</span><span style="color: #a020f0;">let</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>x 2<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span> <span style="color: #907373;">(</span>+ x 3<span style="color: #907373;">)</span><span style="color: #709870;">)</span> <span style="color: #709870;">(</span>setup-environment<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
:Effort:   0:30
</p>
</div>
</div>
<div id="outline-container-orgheadline13" class="outline-5">
<h5 id="orgheadline13"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-26.html#%_thm_4.7">Exercise 4.7</a></h5>
<div class="outline-text-5" id="text-orgheadline13">
<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock24"><span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> srfi-1<span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">let*-&gt;nested-lets</span> exp<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let*</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>clauses <span style="color: #907373;">(</span>cdr exp<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>bindings <span style="color: #907373;">(</span>car clauses<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>body <span style="color: #907373;">(</span>cdr clauses<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #b22222;">;; </span><span style="color: #b22222;">The let expressions must be wrapped in parentheses, while the body must</span>
    <span style="color: #b22222;">;; </span><span style="color: #b22222;">be spliced into the innermost let clause. However, the recursion below</span>
    <span style="color: #b22222;">;; </span><span style="color: #b22222;">doesn't allow the body to be spliced in, since that would require</span>
    <span style="color: #b22222;">;; </span><span style="color: #b22222;">looking ahead past the current binding. So we wrap the generated let</span>
    <span style="color: #b22222;">;; </span><span style="color: #b22222;">expressions in an extra pair of parentheses and splice in all results of</span>
    <span style="color: #b22222;">;; </span><span style="color: #b22222;">ITER, making BODY spliced in but the LET expressions still wrapped in</span>
    <span style="color: #b22222;">;; </span><span style="color: #b22222;">parentheses at the end. Finally, we need to remove the outermost layer</span>
    <span style="color: #b22222;">;; </span><span style="color: #b22222;">of parentheses with the CAR.</span>
    <span style="color: #909183;">(</span>car
     <span style="color: #709870;">(</span><span style="color: #a020f0;">let</span> <span style="color: #0000ff;">iter</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>bindings bindings<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
       <span style="color: #907373;">(</span><span style="color: #a020f0;">if</span> <span style="color: #6276ba;">(</span>null? bindings<span style="color: #6276ba;">)</span>
           body
           `<span style="color: #6276ba;">(</span><span style="color: #858580;">(</span><span style="color: #a020f0;">let</span> <span style="color: #80a880;">(</span><span style="color: #887070;">(</span>,<span style="color: #707183;">(</span>caar bindings<span style="color: #707183;">)</span> ,<span style="color: #707183;">(</span>cadar bindings<span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
               ,@<span style="color: #80a880;">(</span>iter <span style="color: #887070;">(</span>cdr bindings<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock25"><span style="color: #707183;">(</span>eval-4-1-put 'let*
              <span style="color: #7388d6;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #909183;">(</span>exp env<span style="color: #909183;">)</span>
                <span style="color: #909183;">(</span>eval-4-1 <span style="color: #709870;">(</span>let*-&gt;nested-lets exp<span style="color: #709870;">)</span> env<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span>include <span style="color: #8b2252;">"ex-4-3"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> test<span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">test-group</span> <span style="color: #8b2252;">"test-4-7"</span>
            <span style="color: #7388d6;">(</span>test 9
                  <span style="color: #909183;">(</span>eval-4-1 '<span style="color: #709870;">(</span><span style="color: #a020f0;">let*</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>x 2<span style="color: #6276ba;">)</span>
                                    <span style="color: #6276ba;">(</span>y <span style="color: #858580;">(</span>+ x 3<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
                               <span style="color: #907373;">(</span>+ y 4<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
                            <span style="color: #709870;">(</span>setup-environment<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
<p>
:Effort:   0:15
</p>
</div>
</div>
