ch4/ch4.html
<div id="outline-container-orgheadline14" class="outline-5">
<h5 id="orgheadline14"><span class="todo NEXT">NEXT</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-26.html#%_thm_4.8">Exercise 4.8</a></h5>
<div class="outline-text-5" id="text-orgheadline14">
<p>
Let's try an example transformation:
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">let</span> <span style="color: #0000ff;">f</span> <span style="color: #7388d6;">(</span><span style="color: #909183;">(</span>a b<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>c d<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span> e
     <span style="color: #b22222;">;; </span><span style="color: #b22222;">Equivalent to (lambda () (define (f a c) e) (f b d))</span>
     <span style="color: #707183;">)</span>
</pre>
</div>

<p>
However, that uses <code>define</code>, which has to manipulate the symbol table. It would
be easier to a purely syntactic transformation, which requires a fixed-point
combinator to accomplish recursion without referring explicitly to the name of
the recursing function. First we do an implementation for a function of one
argument:
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> test<span style="color: #707183;">)</span>

<span style="color: #b22222;">;;; </span><span style="color: #b22222;">With names to illustrate what's going on.</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">fix</span> f<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #909183;">(</span>x<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>f <span style="color: #709870;">(</span>fix f<span style="color: #709870;">)</span> x<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">factabs</span> fact x<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">if</span> <span style="color: #909183;">(</span>= x 0<span style="color: #909183;">)</span>
      1
      <span style="color: #909183;">(</span>* x <span style="color: #709870;">(</span>fact <span style="color: #907373;">(</span>- x 1<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>test 120 <span style="color: #7388d6;">(</span><span style="color: #909183;">(</span>fix factabs<span style="color: #909183;">)</span> 5<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #b22222;">;;; </span><span style="color: #b22222;">Now purely with lambdas</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">Y-combinator</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #7388d6;">(</span>f<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #909183;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #709870;">(</span>x<span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span>f <span style="color: #907373;">(</span>x x<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #709870;">(</span>x<span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span>f <span style="color: #907373;">(</span>x x<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span>test
 120
 <span style="color: #7388d6;">(</span>
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">FIX</span>
  <span style="color: #909183;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #709870;">(</span>f<span style="color: #709870;">)</span>
    <span style="color: #709870;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #907373;">(</span>x<span style="color: #907373;">)</span>
      <span style="color: #907373;">(</span>f <span style="color: #6276ba;">()</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
  5<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock26"><span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> srfi-1<span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">let-&gt;combination</span> exp<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let*</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>proc <span style="color: #907373;">(</span><span style="color: #a020f0;">if</span> <span style="color: #6276ba;">(</span>symbol? <span style="color: #858580;">(</span>cadr exp<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
                   <span style="color: #6276ba;">(</span>cadr exp<span style="color: #6276ba;">)</span>
                   #f<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>clauses <span style="color: #907373;">(</span><span style="color: #a020f0;">if</span> <span style="color: #6276ba;">(</span>symbol? <span style="color: #858580;">(</span>cadr exp<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
                      <span style="color: #6276ba;">(</span>cddr exp<span style="color: #6276ba;">)</span>
                      <span style="color: #6276ba;">(</span>cdr exp<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>bindings <span style="color: #907373;">(</span>car clauses<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>body <span style="color: #907373;">(</span>cdr clauses<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">let*</span> <span style="color: #709870;">(</span>
           <span style="color: #b22222;">;; </span><span style="color: #b22222;">Partition list of bindings ((a 1) (b 2) ...) into a pair of a</span>
           <span style="color: #b22222;">;; </span><span style="color: #b22222;">parameter list and an argument list ((a b ...) . (1 2 ...)).</span>
           <span style="color: #907373;">(</span>res <span style="color: #6276ba;">(</span>fold-right
                 <span style="color: #858580;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #80a880;">(</span>e ls<span style="color: #80a880;">)</span>
                   <span style="color: #80a880;">(</span>cons
                    <span style="color: #887070;">(</span>cons <span style="color: #707183;">(</span>car e<span style="color: #707183;">)</span> <span style="color: #707183;">(</span>car ls<span style="color: #707183;">)</span><span style="color: #887070;">)</span>
                    <span style="color: #887070;">(</span>cons <span style="color: #707183;">(</span>cadr e<span style="color: #707183;">)</span> <span style="color: #707183;">(</span>cdr ls<span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                 '<span style="color: #858580;">(</span><span style="color: #80a880;">()</span> . <span style="color: #80a880;">()</span><span style="color: #858580;">)</span>
                 bindings<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span>params <span style="color: #6276ba;">(</span>car res<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span>args <span style="color: #6276ba;">(</span>cdr res<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">if</span> proc
          `<span style="color: #907373;">(</span><span style="color: #6276ba;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #858580;">()</span>
              <span style="color: #858580;">(</span><span style="color: #a020f0;">define</span> <span style="color: #80a880;">(</span>,proc ,@params<span style="color: #80a880;">)</span> ,@body<span style="color: #858580;">)</span>
              <span style="color: #858580;">(</span>,proc ,@args<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
          `<span style="color: #907373;">(</span><span style="color: #6276ba;">(</span><span style="color: #a020f0;">lambda</span> ,params ,@body<span style="color: #6276ba;">)</span>
            ,@args<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock27"><span style="color: #707183;">(</span>eval-4-1-put 'let
              <span style="color: #7388d6;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #909183;">(</span>exp env<span style="color: #909183;">)</span>
                <span style="color: #909183;">(</span>eval-4-1 <span style="color: #709870;">(</span>let-&gt;combination exp<span style="color: #709870;">)</span> env<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span>include <span style="color: #8b2252;">"ex-4-3"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> test<span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">test-group</span> <span style="color: #8b2252;">"test-4-8"</span>
            <span style="color: #7388d6;">(</span>test 5
                  <span style="color: #909183;">(</span>eval-4-1 '<span style="color: #709870;">(</span><span style="color: #a020f0;">let</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>x 2<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span> <span style="color: #907373;">(</span>+ x 3<span style="color: #907373;">)</span><span style="color: #709870;">)</span> <span style="color: #709870;">(</span>setup-environment<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
            <span style="color: #7388d6;">(</span>test 21
                  <span style="color: #909183;">(</span>eval-4-1
                   '<span style="color: #709870;">(</span><span style="color: #a020f0;">let</span> <span style="color: #0000ff;">fib-iter</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>a 1<span style="color: #6276ba;">)</span>
                                   <span style="color: #6276ba;">(</span>b 0<span style="color: #6276ba;">)</span>
                                   <span style="color: #6276ba;">(</span>count 8<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
                      <span style="color: #907373;">(</span><span style="color: #a020f0;">if</span> <span style="color: #6276ba;">(</span>= count 0<span style="color: #6276ba;">)</span>
                          b
                          <span style="color: #6276ba;">(</span>fib-iter <span style="color: #858580;">(</span>+ a b<span style="color: #858580;">)</span> a <span style="color: #858580;">(</span>- count 1<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
                   <span style="color: #709870;">(</span>setup-environment<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
            <span style="color: #7388d6;">(</span>test 21
                  <span style="color: #909183;">(</span>eval-4-1
                   '<span style="color: #709870;">(</span><span style="color: #a020f0;">let</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>n 8<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
                      <span style="color: #907373;">(</span><span style="color: #a020f0;">let</span> <span style="color: #0000ff;">fib-iter</span> <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>a 1<span style="color: #858580;">)</span>
                                     <span style="color: #858580;">(</span>b 0<span style="color: #858580;">)</span>
                                     <span style="color: #858580;">(</span>count n<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
                        <span style="color: #6276ba;">(</span><span style="color: #a020f0;">if</span> <span style="color: #858580;">(</span>= count 0<span style="color: #858580;">)</span>
                            b
                            <span style="color: #858580;">(</span>fib-iter <span style="color: #80a880;">(</span>+ a b<span style="color: #80a880;">)</span> a <span style="color: #80a880;">(</span>- count 1<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
                   <span style="color: #709870;">(</span>setup-environment<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
:Effort:   0:30
</p>
</div>
</div>
