ch4/ch4.org
**** NEXT [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-26.html#%_thm_4.9][Exercise 4.9]]
     - Note taken on [2015-05-23 Sat 18:46] \\
       Test is failing because, inside a procedure, setting the value of a variable
       defined in the enclosing scope doesn't seem to stick after the lambda
       returns. Since Section 4.1.3 deals with the environment lookup, I'll come back
       to this after I fix the environment.
     CLOCK: [2015-05-23 Sat 18:11]--[2015-05-23 Sat 18:48] =>  0:37
     CLOCK: [2015-05-23 Sat 18:05]--[2015-05-23 Sat 18:11] =>  0:06

#+BEGIN_SRC scheme
  (while p b
         ;; Equivalent to (let foo ((p (lambda () p)) (b (lambda () b)) (if (not
         ;; (p)) #f (b) (foo p b)))
         )
#+END_SRC

#+NAME: ex-4-9-while
#+BEGIN_SRC scheme
  (define (expand-while exp)
    (let* ((pred (cadr exp))
           (body (cddr exp)))
      `(let iter ((pred (lambda () ,pred))
                  (body (lambda () ,@body)))
         (if (not (pred))
             #f
             (begin
               (body)
               (iter pred body))))))
#+END_SRC

#+NAME: ex-4-9-while-dispatch
#+BEGIN_SRC scheme
  (eval-4-1-put 'while
                (lambda (exp env)
                  (eval-4-1 (expand-while exp) env)))
#+END_SRC

#+BEGIN_SRC scheme :tangle ex-4-9-test.scm
  (include "ex-4-3")
  (use test)

  (test-group "ex-4-9"
              (test 1
                    (eval-4-1
                     '(begin
                        (define x 0)
                        (while (= x 0)
                          (set! x 1))
                        x)
                     (setup-environment))))
#+END_SRC
     :PROPERTIES:
     :Effort:   0:30
     :END:
