ch4/ch4.html
<div id="outline-container-orgheadline15" class="outline-5">
<h5 id="orgheadline15"><span class="todo NEXT">NEXT</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-26.html#%_thm_4.9">Exercise 4.9</a></h5>
<div class="outline-text-5" id="text-orgheadline15">
<ul class="org-ul">
<li>Note taken on <span class="timestamp-wrapper"><span class="timestamp">[2015-05-23 Sat 18:46] </span></span> <br  />
Test is failing because, inside a procedure, setting the value of a variable
defined in the enclosing scope doesn't seem to stick after the lambda
returns. Since Section 4.1.3 deals with the environment lookup, I'll come back
to this after I fix the environment.</li>
</ul>
<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span>while p b
       <span style="color: #b22222;">;; </span><span style="color: #b22222;">Equivalent to (let foo ((p (lambda () p)) (b (lambda () b)) (if (not</span>
       <span style="color: #b22222;">;; </span><span style="color: #b22222;">(p)) #f (b) (foo p b)))</span>
       <span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock28"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">expand-while</span> exp<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let*</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>pred <span style="color: #907373;">(</span>cadr exp<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>body <span style="color: #907373;">(</span>cddr exp<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    `<span style="color: #909183;">(</span><span style="color: #a020f0;">let</span> <span style="color: #0000ff;">iter</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>pred <span style="color: #6276ba;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #858580;">()</span> ,pred<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
                <span style="color: #907373;">(</span>body <span style="color: #6276ba;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #858580;">()</span> ,@body<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
       <span style="color: #709870;">(</span><span style="color: #a020f0;">if</span> <span style="color: #907373;">(</span>not <span style="color: #6276ba;">(</span>pred<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
           #f
           <span style="color: #907373;">(</span><span style="color: #a020f0;">begin</span>
             <span style="color: #6276ba;">(</span>body<span style="color: #6276ba;">)</span>
             <span style="color: #6276ba;">(</span>iter pred body<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock29"><span style="color: #707183;">(</span>eval-4-1-put 'while
              <span style="color: #7388d6;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #909183;">(</span>exp env<span style="color: #909183;">)</span>
                <span style="color: #909183;">(</span>eval-4-1 <span style="color: #709870;">(</span>expand-while exp<span style="color: #709870;">)</span> env<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span>include <span style="color: #8b2252;">"ex-4-3"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> test<span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">test-group</span> <span style="color: #8b2252;">"ex-4-9"</span>
            <span style="color: #7388d6;">(</span>test 1
                  <span style="color: #909183;">(</span>eval-4-1
                   '<span style="color: #709870;">(</span><span style="color: #a020f0;">begin</span>
                      <span style="color: #907373;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">x</span> 0<span style="color: #907373;">)</span>
                      <span style="color: #907373;">(</span>while <span style="color: #6276ba;">(</span>= x 0<span style="color: #6276ba;">)</span>
                        <span style="color: #6276ba;">(</span><span style="color: #a020f0;">set!</span> x 1<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
                      x<span style="color: #709870;">)</span>
                   <span style="color: #709870;">(</span>setup-environment<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
<p>
:Effort:   0:30
</p>
</div>
</div>
