ch4/ch4.org
**** NEXT [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-26.html#%_thm_4.10][Exercise 4.10]]
     CLOCK: [2015-02-20 Fri 17:14]--[2015-02-20 Fri 19:01] =>  1:47
     - Note taken on [2015-02-17 Tue 17:24] \\
       I've got the lexer done. Onto the parser.
     CLOCK: [2015-02-17 Tue 16:32]--[2015-02-17 Tue 17:25] =>  0:53
     CLOCK: [2015-02-17 Tue 00:42]--[2015-02-17 Tue 00:59] =>  0:17
     CLOCK: [2015-02-17 Tue 00:05]--[2015-02-17 Tue 00:39] =>  0:34
     CLOCK: [2015-02-16 Mon 17:32]--[2015-02-16 Mon 17:46] =>  0:14
     CLOCK: [2015-02-16 Mon 14:22]--[2015-02-16 Mon 16:05] =>  1:43

I'm going to try to do this with M-expressions.

#+BEGIN_EXAMPLE
  S ::= ...

  SEXPR ::= ATOM
            | '\'' SEXPR
            | '`' SEXPR
            | ',' SEXPR
            | ',@' SEXPR
            | '(' SEXPR_END
  SEXPR_BODY ::= ')'
                | SEXPR SEXPR_END
  SEXPR_END ::= '.' SEXPR ')'
                | SEXPRS_REST
  SEXPRS_REST ::= ')'
                  | SEXPR SEXPRS_REST
  ATOM ::= NUM | BOOL | SYMBOL
  NUM ::= /[0-9]+(\.[0-9]*)?|\.[0-9]+/
  BOOL ::= "#t" | "#f"
  SYMBOL ::= /[-+*/_a-zA-Z][-+*/_a-zA-Z0-9]*/

#+END_EXAMPLE

#+BEGIN_SRC scheme :tangle ex-4-10.scm
  <<mexpr-lexer>>
  <<mexpr-parser>>
#+END_SRC

#+NAME: mexpr-lexer
#+BEGIN_SRC scheme
  (use srfi-1)

  (define (scan-terminal port start? continue? string->result)
    (let ((in (peek-char port)))
      (if (or (eof-object? in) (not (start? in)))
          #f
          (let iter ((chars (list (read-char port))))
            (let ((in (peek-char port)))
              (if (or (eof-object? in) (not (continue? in)))
                  (string->result
                   ((compose list->string reverse) chars))
                  (iter (cons (read-char port) chars))))))))

  (define (atomize atom) `(atom . ,atom))
  (define (atom-token? token) (and (pair? token) (eq? (car token) 'atom)))
  (define (atom-value token) (cdr token))
  (define (scan-symbol port)
    (define (symbol-start? c)
      (or (char-alphabetic? c)
          (char-numeric? c)
          (find (lambda (x) (char=? c x)) '(#\+ #\- #\* #\/ #\= #\< #\> #\? #\_))))
    (define (symbol-continue? c)
      (or (symbol-start? c) (char-numeric? c)))
    (scan-terminal port symbol-start? symbol-continue? (compose atomize string->symbol)))

  (define (scan-num port)
    (scan-terminal port char-numeric? char-numeric? (compose atomize string->number)))

  (define true #t)
  (define false #f)
  (define (scan-bool port)
    (scan-terminal port
                   (lambda (c) (char=? c #\#))
                   (lambda (c) (or (char-ci=? c #\t) (char-ci=? c #\f)))
                   (lambda (s) (cond ((string-ci=? s "#t") (atomize true))
                                     (else (atomize false))))))

  (define (consume-whitespace port)
    (scan-terminal port char-whitespace? char-whitespace? (constant 'whitespace)))
  (define (consume-line-comment port)
    (scan-terminal port
                   (lambda (c) (char=? #\; c))
                   (lambda (c) (not (char=? #\newline c)))
                   (constant 'line-comment)))
  (define (consume-space port)
    (if (not (and (consume-whitespace port)
                  (consume-line-comment port)))
        #f
        (consume-space port)))

  ;; Single-character tokens
  (define (constant value) (lambda (x) value))
  (define (make-scan-literal-char c)
    (lambda (port)
      (scan-terminal port
                     (lambda (inc) (char=? c inc))
                     (lambda (inc) #f)
                     (constant c))))

  (define lparen #\()
  (define scan-lparen (make-scan-literal-char lparen))
  (define rparen #\))
  (define scan-rparen (make-scan-literal-char rparen))

  (define lbracket #\()
  (define scan-lbracket (make-scan-literal-char lbracket))
  (define rbracket #\))
  (define scan-rbracket (make-scan-literal-char rbracket))

  (define dot #\.)
  (define scan-dot (make-scan-literal-char dot))

  (define semicolon #\;)
  (define scan-semicolon (make-scan-literal-char semicolon))

  (define quote-sym #\')
  (define scan-quote-sym (make-scan-literal-char quote-sym))
  (define quasiquote-sym #\`)
  (define scan-quasiquote-sym (make-scan-literal-char quasiquote-sym))

  ;;; Parse both unquote operators here, since we need the lookahead to
  ;;; distinguish between unquote (",") and unquote-splicing (",@").
  (define unquote-sym #\,)
  (define unquote-splicing-sym '(#\, #\@))
  (define (scan-unquotes port)
    (let ((in (peek-char port)))
      (if (or (eof-object? in)
              (not (char=? in #\,)))
          #f
          (begin
            (read-char port)
            (let ((in (peek-char port)))
              (if (or (eof-object? in)
                      (not (char=? in #\@)))
                  unquote-sym
                  (begin
                    (read-char port)
                    unquote-splicing-sym)))))))

  (define (identity x) x)
  (define (nonnull? x) (not (null? x)))
  (define (atom? x)
    (or (number? x) (symbol? x) (boolean? x)))
  (define (scan-next-token port)
    (consume-space port)
    (cond ((scan-lparen port) => identity)
          ((scan-rparen port) => identity)
          ((scan-lbracket port) => identity)
          ((scan-rbracket port) => identity)
          ((scan-dot port) => identity)

          ((scan-unquotes port) => identity)
          ((scan-quasiquote-sym port) => identity)
          ((scan-quote-sym port) => identity)

          ((scan-symbol port) => identity)
          ((scan-num port) => identity)
          ((scan-bool port) => identity)

          ((eof-object? (peek-char port)) (peek-char port))
          (else (error "SCAN-NEXT-TOKEN: Next token not found")))
    )
#+END_SRC

#+NAME: mexpr-parser
#+BEGIN_SRC scheme
  (define (make-next-token port)
    (define lookahead '())
    (define (get)
      (if (nonnull? lookahead)
          (let ((token lookahead))
            (set! lookahead '())
            token)
          (scan-next-token port)))
    (define (unget token)
      (set! lookahead token))
    (define (dispatch msg)
      (cond ((eq? msg 'get) get)
            ((eq? msg 'unget) unget)
            (else (error "NEXT-TOKEN -- unrecognized message"))))
    dispatch)

  (define (read-sexpr next-token)
    (let ((token ((next-token 'get))))
                                          ; (display token) (newline)
      (cond
       ;; TODO: Why doesn't `(quasiquote ,expr) work?
       ((eq? token quote-sym)
        (list 'quote (read-sexpr next-token)))
       ((eq? token quasiquote-sym)
        (list 'quasiquote (read-sexpr next-token)))
       ((eq? token unquote-sym)
        (list 'unquote (read-sexpr next-token)))
       ((eq? token unquote-splicing-sym)
        (list 'unquote-splicing (read-sexpr next-token)))

       ((atom-token? token)
        (atom-value token))
       ((eq? token lparen)
        (read-sexpr-body next-token))
       (else "READ-SEXPR: No parse"))))

  (define (read-sexpr-body next-token)
    (let ((token ((next-token 'get))))
      (cond ((eq? token rparen) '())
            (else
             ((next-token 'unget) token)
             (let* ((sexpr (read-sexpr next-token))
                    (sexpr-end (read-sexpr-end next-token)))
               (cons sexpr sexpr-end))))))

  (define (read-sexpr-end next-token)
    (let ((token ((next-token 'get))))
      (cond ((eq? token dot)
             (let* ((sexpr (read-sexpr next-token))
                    (end ((next-token 'get))))
               (if (eq? end rparen)
                   sexpr
                   (error "READ-SEXPR-END: Failed parse of dotted pair"))))
            (else
             ((next-token 'unget) token)
             (read-sexprs-rest next-token)))))

  (define (read-sexprs-rest next-token)
    (let ((token ((next-token 'get))))
      (cond ((eq? token rparen) '())
            (else
             ((next-token 'unget) token)
             (let* ((sexpr (read-sexpr next-token))
                    (sexprs-rest (read-sexprs-rest next-token)))
               (cons sexpr sexprs-rest))))))
#+END_SRC

     :PROPERTIES:
     :Effort:   3:00
     :END:
