ch4/ch4.html
<div id="outline-container-orgheadline16" class="outline-5">
<h5 id="orgheadline16"><span class="todo NEXT">NEXT</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-26.html#%_thm_4.10">Exercise 4.10</a></h5>
<div class="outline-text-5" id="text-orgheadline16">
<ul class="org-ul">
<li>Note taken on <span class="timestamp-wrapper"><span class="timestamp">[2015-02-17 Tue 17:24] </span></span> <br  />
I've got the lexer done. Onto the parser.</li>
</ul>
<p>
I'm going to try to do this with M-expressions.
</p>

<pre class="example">
S ::= ...

SEXPR ::= ATOM
          | '\'' SEXPR
          | '`' SEXPR
          | ',' SEXPR
          | ',@' SEXPR
          | '(' SEXPR_END
SEXPR_BODY ::= ')'
              | SEXPR SEXPR_END
SEXPR_END ::= '.' SEXPR ')'
              | SEXPRS_REST
SEXPRS_REST ::= ')'
                | SEXPR SEXPRS_REST
ATOM ::= NUM | BOOL | SYMBOL
NUM ::= /[0-9]+(\.[0-9]*)?|\.[0-9]+/
BOOL ::= "#t" | "#f"
SYMBOL ::= /[-+*/_a-zA-Z][-+*/_a-zA-Z0-9]*/
</pre>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #228b22;">&lt;&lt;mexpr-lexer&gt;&gt;</span>
<span style="color: #228b22;">&lt;&lt;mexpr-parser&gt;&gt;</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock30"><span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> srfi-1<span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">scan-terminal</span> port start? continue? string-&gt;result<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>in <span style="color: #907373;">(</span>peek-char port<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">if</span> <span style="color: #709870;">(</span><span style="color: #a020f0;">or</span> <span style="color: #907373;">(</span>eof-object? in<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>not <span style="color: #6276ba;">(</span>start? in<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        #f
        <span style="color: #709870;">(</span><span style="color: #a020f0;">let</span> <span style="color: #0000ff;">iter</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>chars <span style="color: #858580;">(</span>list <span style="color: #80a880;">(</span>read-char port<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span><span style="color: #a020f0;">let</span> <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>in <span style="color: #80a880;">(</span>peek-char port<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
            <span style="color: #6276ba;">(</span><span style="color: #a020f0;">if</span> <span style="color: #858580;">(</span><span style="color: #a020f0;">or</span> <span style="color: #80a880;">(</span>eof-object? in<span style="color: #80a880;">)</span> <span style="color: #80a880;">(</span>not <span style="color: #887070;">(</span>continue? in<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                <span style="color: #858580;">(</span>string-&gt;result
                 <span style="color: #80a880;">(</span><span style="color: #887070;">(</span>compose list-&gt;string reverse<span style="color: #887070;">)</span> chars<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                <span style="color: #858580;">(</span>iter <span style="color: #80a880;">(</span>cons <span style="color: #887070;">(</span>read-char port<span style="color: #887070;">)</span> chars<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">atomize</span> atom<span style="color: #7388d6;">)</span> `<span style="color: #7388d6;">(</span>atom . ,atom<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">atom-token?</span> token<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span><span style="color: #a020f0;">and</span> <span style="color: #909183;">(</span>pair? token<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>eq? <span style="color: #709870;">(</span>car token<span style="color: #709870;">)</span> 'atom<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">atom-value</span> token<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>cdr token<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">scan-symbol</span> port<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">symbol-start?</span> c<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">or</span> <span style="color: #709870;">(</span>char-alphabetic? c<span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>char-numeric? c<span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>find <span style="color: #907373;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #6276ba;">(</span>x<span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>char=? c x<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span> '<span style="color: #907373;">(</span>#\+ #\- #\* #\/ #\= #\&lt; #\&gt; #\? #\_<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">symbol-continue?</span> c<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">or</span> <span style="color: #709870;">(</span>symbol-start? c<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>char-numeric? c<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>scan-terminal port symbol-start? symbol-continue? <span style="color: #909183;">(</span>compose atomize string-&gt;symbol<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">scan-num</span> port<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>scan-terminal port char-numeric? char-numeric? <span style="color: #909183;">(</span>compose atomize string-&gt;number<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">true</span> #t<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">false</span> #f<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">scan-bool</span> port<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>scan-terminal port
                 <span style="color: #909183;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #709870;">(</span>c<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>char=? c #\#<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
                 <span style="color: #909183;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #709870;">(</span>c<span style="color: #709870;">)</span> <span style="color: #709870;">(</span><span style="color: #a020f0;">or</span> <span style="color: #907373;">(</span>char-ci=? c #\t<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>char-ci=? c #\f<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
                 <span style="color: #909183;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #709870;">(</span>s<span style="color: #709870;">)</span> <span style="color: #709870;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>string-ci=? s <span style="color: #8b2252;">"#t"</span><span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>atomize true<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
                                   <span style="color: #907373;">(</span><span style="color: #a020f0;">else</span> <span style="color: #6276ba;">(</span>atomize false<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">consume-whitespace</span> port<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>scan-terminal port char-whitespace? char-whitespace? <span style="color: #909183;">(</span>constant 'whitespace<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">consume-line-comment</span> port<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>scan-terminal port
                 <span style="color: #909183;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #709870;">(</span>c<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>char=? #\; c<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
                 <span style="color: #909183;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #709870;">(</span>c<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>not <span style="color: #907373;">(</span>char=? #\newline c<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
                 <span style="color: #909183;">(</span>constant 'line-comment<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">consume-space</span> port<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">if</span> <span style="color: #909183;">(</span>not <span style="color: #709870;">(</span><span style="color: #a020f0;">and</span> <span style="color: #907373;">(</span>consume-whitespace port<span style="color: #907373;">)</span>
                <span style="color: #907373;">(</span>consume-line-comment port<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
      #f
      <span style="color: #909183;">(</span>consume-space port<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #b22222;">;; </span><span style="color: #b22222;">Single-character tokens</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">constant</span> value<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #909183;">(</span>x<span style="color: #909183;">)</span> value<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">make-scan-literal-char</span> c<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #909183;">(</span>port<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>scan-terminal port
                   <span style="color: #709870;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #907373;">(</span>inc<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>char=? c inc<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
                   <span style="color: #709870;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #907373;">(</span>inc<span style="color: #907373;">)</span> #f<span style="color: #709870;">)</span>
                   <span style="color: #709870;">(</span>constant c<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">lparen</span> #\(<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">scan-lparen</span> <span style="color: #7388d6;">(</span>make-scan-literal-char lparen<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">rparen</span> #\)<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">scan-rparen</span> <span style="color: #7388d6;">(</span>make-scan-literal-char rparen<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">lbracket</span> #\(<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">scan-lbracket</span> <span style="color: #7388d6;">(</span>make-scan-literal-char lbracket<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">rbracket</span> #\)<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">scan-rbracket</span> <span style="color: #7388d6;">(</span>make-scan-literal-char rbracket<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">dot</span> #\.<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">scan-dot</span> <span style="color: #7388d6;">(</span>make-scan-literal-char dot<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">semicolon</span> #\;<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">scan-semicolon</span> <span style="color: #7388d6;">(</span>make-scan-literal-char semicolon<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">quote-sym</span> #\'<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">scan-quote-sym</span> <span style="color: #7388d6;">(</span>make-scan-literal-char quote-sym<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">quasiquote-sym</span> #\`<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">scan-quasiquote-sym</span> <span style="color: #7388d6;">(</span>make-scan-literal-char quasiquote-sym<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #b22222;">;;; </span><span style="color: #b22222;">Parse both unquote operators here, since we need the lookahead to</span>
<span style="color: #b22222;">;;; </span><span style="color: #b22222;">distinguish between unquote (",") and unquote-splicing (",@").</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">unquote-sym</span> #\,<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">unquote-splicing-sym</span> '<span style="color: #7388d6;">(</span>#\, #\@<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">scan-unquotes</span> port<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>in <span style="color: #907373;">(</span>peek-char port<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">if</span> <span style="color: #709870;">(</span><span style="color: #a020f0;">or</span> <span style="color: #907373;">(</span>eof-object? in<span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span>not <span style="color: #6276ba;">(</span>char=? in #\,<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        #f
        <span style="color: #709870;">(</span><span style="color: #a020f0;">begin</span>
          <span style="color: #907373;">(</span>read-char port<span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span><span style="color: #a020f0;">let</span> <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>in <span style="color: #80a880;">(</span>peek-char port<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
            <span style="color: #6276ba;">(</span><span style="color: #a020f0;">if</span> <span style="color: #858580;">(</span><span style="color: #a020f0;">or</span> <span style="color: #80a880;">(</span>eof-object? in<span style="color: #80a880;">)</span>
                    <span style="color: #80a880;">(</span>not <span style="color: #887070;">(</span>char=? in #\@<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                unquote-sym
                <span style="color: #858580;">(</span><span style="color: #a020f0;">begin</span>
                  <span style="color: #80a880;">(</span>read-char port<span style="color: #80a880;">)</span>
                  unquote-splicing-sym<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">identity</span> x<span style="color: #7388d6;">)</span> x<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">nonnull?</span> x<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>not <span style="color: #909183;">(</span>null? x<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">atom?</span> x<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">or</span> <span style="color: #909183;">(</span>number? x<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>symbol? x<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>boolean? x<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">scan-next-token</span> port<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>consume-space port<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>scan-lparen port<span style="color: #709870;">)</span> =&gt; identity<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>scan-rparen port<span style="color: #709870;">)</span> =&gt; identity<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>scan-lbracket port<span style="color: #709870;">)</span> =&gt; identity<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>scan-rbracket port<span style="color: #709870;">)</span> =&gt; identity<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>scan-dot port<span style="color: #709870;">)</span> =&gt; identity<span style="color: #909183;">)</span>

        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>scan-unquotes port<span style="color: #709870;">)</span> =&gt; identity<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>scan-quasiquote-sym port<span style="color: #709870;">)</span> =&gt; identity<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>scan-quote-sym port<span style="color: #709870;">)</span> =&gt; identity<span style="color: #909183;">)</span>

        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>scan-symbol port<span style="color: #709870;">)</span> =&gt; identity<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>scan-num port<span style="color: #709870;">)</span> =&gt; identity<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>scan-bool port<span style="color: #709870;">)</span> =&gt; identity<span style="color: #909183;">)</span>

        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>eof-object? <span style="color: #907373;">(</span>peek-char port<span style="color: #907373;">)</span><span style="color: #709870;">)</span> <span style="color: #709870;">(</span>peek-char port<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #a020f0;">else</span> <span style="color: #709870;">(</span>error <span style="color: #8b2252;">"SCAN-NEXT-TOKEN: Next token not found"</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock31"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">make-next-token</span> port<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">lookahead</span> '<span style="color: #909183;">()</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">get</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">if</span> <span style="color: #709870;">(</span>nonnull? lookahead<span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span><span style="color: #a020f0;">let</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>token lookahead<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span><span style="color: #a020f0;">set!</span> lookahead '<span style="color: #6276ba;">()</span><span style="color: #907373;">)</span>
          token<span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>scan-next-token port<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">unget</span> token<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">set!</span> lookahead token<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">dispatch</span> msg<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>eq? msg 'get<span style="color: #907373;">)</span> get<span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span><span style="color: #907373;">(</span>eq? msg 'unget<span style="color: #907373;">)</span> unget<span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span><span style="color: #a020f0;">else</span> <span style="color: #907373;">(</span>error <span style="color: #8b2252;">"NEXT-TOKEN -- unrecognized message"</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  dispatch<span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">read-sexpr</span> next-token<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>token <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>next-token 'get<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
                                        <span style="color: #b22222;">; </span><span style="color: #b22222;">(display token) (newline)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">cond</span>
     <span style="color: #b22222;">;; </span><span style="color: #b22222;">TODO: Why doesn't `(quasiquote ,expr) work?</span>
     <span style="color: #709870;">(</span><span style="color: #907373;">(</span>eq? token quote-sym<span style="color: #907373;">)</span>
      <span style="color: #907373;">(</span>list 'quote <span style="color: #6276ba;">(</span>read-sexpr next-token<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span><span style="color: #907373;">(</span>eq? token quasiquote-sym<span style="color: #907373;">)</span>
      <span style="color: #907373;">(</span>list 'quasiquote <span style="color: #6276ba;">(</span>read-sexpr next-token<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span><span style="color: #907373;">(</span>eq? token unquote-sym<span style="color: #907373;">)</span>
      <span style="color: #907373;">(</span>list 'unquote <span style="color: #6276ba;">(</span>read-sexpr next-token<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span><span style="color: #907373;">(</span>eq? token unquote-splicing-sym<span style="color: #907373;">)</span>
      <span style="color: #907373;">(</span>list 'unquote-splicing <span style="color: #6276ba;">(</span>read-sexpr next-token<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>

     <span style="color: #709870;">(</span><span style="color: #907373;">(</span>atom-token? token<span style="color: #907373;">)</span>
      <span style="color: #907373;">(</span>atom-value token<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span><span style="color: #907373;">(</span>eq? token lparen<span style="color: #907373;">)</span>
      <span style="color: #907373;">(</span>read-sexpr-body next-token<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span><span style="color: #a020f0;">else</span> <span style="color: #8b2252;">"READ-SEXPR: No parse"</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">read-sexpr-body</span> next-token<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>token <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>next-token 'get<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>eq? token rparen<span style="color: #907373;">)</span> '<span style="color: #907373;">()</span><span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span><span style="color: #a020f0;">else</span>
           <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>next-token 'unget<span style="color: #6276ba;">)</span> token<span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span><span style="color: #a020f0;">let*</span> <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>sexpr <span style="color: #80a880;">(</span>read-sexpr next-token<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                  <span style="color: #858580;">(</span>sexpr-end <span style="color: #80a880;">(</span>read-sexpr-end next-token<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
             <span style="color: #6276ba;">(</span>cons sexpr sexpr-end<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">read-sexpr-end</span> next-token<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>token <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>next-token 'get<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>eq? token dot<span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span><span style="color: #a020f0;">let*</span> <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>sexpr <span style="color: #80a880;">(</span>read-sexpr next-token<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                  <span style="color: #858580;">(</span>end <span style="color: #80a880;">(</span><span style="color: #887070;">(</span>next-token 'get<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
             <span style="color: #6276ba;">(</span><span style="color: #a020f0;">if</span> <span style="color: #858580;">(</span>eq? end rparen<span style="color: #858580;">)</span>
                 sexpr
                 <span style="color: #858580;">(</span>error <span style="color: #8b2252;">"READ-SEXPR-END: Failed parse of dotted pair"</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span><span style="color: #a020f0;">else</span>
           <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>next-token 'unget<span style="color: #6276ba;">)</span> token<span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span>read-sexprs-rest next-token<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">read-sexprs-rest</span> next-token<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>token <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>next-token 'get<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>eq? token rparen<span style="color: #907373;">)</span> '<span style="color: #907373;">()</span><span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span><span style="color: #a020f0;">else</span>
           <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>next-token 'unget<span style="color: #6276ba;">)</span> token<span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span><span style="color: #a020f0;">let*</span> <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>sexpr <span style="color: #80a880;">(</span>read-sexpr next-token<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                  <span style="color: #858580;">(</span>sexprs-rest <span style="color: #80a880;">(</span>read-sexprs-rest next-token<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
             <span style="color: #6276ba;">(</span>cons sexpr sexprs-rest<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
:Effort:   3:00
</p>
</div>
</div>
</div>
