ch4/ch4.html
<div id="outline-container-orgheadline23" class="outline-4">
<h4 id="orgheadline23"><span class="todo NEXT">NEXT</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-26.html#%_sec_4.1.3">4.1.3: Evaluator Data Structures</a> <code>[3/4]</code></h4>
