ch4/ch4.html
<div class="outline-text-4" id="text-orgheadline23">
</div><div id="outline-container-orgheadline18" class="outline-5">
<h5 id="orgheadline18">Code</h5>
<div class="outline-text-5" id="text-orgheadline18">
<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock32"><span style="color: #228b22;">&lt;&lt;evaluator-structs-predicates&gt;&gt;</span>
<span style="color: #228b22;">&lt;&lt;evaluator-structs-procedures&gt;&gt;</span>
<span style="color: #228b22;">&lt;&lt;ex-4-12-environments&gt;&gt;</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock33"><span style="color: #b22222;">;;; </span><span style="color: #b22222;">Define true and false inside the interpreter, to show that it's not</span>
<span style="color: #b22222;">;;; </span><span style="color: #b22222;">necessary to conflate the representation of booleans in the interpreter</span>
<span style="color: #b22222;">;;; </span><span style="color: #b22222;">with the implementing language's representation.</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">true</span> 'sec-4-1-true<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">false</span> 'sec-4-1-false<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">true?</span> x<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>not <span style="color: #909183;">(</span>eq? x false<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">false?</span> x<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>eq? x false<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock34"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">make-procedure</span> parameters body env<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>list 'procedure parameters body env<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">compound-procedure?</span> p<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>tagged-list? p 'procedure<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">procedure-parameters</span> p<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>cadr p<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">procedure-body</span> p<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>caddr p<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">procedure-environment</span> p<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>cadddr p<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock35"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">enclosing-environment</span> env<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>cdr env<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">first-frame</span> env<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>car env<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">the-empty-environment</span> '<span style="color: #7388d6;">()</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">make-frame</span> variables values<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>cons variables values<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">frame-variables</span> frame<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>car frame<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">frame-values</span> frame<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>cdr frame<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">add-binding-to-frame!</span> var val frame<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>set-car! frame <span style="color: #909183;">(</span>cons var <span style="color: #709870;">(</span>car frame<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>set-cdr! frame <span style="color: #909183;">(</span>cons val <span style="color: #709870;">(</span>cdr frame<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">extend-environment</span> vars vals base-env<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">if</span> <span style="color: #909183;">(</span>= <span style="color: #709870;">(</span>length vars<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>length vals<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>cons <span style="color: #709870;">(</span>make-frame vars vals<span style="color: #709870;">)</span> base-env<span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span><span style="color: #a020f0;">if</span> <span style="color: #709870;">(</span>&lt; <span style="color: #907373;">(</span>length vars<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>length vals<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span>error <span style="color: #8b2252;">"Too many arguments supplied"</span> vars vals<span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span>error <span style="color: #8b2252;">"Too few arguments supplied"</span> vars vals<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">lookup-variable-value</span> var env<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">env-loop</span> env<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">scan</span> vars vals<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>null? vars<span style="color: #6276ba;">)</span>
             <span style="color: #6276ba;">(</span>env-loop <span style="color: #858580;">(</span>enclosing-environment env<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>eq? var <span style="color: #858580;">(</span>car vars<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
             <span style="color: #6276ba;">(</span>car vals<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span><span style="color: #a020f0;">else</span> <span style="color: #6276ba;">(</span>scan <span style="color: #858580;">(</span>cdr vars<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>cdr vals<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">if</span> <span style="color: #709870;">(</span>eq? env the-empty-environment<span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>error <span style="color: #8b2252;">"Unbound variable"</span> var<span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span><span style="color: #a020f0;">let</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>frame <span style="color: #858580;">(</span>first-frame env<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>scan <span style="color: #6276ba;">(</span>frame-variables frame<span style="color: #6276ba;">)</span>
                <span style="color: #6276ba;">(</span>frame-values frame<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>env-loop env<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">set-variable-value!</span> var val env<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">env-loop</span> env<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">scan</span> vars vals<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>null? vars<span style="color: #6276ba;">)</span>
             <span style="color: #6276ba;">(</span>env-loop <span style="color: #858580;">(</span>enclosing-environment env<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>eq? var <span style="color: #858580;">(</span>car vars<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
             <span style="color: #6276ba;">(</span>set-car! vals val<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span><span style="color: #a020f0;">else</span> <span style="color: #6276ba;">(</span>scan <span style="color: #858580;">(</span>cdr vars<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>cdr vals<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">if</span> <span style="color: #709870;">(</span>eq? env the-empty-environment<span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>error <span style="color: #8b2252;">"Unbound variable -- SET!"</span> var<span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span><span style="color: #a020f0;">let</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>frame <span style="color: #858580;">(</span>first-frame env<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>scan <span style="color: #6276ba;">(</span>frame-variables frame<span style="color: #6276ba;">)</span>
                <span style="color: #6276ba;">(</span>frame-values frame<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>env-loop env<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">define-variable!</span> var val env<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>frame <span style="color: #907373;">(</span>first-frame env<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #709870;">(</span><span style="color: #0000ff;">scan</span> vars vals<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>null? vars<span style="color: #6276ba;">)</span>
             <span style="color: #6276ba;">(</span>add-binding-to-frame! var val frame<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>eq? var <span style="color: #858580;">(</span>car vars<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
             <span style="color: #6276ba;">(</span>set-car! vals val<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span><span style="color: #a020f0;">else</span> <span style="color: #6276ba;">(</span>scan <span style="color: #858580;">(</span>cdr vars<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>cdr vals<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>scan <span style="color: #709870;">(</span>frame-variables frame<span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span>frame-values frame<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
