ch4/ch4.org
**** DONE Read SICP 4.1.3
     :PROPERTIES:
     :Effort:   0:15
     :END:
**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-26.html#%_thm_4.11][Exercise 4.11]]
     CLOCK: [2015-05-23 Sat 20:57]--[2015-05-23 Sat 21:05] =>  0:08
     :PROPERTIES:
     :Effort:   0:15
     :END:

Redundant with Exercise 4.12.

