ch4/ch4.html

<div id="outline-container-orgheadline19" class="outline-5">
<h5 id="orgheadline19"><span class="done DONE">DONE</span> Read SICP 4.1.3</h5>
<div class="outline-text-5" id="text-orgheadline19">
</div>
</div>
<div id="outline-container-orgheadline20" class="outline-5">
<h5 id="orgheadline20"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-26.html#%_thm_4.11">Exercise 4.11</a></h5>
<div class="outline-text-5" id="text-orgheadline20">
<p>
:Effort:   0:15
</p>

<p>
Redundant with Exercise 4.12.
</p>
</div>
</div>
