ch4/ch4.html

<div id="outline-container-orgheadline21" class="outline-5">
<h5 id="orgheadline21"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-26.html#%_thm_4.12">Exercise 4.12</a></h5>
<div class="outline-text-5" id="text-orgheadline21">
<p>
Implement environment bindings as a list of name-value pairs (implemented as a
list of two elements to allow for deleting a binding from an environment, see
Exercise 4.13) instead of as a pair of lists:
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock36"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">enclosing-environment</span> env<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>cdr env<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">first-frame</span> env<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>car env<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">the-empty-environment</span> '<span style="color: #7388d6;">()</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">get-bindings</span> frame<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>car frame<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">make-binding</span> var val<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>list var val<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">make-frame</span> variables values<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #0000ff;">iter</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>variables variables<span style="color: #709870;">)</span>
             <span style="color: #709870;">(</span>values values<span style="color: #709870;">)</span>
             <span style="color: #709870;">(</span>bindings '<span style="color: #907373;">()</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">if</span> <span style="color: #709870;">(</span>null? variables<span style="color: #709870;">)</span>
        `<span style="color: #709870;">(</span>,bindings<span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>iter <span style="color: #907373;">(</span>cdr variables<span style="color: #907373;">)</span>
              <span style="color: #907373;">(</span>cdr values<span style="color: #907373;">)</span>
              <span style="color: #907373;">(</span>cons <span style="color: #6276ba;">(</span>make-binding <span style="color: #858580;">(</span>car variables<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>car values<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
                    bindings<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">add-binding-to-frame!</span> var val frame<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>bindings <span style="color: #907373;">(</span>get-bindings frame<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>set-car! frame <span style="color: #709870;">(</span>cons <span style="color: #907373;">(</span>make-binding var val<span style="color: #907373;">)</span> bindings<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">extend-environment</span> vars vals base-env<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">if</span> <span style="color: #909183;">(</span>= <span style="color: #709870;">(</span>length vars<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>length vals<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>cons <span style="color: #709870;">(</span>make-frame vars vals<span style="color: #709870;">)</span> base-env<span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span><span style="color: #a020f0;">if</span> <span style="color: #709870;">(</span>&lt; <span style="color: #907373;">(</span>length vars<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>length vals<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span>error <span style="color: #8b2252;">"Too many arguments supplied"</span> vars vals<span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span>error <span style="color: #8b2252;">"Too few arguments supplied"</span> vars vals<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">lookup-variable-value</span> var env<span style="color: #7388d6;">)</span>
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">Wrap returned value in list in order to terminate lookup, which requires</span>
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">that we unwrap it at the top.</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>res
         <span style="color: #907373;">(</span>scan-env
          var #f env
          <span style="color: #6276ba;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #858580;">(</span>var -unused- env frame<span style="color: #858580;">)</span>
            <span style="color: #858580;">(</span>scan-bindings
             var #f env frame
             <span style="color: #80a880;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #887070;">(</span>var -unused- env frame bindings<span style="color: #887070;">)</span>
               <span style="color: #887070;">(</span>list <span style="color: #707183;">(</span>cadar bindings<span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
             <span style="color: #80a880;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #887070;">(</span>var -unused- env frame bindings<span style="color: #887070;">)</span> #f<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
          <span style="color: #6276ba;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #858580;">(</span>var -unused- env<span style="color: #858580;">)</span>
            <span style="color: #858580;">(</span>error <span style="color: #8b2252;">"Unbound variable"</span> var<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">if</span> <span style="color: #709870;">(</span>pair? res<span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>car res<span style="color: #709870;">)</span>
        res<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">set-value-in-bindings!</span> bindings val<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>set-car! <span style="color: #909183;">(</span>cdar bindings<span style="color: #909183;">)</span> val<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">set-variable-value!</span> var val env<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>scan-env
   var val env
   <span style="color: #909183;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #709870;">(</span>var val env frame<span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span>scan-bindings
      var val env frame
      <span style="color: #907373;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #6276ba;">(</span>var val env frame bindings<span style="color: #6276ba;">)</span>
        <span style="color: #6276ba;">(</span>set-value-in-bindings! bindings val<span style="color: #6276ba;">)</span>
        'ok<span style="color: #907373;">)</span>
      <span style="color: #907373;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #6276ba;">(</span>var val env frame bindings<span style="color: #6276ba;">)</span> #f<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #709870;">(</span>var val env<span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span>error <span style="color: #8b2252;">"Unbound variable -- SET!"</span> var<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">define-variable!</span> var val env<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>scan-env
   var val env
   <span style="color: #909183;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #709870;">(</span>var val env frame<span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span>scan-bindings
      var val env frame
      <span style="color: #907373;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #6276ba;">(</span>var val env frame bindings<span style="color: #6276ba;">)</span>
        <span style="color: #6276ba;">(</span>set-value-in-bindings! bindings val<span style="color: #6276ba;">)</span>
        'ok<span style="color: #907373;">)</span>
      <span style="color: #907373;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #6276ba;">(</span>var val env frame bindings<span style="color: #6276ba;">)</span>
        <span style="color: #6276ba;">(</span>add-binding-to-frame! var val frame<span style="color: #6276ba;">)</span>
        'ok<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #709870;">(</span>var val env<span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span>error <span style="color: #8b2252;">"Should never get here -- DEFINE!"</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">scan-env</span> var val env on-frame on-not-found-in-env<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #0000ff;">env-loop</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>env env<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">if</span> <span style="color: #709870;">(</span>eq? env the-empty-environment<span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>on-not-found-in-env var val env<span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span><span style="color: #a020f0;">let</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>frame <span style="color: #858580;">(</span>first-frame env<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>on-frame var val env frame<span style="color: #858580;">)</span> =&gt; identity<span style="color: #6276ba;">)</span>
                <span style="color: #6276ba;">(</span><span style="color: #a020f0;">else</span> <span style="color: #858580;">(</span>env-loop <span style="color: #80a880;">(</span>enclosing-environment env<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">scan-bindings</span> var val env frame on-found-in-frame on-not-found-in-frame<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #0000ff;">frame-loop</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>bindings <span style="color: #907373;">(</span>get-bindings frame<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>null? bindings<span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span>on-not-found-in-frame var val env frame bindings<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span><span style="color: #907373;">(</span>eq? var <span style="color: #6276ba;">(</span>caar bindings<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span>on-found-in-frame var val env frame bindings<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span><span style="color: #a020f0;">else</span> <span style="color: #907373;">(</span>frame-loop <span style="color: #6276ba;">(</span>cdr bindings<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span>include <span style="color: #8b2252;">"ex-4-3"</span><span style="color: #707183;">)</span>
<span style="color: #228b22;">&lt;&lt;ex-4-12-environments&gt;&gt;</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> test<span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">test-group</span> <span style="color: #8b2252;">"ex-4-12-test"</span>
            <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">env</span> <span style="color: #909183;">(</span>extend-environment '<span style="color: #709870;">(</span>x y<span style="color: #709870;">)</span> '<span style="color: #709870;">(</span>1 2<span style="color: #709870;">)</span> the-empty-environment<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
            <span style="color: #7388d6;">(</span><span style="color: #a020f0;">test-assert</span> <span style="color: #909183;">(</span>equal? env '<span style="color: #709870;">(</span><span style="color: #907373;">(</span><span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>y 2<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>x 1<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
            <span style="color: #7388d6;">(</span>define-variable! 'z <span style="color: #8b2252;">"zeta"</span> env<span style="color: #7388d6;">)</span>
            <span style="color: #7388d6;">(</span>test <span style="color: #8b2252;">"zeta"</span>
                  <span style="color: #909183;">(</span>lookup-variable-value 'z env<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
            <span style="color: #7388d6;">(</span>set-variable-value! 'z <span style="color: #8b2252;">"zee"</span> env<span style="color: #7388d6;">)</span>
            <span style="color: #7388d6;">(</span>test <span style="color: #8b2252;">"zee"</span>
                  <span style="color: #909183;">(</span>lookup-variable-value 'z env<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
            <span style="color: #7388d6;">(</span>define-variable! 'x 3 env<span style="color: #7388d6;">)</span>
            <span style="color: #7388d6;">(</span>test 3
                  <span style="color: #909183;">(</span>lookup-variable-value 'x env<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
            <span style="color: #7388d6;">(</span>test 2
                  <span style="color: #909183;">(</span>lookup-variable-value 'y env<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
<p>
:Effort:   0:30
</p>
</div>
</div>
