ch4/ch4.html

<div id="outline-container-orgheadline22" class="outline-5">
<h5 id="orgheadline22"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-26.html#%_thm_4.13">Exercise 4.13</a></h5>
<div class="outline-text-5" id="text-orgheadline22">
<ul class="org-ul">
<li>Note taken on <span class="timestamp-wrapper"><span class="timestamp">[2015-05-23 Sat 23:51] </span></span> <br  />
Test 7 continues to fail for some reason.</li>
</ul>

<p>
There are three obvious approaches to allow unbinding a variable from the
environment:
</p>

<ol class="org-ol">
<li>Unbind the variable in the first frame where it is visible (starting from the
current frame).</li>
<li>Unbind the variable in all frames.</li>
<li>Hide the variable from the current frame, but don't affect the bindings in
higher frames.</li>
</ol>

<p>
Of these approaches, number 3 is the most consistent with the reference
semantics of lexical scoping implied by the way new bindings shadow bindings in
higher frames. When a binding to a variable is added in the current frame, the
value assigned to it shadows the previous value until the current frame is
popped by returning from the procedure, after which the variable continues to
have its previous value. Thus, deleting a binding to a variable should have the
same behavior &#x2013; the deletion affects only the current and lower frames and is
voided upon popping the current frame.
</p>

<p>
It may be argued that approach 1 or 2 is more reasonable, since mutation
affects the value of the variable in the first frame where it's visible even
after the current procedure returns. However, adding a binding to a frame
creates a reference to a value valid until the current frame is popped, so
deleting a binding should also unbind that reference for the lifetime of the
current frame. Mutations, on the other hand, don't affect references, but
rather the value behind the reference.
</p>

<p>
In Exercise 4.12, I've used the data structure <code>`(,var (,val))</code> for each
binding rather than the simpler <code>`(,var ,val)</code> to enable deletions to shadow
earlier bindings by adding a binding of the form
<code>`(,var the-unbound-sentinel)</code> without causing ambiguity if <code>val</code> happens to be
<code>the-unbound-sentinel</code>.
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock37"><span style="color: #228b22;">&lt;&lt;ex-4-12-environments&gt;&gt;</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">unbound-binding?</span> binding<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>eq? <span style="color: #909183;">(</span>cdr binding<span style="color: #909183;">)</span> 'the-unbound-sentinel<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">scan-bindings</span> var val env frame on-found-in-frame on-not-found-in-frame<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #0000ff;">frame-loop</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>bindings <span style="color: #907373;">(</span>get-bindings frame<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span><span style="color: #a020f0;">or</span> <span style="color: #6276ba;">(</span>null? bindings<span style="color: #6276ba;">)</span>
               <span style="color: #6276ba;">(</span>unbound-binding? <span style="color: #858580;">(</span>car bindings<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span>on-not-found-in-frame var val env frame bindings<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span><span style="color: #907373;">(</span>eq? var <span style="color: #6276ba;">(</span>caar bindings<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span>on-found-in-frame var val env frame bindings<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span><span style="color: #a020f0;">else</span> <span style="color: #907373;">(</span>frame-loop <span style="color: #6276ba;">(</span>cdr bindings<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">lookup-variable-value</span> var env<span style="color: #7388d6;">)</span>
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">Wrap returned value in list in order to terminate lookup, which requires</span>
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">that we unwrap it at the top.</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>res
         <span style="color: #907373;">(</span>scan-env
          var #f env
          <span style="color: #6276ba;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #858580;">(</span>var -unused- env frame<span style="color: #858580;">)</span>
            <span style="color: #858580;">(</span>scan-bindings
             var #f env frame
             <span style="color: #80a880;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #887070;">(</span>var -unused- env frame bindings<span style="color: #887070;">)</span>
               <span style="color: #887070;">(</span>list <span style="color: #707183;">(</span>cadar bindings<span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
             <span style="color: #80a880;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #887070;">(</span>var -unused- env frame bindings<span style="color: #887070;">)</span>
               <span style="color: #887070;">(</span><span style="color: #a020f0;">if</span> <span style="color: #707183;">(</span><span style="color: #a020f0;">and</span> <span style="color: #7388d6;">(</span>not <span style="color: #909183;">(</span>null? bindings<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
                        <span style="color: #7388d6;">(</span>unbound-binding? <span style="color: #909183;">(</span>car bindings<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
                   <span style="color: #707183;">(</span>error <span style="color: #8b2252;">"Unbound variable (deleted)"</span> var<span style="color: #707183;">)</span>
                   #f<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
          <span style="color: #6276ba;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #858580;">(</span>var -unused- env<span style="color: #858580;">)</span>
            <span style="color: #858580;">(</span>error <span style="color: #8b2252;">"Unbound variable"</span> var<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">if</span> <span style="color: #709870;">(</span>pair? res<span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>car res<span style="color: #709870;">)</span>
        res<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>


<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">make-unbound-variable!</span> var env<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>scan-env
   var #f env
   <span style="color: #909183;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #709870;">(</span>var -unused- env frame<span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span>scan-bindings
      var #f env frame
      <span style="color: #907373;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #6276ba;">(</span>var -unused- env frame bindings<span style="color: #6276ba;">)</span>
        <span style="color: #6276ba;">(</span>set-cdr! <span style="color: #858580;">(</span>car bindings<span style="color: #858580;">)</span> 'the-unbound-sentinel<span style="color: #6276ba;">)</span>
        'ok<span style="color: #907373;">)</span>
      <span style="color: #907373;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #6276ba;">(</span>var -unused- env frame bindings<span style="color: #6276ba;">)</span>
        <span style="color: #6276ba;">(</span>add-binding-to-frame! var -unused- frame<span style="color: #6276ba;">)</span>
        'ok<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #709870;">(</span>var -unused- env<span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span>error <span style="color: #8b2252;">"Should never get here -- DEFINE!"</span> var<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">get-make-unbound-variable</span> exp<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>cadr exp<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">eval-make-unbound</span> exp env<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>make-unbound-variable! <span style="color: #909183;">(</span>get-make-unbound-variable exp<span style="color: #909183;">)</span>
                          env<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock38"><span style="color: #707183;">(</span>eval-4-1-put 'make-unbound!
              <span style="color: #7388d6;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #909183;">(</span>exp env<span style="color: #909183;">)</span>
                <span style="color: #909183;">(</span>eval-make-unbound exp env<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span>include <span style="color: #8b2252;">"ex-4-3"</span><span style="color: #707183;">)</span>
<span style="color: #228b22;">&lt;&lt;ex-4-13-environments&gt;&gt;</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> test<span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">test-group</span> <span style="color: #8b2252;">"ex-4-13-test"</span>
            <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">env</span> <span style="color: #909183;">(</span>extend-environment '<span style="color: #709870;">(</span>x y<span style="color: #709870;">)</span> '<span style="color: #709870;">(</span>1 2<span style="color: #709870;">)</span> the-empty-environment<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
            <span style="color: #7388d6;">(</span><span style="color: #a020f0;">test-assert</span> <span style="color: #909183;">(</span>equal? env '<span style="color: #709870;">(</span><span style="color: #907373;">(</span><span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>y 2<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>x 1<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
            <span style="color: #7388d6;">(</span>define-variable! 'z <span style="color: #8b2252;">"zeta"</span> env<span style="color: #7388d6;">)</span>
            <span style="color: #7388d6;">(</span>test <span style="color: #8b2252;">"zeta"</span>
                  <span style="color: #909183;">(</span>lookup-variable-value 'z env<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
            <span style="color: #7388d6;">(</span>set-variable-value! 'z <span style="color: #8b2252;">"zee"</span> env<span style="color: #7388d6;">)</span>
            <span style="color: #7388d6;">(</span>test <span style="color: #8b2252;">"zee"</span>
                  <span style="color: #909183;">(</span>lookup-variable-value 'z env<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
            <span style="color: #7388d6;">(</span>define-variable! 'x 3 env<span style="color: #7388d6;">)</span>
            <span style="color: #7388d6;">(</span>test 3
                  <span style="color: #909183;">(</span>lookup-variable-value 'x env<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
            <span style="color: #7388d6;">(</span>test 2
                  <span style="color: #909183;">(</span>lookup-variable-value 'y env<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
            <span style="color: #b22222;">;;; </span><span style="color: #b22222;">Assert that the effects of make-unbound! disappear once its</span>
            <span style="color: #b22222;">;;; </span><span style="color: #b22222;">frame has been popped.</span>
            <span style="color: #7388d6;">(</span>test 3
                  <span style="color: #909183;">(</span>eval-4-1
                   '<span style="color: #709870;">(</span><span style="color: #a020f0;">begin</span>
                      <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #858580;">()</span>
                         <span style="color: #858580;">(</span>make-unbound! x<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
                      x<span style="color: #709870;">)</span>
                   env<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
            <span style="color: #b22222;">;;; </span><span style="color: #b22222;">Assert that make-unbound! actually unbinds the variable.</span>
            <span style="color: #7388d6;">(</span><span style="color: #a020f0;">test-assert</span>
             <span style="color: #909183;">(</span><span style="color: #a020f0;">condition-case</span>
                 <span style="color: #709870;">(</span><span style="color: #a020f0;">begin</span>
                   <span style="color: #907373;">(</span>eval-4-1
                    '<span style="color: #6276ba;">(</span><span style="color: #a020f0;">begin</span>
                       <span style="color: #858580;">(</span><span style="color: #80a880;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #887070;">()</span>
                          <span style="color: #887070;">(</span>make-unbound! x<span style="color: #887070;">)</span>
                          x<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
                    env<span style="color: #907373;">)</span>
                   #f<span style="color: #709870;">)</span>
               <span style="color: #709870;">(</span><span style="color: #907373;">(</span>exn<span style="color: #907373;">)</span> #t<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>


<p>
:Effort:   0:45
</p>
</div>
</div>
</div>
