ch4/ch4.org
**** Code

#+NAME: evaluator-running
#+BEGIN_SRC scheme
  <<evaluator-running-primitives>>
  <<evaluator-running-setup>>
  <<evaluator-running-driver>>
#+END_SRC

- Set up the environment:

  #+NAME: evaluator-running-setup
  #+BEGIN_SRC scheme
    (define (setup-environment)
      (let ((initial-env
             (extend-environment (primitive-procedure-names)
                                 (primitive-procedure-objects)
                                 the-empty-environment)))
        (define-variable! 'true true initial-env)
        (define-variable! 'false false initial-env)
        initial-env))
    (define the-global-environment (setup-environment))
  #+END_SRC

- Implement primitive procedures:

  #+NAME: evaluator-running-primitives
  #+BEGIN_SRC scheme
    (define (primitive-procedure? proc)
      (tagged-list? proc 'primitive))

    (define (primitive-implementation proc) (cadr proc))

    (define primitive-procedures
      (list (list 'car car)
            (list 'cdr cdr)
            (list 'cons cons)
            (list 'null? null?)
            (list 'not not)
            (list '+ +)
            (list '- -)
            (list '* *)
            (list '/ /)
            (list '= =)
            ;; <more primitives>
            ))
    (define (primitive-procedure-names)
      (map car
           primitive-procedures))

    (define (primitive-procedure-objects)
      (map (lambda (proc) (list 'primitive (cadr proc)))
           primitive-procedures))

    ;;; Save the APPLY procedure from the underlying Scheme. This separates out the
    ;;; APPLY procedure in the interpreter from that of the underlying Scheme. (I
    ;;; have renamed the interpreter's version APPLY-4-1 as well, instead of just
    ;;; APPLY, as used in the original text.)
    (define apply-in-underlying-scheme apply)
    (define (apply-primitive-procedure proc args)
      (apply-in-underlying-scheme
       (primitive-implementation proc) args))
  #+END_SRC

- Driver loop:

  #+NAME: evaluator-running-driver
  #+BEGIN_SRC scheme
    (use posix)
    (define input-prompt ";;; M-Eval input:")
    (define output-prompt ";;; M-Eval value:")
    (define (driver-loop)
      ;;; Define a temporary port duplicated from standard input in order to allow
      ;;; exiting the driver loop on EOF without exiting the interpreter as well.
      (with-input-from-port (open-input-file* (duplicate-fileno fileno/stdin))
          (lambda ()
            (let iter ()
              (prompt-for-input input-prompt)
              (let ((input (read)))
                (when (not (eof-object? input))
                      (let ((output (eval-4-1 input the-global-environment)))
                        (announce-output output-prompt)
                        (user-print output))
                      (iter)))))))
    (define (prompt-for-input string)
      (newline) (newline) (display string) (newline))

    (define (announce-output string)
      (newline) (display string) (newline))

    (define (user-print object)
      (if (compound-procedure? object)
          (display (list 'compound-procedure
                         (procedure-parameters object)
                         (procedure-body object)
                         '<procedure-env>))
          (display object)))
  #+END_SRC

