ch4/ch4.html
<div id="outline-container-orgheadline27" class="outline-4">
<h4 id="orgheadline27"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-26.html#%_sec_4.1.4">4.1.4: Running the Evaluator as a Program</a> <code>[2/2]</code></h4>
<div class="outline-text-4" id="text-orgheadline27">
</div><div id="outline-container-orgheadline24" class="outline-5">
<h5 id="orgheadline24">Code</h5>
<div class="outline-text-5" id="text-orgheadline24">
<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock39"><span style="color: #228b22;">&lt;&lt;evaluator-running-primitives&gt;&gt;</span>
<span style="color: #228b22;">&lt;&lt;evaluator-running-setup&gt;&gt;</span>
<span style="color: #228b22;">&lt;&lt;evaluator-running-driver&gt;&gt;</span>
</pre>
</div>

<ul class="org-ul">
<li><p>
Set up the environment:
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock40"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">setup-environment</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>initial-env
         <span style="color: #907373;">(</span>extend-environment <span style="color: #6276ba;">(</span>primitive-procedure-names<span style="color: #6276ba;">)</span>
                             <span style="color: #6276ba;">(</span>primitive-procedure-objects<span style="color: #6276ba;">)</span>
                             the-empty-environment<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>define-variable! 'true true initial-env<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>define-variable! 'false false initial-env<span style="color: #909183;">)</span>
    initial-env<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">the-global-environment</span> <span style="color: #7388d6;">(</span>setup-environment<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div></li>

<li><p>
Implement primitive procedures:
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock41"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">primitive-procedure?</span> proc<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>tagged-list? proc 'primitive<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">primitive-implementation</span> proc<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>cadr proc<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">primitive-procedures</span>
  <span style="color: #7388d6;">(</span>list <span style="color: #909183;">(</span>list 'car car<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span>list 'cdr cdr<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span>list 'cons cons<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span>list 'null? null?<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span>list 'not not<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span>list '+ +<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span>list '- -<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span>list '* *<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span>list '/ /<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span>list '= =<span style="color: #909183;">)</span>
        <span style="color: #b22222;">;; </span><span style="color: #b22222;">&lt;more primitives&gt;</span>
        <span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">primitive-procedure-names</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">map</span> car
       primitive-procedures<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">primitive-procedure-objects</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">map</span> <span style="color: #909183;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #709870;">(</span>proc<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>list 'primitive <span style="color: #907373;">(</span>cadr proc<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
       primitive-procedures<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #b22222;">;;; </span><span style="color: #b22222;">Save the APPLY procedure from the underlying Scheme. This separates out the</span>
<span style="color: #b22222;">;;; </span><span style="color: #b22222;">APPLY procedure in the interpreter from that of the underlying Scheme. (I</span>
<span style="color: #b22222;">;;; </span><span style="color: #b22222;">have renamed the interpreter's version APPLY-4-1 as well, instead of just</span>
<span style="color: #b22222;">;;; </span><span style="color: #b22222;">APPLY, as used in the original text.)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">apply-in-underlying-scheme</span> apply<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">apply-primitive-procedure</span> proc args<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>apply-in-underlying-scheme
   <span style="color: #909183;">(</span>primitive-implementation proc<span style="color: #909183;">)</span> args<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div></li>

<li><p>
Driver loop:
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock42"><span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> posix<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">input-prompt</span> <span style="color: #8b2252;">";;; M-Eval input:"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">output-prompt</span> <span style="color: #8b2252;">";;; M-Eval value:"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">driver-loop</span><span style="color: #7388d6;">)</span>
  <span style="color: #b22222;">;;; </span><span style="color: #b22222;">Define a temporary port duplicated from standard input in order to allow</span>
  <span style="color: #b22222;">;;; </span><span style="color: #b22222;">exiting the driver loop on EOF without exiting the interpreter as well.</span>
  <span style="color: #7388d6;">(</span>with-input-from-port <span style="color: #909183;">(</span>open-input-file* <span style="color: #709870;">(</span>duplicate-fileno fileno/stdin<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #709870;">()</span>
        <span style="color: #709870;">(</span><span style="color: #a020f0;">let</span> <span style="color: #0000ff;">iter</span> <span style="color: #907373;">()</span>
          <span style="color: #907373;">(</span>prompt-for-input input-prompt<span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span><span style="color: #a020f0;">let</span> <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>input <span style="color: #80a880;">(</span>read<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
            <span style="color: #6276ba;">(</span><span style="color: #a020f0;">when</span> <span style="color: #858580;">(</span>not <span style="color: #80a880;">(</span>eof-object? input<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                  <span style="color: #858580;">(</span><span style="color: #a020f0;">let</span> <span style="color: #80a880;">(</span><span style="color: #887070;">(</span>output <span style="color: #707183;">(</span>eval-4-1 input the-global-environment<span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
                    <span style="color: #80a880;">(</span>announce-output output-prompt<span style="color: #80a880;">)</span>
                    <span style="color: #80a880;">(</span>user-print output<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                  <span style="color: #858580;">(</span>iter<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">prompt-for-input</span> string<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>newline<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>newline<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>display string<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>newline<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">announce-output</span> string<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>newline<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>display string<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>newline<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">user-print</span> object<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">if</span> <span style="color: #909183;">(</span>compound-procedure? object<span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>display <span style="color: #709870;">(</span>list 'compound-procedure
                     <span style="color: #907373;">(</span>procedure-parameters object<span style="color: #907373;">)</span>
                     <span style="color: #907373;">(</span>procedure-body object<span style="color: #907373;">)</span>
                     '<span style="color: #228b22;">&lt;procedure-env&gt;</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>display object<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div></li>
</ul>
</div>
</div>
