ch4/ch4.org
**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-28.html#%_thm_4.35][Exercise 4.35]]

For

#+BEGIN_SRC scheme
(define (a-pythagorean-triple-between low high)
  (let ((i (an-integer-between low high)))
    (let ((j (an-integer-between i high)))
      (let ((k (an-integer-between j high)))
        (require (= (+ (* i i) (* j j)) (* k k)))
        (list i j k)))))
#+END_SRC

define ~an-integer-between~ as follows:

#+BEGIN_SRC scheme
(define (an-integer-between low high)
  (require (<= low high))
  (amb low (an-integer-between (+ low 1) high)))
#+END_SRC

**** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-28.html#%_thm_4.36][Exercise 4.36]]
     - Note taken on [2015-05-04 Mon 17:51] \\
       Need to actually do Exercise 3.69.

In ~a-pythagorean-triple-between~, one cannot simply replace
~an-integer-between~ with ~an-integer-starting-from~, a procedure that
nondeterministically generates any integer starting from a lower bound, because
~amb~ performs a depth-first search, meaning that the call of
~an-integer-starting-from~ to generate one of the numbers (probably ~k~) will
search through an infinite stream of integers, meaning the possibilities for
the other numbers will never been explored.

In order to generate an infinite number of Pythagorean triples, one must use a
similar technique as Exercise 3.69.

**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-28.html#%_thm_4.37][Exercise 4.37]]

Yes, this version is more efficient. With the version in 4.35, you must
generate all triples of integers \( [l, h] \times [l, h] \times [l, h] \), where \(l\)
and \(h\) are the ~low~ and ~high~ respectively passed to
~a-pythagorean-triple-between~. This version, on the other hand, only requires
generating pairs \( [l, h] \times [l, h] \), giving an asymptotic \(O(N^2)\) running
time rather than \(O(N^3)\).

*** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-28.html#%_sec_4.3.2][4.3.2: Examples of Nondeterministic Programs]] [4/13]
**** DONE Read SICP 4.3.2
**** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-28.html#%_thm_4.38][Exercise 4.38]]

To remove the requirement that Smith and Fletcher do not live on adjacent
floors, simply remove the line

#+BEGIN_SRC scheme
(require (not (= (abs (- smith fletcher)) 1)))
#+END_SRC

which produces the following procedure:

#+BEGIN_SRC scheme
(define (multiple-dwelling)
  (let ((baker (amb 1 2 3 4 5))
        (cooper (amb 1 2 3 4 5))
        (fletcher (amb 1 2 3 4 5))
        (miller (amb 1 2 3 4 5))
        (smith (amb 1 2 3 4 5)))
    (require
     (distinct? (list baker cooper fletcher miller smith)))
    (require (not (= baker 5)))
    (require (not (= cooper 1)))
    (require (not (= fletcher 5)))
    (require (not (= fletcher 1)))
    (require (> miller cooper))
    (require (not (= (abs (- fletcher cooper)) 1)))
    (list (list 'baker baker)
          (list 'cooper cooper)
          (list 'fletcher fletcher)
          (list 'miller miller)
          (list 'smith smith))))
#+END_SRC

**** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-28.html#%_thm_4.39][Exercise 4.39]]

The order of the restrictions does not affect the answer, since all of the
restrictions must be satisfied in order for the answer to be reached. However,
their order can affect the time it takes to obtain the answer. The simplest way
to see this is to note that moving the distinctness requirement to the end will
increase the number of sets of assignments that need to be evaluated by the
other clauses to \(5^5\) from \(5^{\underline{5}}\).

