ch4/ch4.html
<div id="outline-container-orgheadline62" class="outline-5">
<h5 id="orgheadline62"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-28.html#%_thm_4.35">Exercise 4.35</a></h5>
<div class="outline-text-5" id="text-orgheadline62">
<p>
For
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">a-pythagorean-triple-between</span> low high<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>i <span style="color: #907373;">(</span>an-integer-between low high<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">let</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>j <span style="color: #6276ba;">(</span>an-integer-between i high<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">let</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>k <span style="color: #858580;">(</span>an-integer-between j high<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span>require <span style="color: #6276ba;">(</span>= <span style="color: #858580;">(</span>+ <span style="color: #80a880;">(</span>* i i<span style="color: #80a880;">)</span> <span style="color: #80a880;">(</span>* j j<span style="color: #80a880;">)</span><span style="color: #858580;">)</span> <span style="color: #858580;">(</span>* k k<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span>list i j k<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
define <code>an-integer-between</code> as follows:
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">an-integer-between</span> low high<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>require <span style="color: #909183;">(</span>&lt;= low high<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>amb low <span style="color: #909183;">(</span>an-integer-between <span style="color: #709870;">(</span>+ low 1<span style="color: #709870;">)</span> high<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline63" class="outline-5">
<h5 id="orgheadline63"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-28.html#%_thm_4.36">Exercise 4.36</a></h5>
<div class="outline-text-5" id="text-orgheadline63">
<ul class="org-ul">
<li>Note taken on <span class="timestamp-wrapper"><span class="timestamp">[2015-05-04 Mon 17:51] </span></span> <br  />
Need to actually do Exercise 3.69.</li>
</ul>

<p>
In <code>a-pythagorean-triple-between</code>, one cannot simply replace
<code>an-integer-between</code> with <code>an-integer-starting-from</code>, a procedure that
nondeterministically generates any integer starting from a lower bound, because
<code>amb</code> performs a depth-first search, meaning that the call of
<code>an-integer-starting-from</code> to generate one of the numbers (probably <code>k</code>) will
search through an infinite stream of integers, meaning the possibilities for
the other numbers will never been explored.
</p>

<p>
In order to generate an infinite number of Pythagorean triples, one must use a
similar technique as Exercise 3.69.
</p>
</div>
</div>

<div id="outline-container-orgheadline64" class="outline-5">
<h5 id="orgheadline64"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-28.html#%_thm_4.37">Exercise 4.37</a></h5>
<div class="outline-text-5" id="text-orgheadline64">
<p>
Yes, this version is more efficient. With the version in 4.35, you must
generate all triples of integers \( [l, h] \times [l, h] \times [l, h] \), where \(l\)
and \(h\) are the <code>low</code> and <code>high</code> respectively passed to
<code>a-pythagorean-triple-between</code>. This version, on the other hand, only requires
generating pairs \( [l, h] \times [l, h] \), giving an asymptotic \(O(N^2)\) running
time rather than \(O(N^3)\).
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline79" class="outline-4">
<h4 id="orgheadline79"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-28.html#%_sec_4.3.2">4.3.2: Examples of Nondeterministic Programs</a> <code>[4/13]</code></h4>
<div class="outline-text-4" id="text-orgheadline79">
</div><div id="outline-container-orgheadline66" class="outline-5">
<h5 id="orgheadline66"><span class="done DONE">DONE</span> Read SICP 4.3.2</h5>
</div>
<div id="outline-container-orgheadline67" class="outline-5">
<h5 id="orgheadline67"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-28.html#%_thm_4.38">Exercise 4.38</a></h5>
<div class="outline-text-5" id="text-orgheadline67">
<p>
To remove the requirement that Smith and Fletcher do not live on adjacent
floors, simply remove the line
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span>require <span style="color: #7388d6;">(</span>not <span style="color: #909183;">(</span>= <span style="color: #709870;">(</span>abs <span style="color: #907373;">(</span>- smith fletcher<span style="color: #907373;">)</span><span style="color: #709870;">)</span> 1<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
which produces the following procedure:
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">multiple-dwelling</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>baker <span style="color: #907373;">(</span>amb 1 2 3 4 5<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>cooper <span style="color: #907373;">(</span>amb 1 2 3 4 5<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>fletcher <span style="color: #907373;">(</span>amb 1 2 3 4 5<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>miller <span style="color: #907373;">(</span>amb 1 2 3 4 5<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>smith <span style="color: #907373;">(</span>amb 1 2 3 4 5<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>require
     <span style="color: #709870;">(</span>distinct? <span style="color: #907373;">(</span>list baker cooper fletcher miller smith<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>require <span style="color: #709870;">(</span>not <span style="color: #907373;">(</span>= baker 5<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>require <span style="color: #709870;">(</span>not <span style="color: #907373;">(</span>= cooper 1<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>require <span style="color: #709870;">(</span>not <span style="color: #907373;">(</span>= fletcher 5<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>require <span style="color: #709870;">(</span>not <span style="color: #907373;">(</span>= fletcher 1<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>require <span style="color: #709870;">(</span>&gt; miller cooper<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>require <span style="color: #709870;">(</span>not <span style="color: #907373;">(</span>= <span style="color: #6276ba;">(</span>abs <span style="color: #858580;">(</span>- fletcher cooper<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span> 1<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>list <span style="color: #709870;">(</span>list 'baker baker<span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span>list 'cooper cooper<span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span>list 'fletcher fletcher<span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span>list 'miller miller<span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span>list 'smith smith<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline68" class="outline-5">
<h5 id="orgheadline68"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-28.html#%_thm_4.39">Exercise 4.39</a></h5>
<div class="outline-text-5" id="text-orgheadline68">
<p>
The order of the restrictions does not affect the answer, since all of the
restrictions must be satisfied in order for the answer to be reached. However,
their order can affect the time it takes to obtain the answer. The simplest way
to see this is to note that moving the distinctness requirement to the end will
increase the number of sets of assignments that need to be evaluated by the
other clauses to \(5^5\) from \(5^{\underline{5}}\).
</p>
</div>
</div>
