ch4/ch4.html

<div id="outline-container-orgheadline69" class="outline-5">
<h5 id="orgheadline69"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-28.html#%_thm_4.40">Exercise 4.40</a></h5>
<div class="outline-text-5" id="text-orgheadline69">
<p>
We can make the program substantially more efficient by imposing all
restrictions that involve one variable before those that involve two and so on
until those involving all five:
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">multiple-dwelling</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>baker <span style="color: #907373;">(</span>amb 1 2 3 4 5<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>require <span style="color: #709870;">(</span>not <span style="color: #907373;">(</span>= baker 5<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">let</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>cooper <span style="color: #6276ba;">(</span>amb 1 2 3 4 5<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>require <span style="color: #907373;">(</span>not <span style="color: #6276ba;">(</span>= cooper 1<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">let</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>fletcher <span style="color: #858580;">(</span>amb 1 2 3 4 5<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span>require <span style="color: #6276ba;">(</span>not <span style="color: #858580;">(</span>= fletcher 5<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span>require <span style="color: #6276ba;">(</span>not <span style="color: #858580;">(</span>= fletcher 1<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span>require <span style="color: #6276ba;">(</span>not <span style="color: #858580;">(</span>= <span style="color: #80a880;">(</span>abs <span style="color: #887070;">(</span>- fletcher cooper<span style="color: #887070;">)</span><span style="color: #80a880;">)</span> 1<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span><span style="color: #a020f0;">let</span> <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>miller <span style="color: #80a880;">(</span>amb 1 2 3 4 5<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
          <span style="color: #6276ba;">(</span>require <span style="color: #858580;">(</span>&gt; miller cooper<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
          <span style="color: #6276ba;">(</span><span style="color: #a020f0;">let</span> <span style="color: #858580;">(</span><span style="color: #80a880;">(</span><span style="color: #887070;">(</span>smith <span style="color: #707183;">(</span>amb 1 2 3 4 5<span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
            <span style="color: #858580;">(</span>require
             <span style="color: #80a880;">(</span>distinct? <span style="color: #887070;">(</span>list baker cooper fletcher miller smith<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
            <span style="color: #858580;">(</span>require <span style="color: #80a880;">(</span>not <span style="color: #887070;">(</span>= <span style="color: #707183;">(</span>abs <span style="color: #7388d6;">(</span>- smith fletcher<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span> 1<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
            <span style="color: #858580;">(</span>list <span style="color: #80a880;">(</span>list 'baker baker<span style="color: #80a880;">)</span>
                  <span style="color: #80a880;">(</span>list 'cooper cooper<span style="color: #80a880;">)</span>
                  <span style="color: #80a880;">(</span>list 'fletcher fletcher<span style="color: #80a880;">)</span>
                  <span style="color: #80a880;">(</span>list 'miller miller<span style="color: #80a880;">)</span>
                  <span style="color: #80a880;">(</span>list 'smith smith<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
