ch4/ch4.org
**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-28.html#%_thm_4.41][Exercise 4.41]]

Seems substantially easier to recast in terms of an ordinary recursive Scheme
procedure after looking at the non-deterministic version -- we'll just perform
the tree search ourselves:

#+BEGIN_SRC scheme
(define (multiple-dwelling)
  (filter-mapper
   (lambda (baker)
     (if (not (= baker 5))
         (filter-mapper
          (lambda (cooper)
            (if (not (= cooper 1))
                (filter-mapper
                 (lambda (fletcher)
                   (if (and (not (= fletcher 5))
                            (not (= fletcher 1))
                            (not (= (abs (- fletcher cooper)) 1)))
                       (filter-mapper
                        (lambda (miller)
                          (if (> miller cooper)
                              (filter-mapper
                               (lambda (smith)
                                 (if (and (distinct? (list baker cooper fletcher miller smith))
                                          (not (= (abs (- smith fletcher)) 1)))
                                     (list (list 'baker baker)
                                           (list 'cooper cooper)
                                           (list 'fletcher fletcher)
                                           (list 'miller miller)
                                           (list 'smith smith))
                                     '())))
                              '())))
                       '())
                   ))
                '())))
         '()))))

(define (filter-mapper f)
  (filter (lambda (xs) (not (null? xs)))
          (map f '(1 2 3 4 5))))
(define (distinct? items)
  (cond ((null? items) #t)
        ((null? (cdr items)) #t)
        ((member (car items) (cdr items)) #f)
        (else (distinct? (cdr items)))))
#+END_SRC


