ch4/ch4.html

<div id="outline-container-orgheadline70" class="outline-5">
<h5 id="orgheadline70"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-28.html#%_thm_4.41">Exercise 4.41</a></h5>
<div class="outline-text-5" id="text-orgheadline70">
<p>
Seems substantially easier to recast in terms of an ordinary recursive Scheme
procedure after looking at the non-deterministic version &#x2013; we'll just perform
the tree search ourselves:
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">multiple-dwelling</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>filter-mapper
   <span style="color: #909183;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #709870;">(</span>baker<span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span><span style="color: #a020f0;">if</span> <span style="color: #907373;">(</span>not <span style="color: #6276ba;">(</span>= baker 5<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
         <span style="color: #907373;">(</span>filter-mapper
          <span style="color: #6276ba;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #858580;">(</span>cooper<span style="color: #858580;">)</span>
            <span style="color: #858580;">(</span><span style="color: #a020f0;">if</span> <span style="color: #80a880;">(</span>not <span style="color: #887070;">(</span>= cooper 1<span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
                <span style="color: #80a880;">(</span>filter-mapper
                 <span style="color: #887070;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #707183;">(</span>fletcher<span style="color: #707183;">)</span>
                   <span style="color: #707183;">(</span><span style="color: #a020f0;">if</span> <span style="color: #7388d6;">(</span><span style="color: #a020f0;">and</span> <span style="color: #909183;">(</span>not <span style="color: #709870;">(</span>= fletcher 5<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
                            <span style="color: #909183;">(</span>not <span style="color: #709870;">(</span>= fletcher 1<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
                            <span style="color: #909183;">(</span>not <span style="color: #709870;">(</span>= <span style="color: #907373;">(</span>abs <span style="color: #6276ba;">(</span>- fletcher cooper<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span> 1<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
                       <span style="color: #7388d6;">(</span>filter-mapper
                        <span style="color: #909183;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #709870;">(</span>miller<span style="color: #709870;">)</span>
                          <span style="color: #709870;">(</span><span style="color: #a020f0;">if</span> <span style="color: #907373;">(</span>&gt; miller cooper<span style="color: #907373;">)</span>
                              <span style="color: #907373;">(</span>filter-mapper
                               <span style="color: #6276ba;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #858580;">(</span>smith<span style="color: #858580;">)</span>
                                 <span style="color: #858580;">(</span><span style="color: #a020f0;">if</span> <span style="color: #80a880;">(</span><span style="color: #a020f0;">and</span> <span style="color: #887070;">(</span>distinct? <span style="color: #707183;">(</span>list baker cooper fletcher miller smith<span style="color: #707183;">)</span><span style="color: #887070;">)</span>
                                          <span style="color: #887070;">(</span>not <span style="color: #707183;">(</span>= <span style="color: #7388d6;">(</span>abs <span style="color: #909183;">(</span>- smith fletcher<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span> 1<span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
                                     <span style="color: #80a880;">(</span>list <span style="color: #887070;">(</span>list 'baker baker<span style="color: #887070;">)</span>
                                           <span style="color: #887070;">(</span>list 'cooper cooper<span style="color: #887070;">)</span>
                                           <span style="color: #887070;">(</span>list 'fletcher fletcher<span style="color: #887070;">)</span>
                                           <span style="color: #887070;">(</span>list 'miller miller<span style="color: #887070;">)</span>
                                           <span style="color: #887070;">(</span>list 'smith smith<span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
                                     '<span style="color: #80a880;">()</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
                              '<span style="color: #907373;">()</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
                       '<span style="color: #7388d6;">()</span><span style="color: #707183;">)</span>
                   <span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
                '<span style="color: #80a880;">()</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
         '<span style="color: #907373;">()</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">filter-mapper</span> f<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>filter <span style="color: #909183;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #709870;">(</span>xs<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>not <span style="color: #907373;">(</span>null? xs<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
          <span style="color: #909183;">(</span><span style="color: #a020f0;">map</span> f '<span style="color: #709870;">(</span>1 2 3 4 5<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">distinct?</span> items<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">cond</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>null? items<span style="color: #709870;">)</span> #t<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>null? <span style="color: #907373;">(</span>cdr items<span style="color: #907373;">)</span><span style="color: #709870;">)</span> #t<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>member <span style="color: #907373;">(</span>car items<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>cdr items<span style="color: #907373;">)</span><span style="color: #709870;">)</span> #f<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #a020f0;">else</span> <span style="color: #709870;">(</span>distinct? <span style="color: #907373;">(</span>cdr items<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
