ch4/ch4.org
**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-28.html#%_thm_4.42][Exercise 4.42]]

Here's the ~amb~ evaluator-based solution:

#+BEGIN_SRC scheme
(define (solve-liars)
  (let ((betty (amb 1 2 3 4 5))
        (kitty (amb 1 2 3 4 5)))
    (require (xor (= kitty 2)
                  (= betty 3)))
    (let ((mary (amb 1 2 3 4 5)))
      (require (xor (= kitty 2)
                    (= mary 4)))
      (require (xor (= mary 4)
                    (= betty 1)))
      (let ((ethel (amb 1 2 3 4 5))
            (joan (amb 1 2 3 4 5)))
        (require (xor (= ethel 1)
                      (= joan 2)))
        (require (xor (= joan 3)
                      (= ethel 5)))
        (require (distinct? (list betty ethel joan kitty mary)))
        `((betty ,betty)
          (ethel ,ethel)
          (joan ,joan)
          (kitty ,kitty)
          (mary ,mary))))))

(define (xor a b) (not (eq? a b)))
#+END_SRC

However, it's fairly simple to solve this puzzle by hand. Let's perform the
following assignments:

- \(a\): Kitty was second
- \(b\): Betty was third
- \(c\): Mary was fourth
- \(d\): Betty was first
- \(e\): Ethel was first
- \(f\): Joan was second
- \(g\): Joan was third
- \(h\): Ethel was fifth

We want to find all solutions to the equation below where the rank assigned to
each girl is distinct:

\[(a + b) \wedge (a + c) \wedge (c + d) \wedge (e + f) \wedge (g + h)\]

Using the distinctness of ranks, we can add additional constraints:

\[(a + b) \wedge (a + c) \wedge (b + d) \wedge (c + d) \wedge (e + f) \wedge (g + h) \wedge (e + h) \wedge (f + g)\]

Since \(\wedge\) is distributive over \(+\), we first simplify the equation down to

\[(a + (b \wedge c)) \wedge ((b \wedge c) + d) \wedge (e + f) \wedge (g + h) \wedge (e + h) \wedge (f + g)\]

This gives the result

#+BEGIN_SRC scheme
'((betty 3) (ethel 5) (joan 2) (kitty 1) (mary 4))
#+END_SRC

