ch4/ch4.html


<div id="outline-container-orgheadline71" class="outline-5">
<h5 id="orgheadline71"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-28.html#%_thm_4.42">Exercise 4.42</a></h5>
<div class="outline-text-5" id="text-orgheadline71">
<p>
Here's the <code>amb</code> evaluator-based solution:
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">solve-liars</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>betty <span style="color: #907373;">(</span>amb 1 2 3 4 5<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>kitty <span style="color: #907373;">(</span>amb 1 2 3 4 5<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>require <span style="color: #709870;">(</span>xor <span style="color: #907373;">(</span>= kitty 2<span style="color: #907373;">)</span>
                  <span style="color: #907373;">(</span>= betty 3<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">let</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>mary <span style="color: #6276ba;">(</span>amb 1 2 3 4 5<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>require <span style="color: #907373;">(</span>xor <span style="color: #6276ba;">(</span>= kitty 2<span style="color: #6276ba;">)</span>
                    <span style="color: #6276ba;">(</span>= mary 4<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>require <span style="color: #907373;">(</span>xor <span style="color: #6276ba;">(</span>= mary 4<span style="color: #6276ba;">)</span>
                    <span style="color: #6276ba;">(</span>= betty 1<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">let</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>ethel <span style="color: #858580;">(</span>amb 1 2 3 4 5<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
            <span style="color: #6276ba;">(</span>joan <span style="color: #858580;">(</span>amb 1 2 3 4 5<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span>require <span style="color: #6276ba;">(</span>xor <span style="color: #858580;">(</span>= ethel 1<span style="color: #858580;">)</span>
                      <span style="color: #858580;">(</span>= joan 2<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span>require <span style="color: #6276ba;">(</span>xor <span style="color: #858580;">(</span>= joan 3<span style="color: #858580;">)</span>
                      <span style="color: #858580;">(</span>= ethel 5<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span>require <span style="color: #6276ba;">(</span>distinct? <span style="color: #858580;">(</span>list betty ethel joan kitty mary<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
        `<span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>betty ,betty<span style="color: #6276ba;">)</span>
          <span style="color: #6276ba;">(</span>ethel ,ethel<span style="color: #6276ba;">)</span>
          <span style="color: #6276ba;">(</span>joan ,joan<span style="color: #6276ba;">)</span>
          <span style="color: #6276ba;">(</span>kitty ,kitty<span style="color: #6276ba;">)</span>
          <span style="color: #6276ba;">(</span>mary ,mary<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">xor</span> a b<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>not <span style="color: #909183;">(</span>eq? a b<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
However, it's fairly simple to solve this puzzle by hand. Let's perform the
following assignments:
</p>

<ul class="org-ul">
<li>\(a\): Kitty was second</li>
<li>\(b\): Betty was third</li>
<li>\(c\): Mary was fourth</li>
<li>\(d\): Betty was first</li>
<li>\(e\): Ethel was first</li>
<li>\(f\): Joan was second</li>
<li>\(g\): Joan was third</li>
<li>\(h\): Ethel was fifth</li>
</ul>

<p>
We want to find all solutions to the equation below where the rank assigned to
each girl is distinct:
</p>

<p>
\[(a + b) \wedge (a + c) \wedge (c + d) \wedge (e + f) \wedge (g + h)\]
</p>

<p>
Using the distinctness of ranks, we can add additional constraints:
</p>

<p>
\[(a + b) \wedge (a + c) \wedge (b + d) \wedge (c + d) \wedge (e + f) \wedge (g + h) \wedge (e + h) \wedge (f + g)\]
</p>

<p>
Since \(\wedge\) is distributive over \(+\), we first simplify the equation down to
</p>

<p>
\[(a + (b \wedge c)) \wedge ((b \wedge c) + d) \wedge (e + f) \wedge (g + h) \wedge (e + h) \wedge (f + g)\]
</p>

<p>
This gives the result
</p>

<div class="org-src-container">

<pre class="src src-scheme">'<span style="color: #707183;">(</span><span style="color: #7388d6;">(</span>betty 3<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>ethel 5<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>joan 2<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>kitty 1<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>mary 4<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
