ch4/ch4.org
**** NEXT [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-28.html#%_thm_4.43][Exercise 4.43]]
     - Note taken on [2015-05-17 Sun 19:14] \\
       Still need to determine the number of solutions when Mary Ann's last name is
       not given.

- Mr. Moore
- Colonel Downing
- Mr. Hall
- Sir Barnacle Hood
- Dr. Parker

- Mary Ann Moore
- Gabrielle
- Lorna
- Rosalind
- Melissa

#+BEGIN_SRC scheme
(define (yacht-solver)
  (let ((d-moore (amb 'maryann 'gabrielle 'lorna 'rosalind 'melissa))
        (d-downing (amb 'maryann 'gabrielle 'lorna 'rosalind 'melissa))
        (d-hall (amb 'maryann 'gabrielle 'lorna 'rosalind 'melissa))
        (d-barnacle (amb 'maryann 'gabrielle 'lorna 'rosalind 'melissa))
        (d-parker (amb 'maryann 'gabrielle 'lorna 'rosalind 'melissa))
        (y-moore (amb 'maryann 'gabrielle 'lorna 'rosalind 'melissa))
        (y-downing (amb 'maryann 'gabrielle 'lorna 'rosalind 'melissa))
        (y-hall (amb 'maryann 'gabrielle 'lorna 'rosalind 'melissa))
        (y-barnacle (amb 'maryann 'gabrielle 'lorna 'rosalind 'melissa))
        (y-parker (amb 'maryann 'gabrielle 'lorna 'rosalind 'melissa)))
    (require (eq? d-moore 'maryann))
    (require (eq? y-barnacle 'gabrielle))
    (require (eq? y-moore 'lorna))
    (require (eq? y-hall 'rosalind))
    (require (eq? d-barnacle 'melissa))
    (require (eq? y-downing 'melissa))

    (require (not (eq? d-moore y-moore)))
    (require (not (eq? d-downing y-downing)))
    (require (not (eq? d-hall y-hall)))
    (require (not (eq? d-barnacle y-barnacle)))
    (require (not (eq? d-parker y-parker)))

    ;; How to encode "Gabrielle's father owns the yacht that is named after
    ;; Dr. Parker's daughter"?

    ;; More conditions
    (let ((daughters (list d-moore d-downing d-hall d-barnacle d-parker)))
      (list-index (lambda (x) (eq? x 'lorna)) daughters))))
#+END_SRC

The solution is:

- Daughters:
  - Mr. Moore: Mary Ann
  - Colonel Downing: Lorna
  - Mr. Hall: Gabrielle
  - Sir Barnacle Hood: Melissa
  - Dr. Parker: Rosalind

- Yachts:
  - Mr. Moore: Lorna
  - Colonel Downing: Melissa
  - Mr. Hall: Rosalind
  - Sir Barnacle Hood: Gabrielle
  - Dr. Parker: Mary Ann

