ch4/ch4.html

<div id="outline-container-orgheadline72" class="outline-5">
<h5 id="orgheadline72"><span class="todo NEXT">NEXT</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-28.html#%_thm_4.43">Exercise 4.43</a></h5>
<div class="outline-text-5" id="text-orgheadline72">
<ul class="org-ul">
<li>Note taken on <span class="timestamp-wrapper"><span class="timestamp">[2015-05-17 Sun 19:14] </span></span> <br  />
Still need to determine the number of solutions when Mary Ann's last name is
not given.</li>
</ul>
<ul class="org-ul">
<li>Mr. Moore</li>
<li>Colonel Downing</li>
<li>Mr. Hall</li>
<li>Sir Barnacle Hood</li>
<li>Dr. Parker</li>

<li>Mary Ann Moore</li>
<li>Gabrielle</li>
<li>Lorna</li>
<li>Rosalind</li>
<li>Melissa</li>
</ul>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">yacht-solver</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>d-moore <span style="color: #907373;">(</span>amb 'maryann 'gabrielle 'lorna 'rosalind 'melissa<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>d-downing <span style="color: #907373;">(</span>amb 'maryann 'gabrielle 'lorna 'rosalind 'melissa<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>d-hall <span style="color: #907373;">(</span>amb 'maryann 'gabrielle 'lorna 'rosalind 'melissa<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>d-barnacle <span style="color: #907373;">(</span>amb 'maryann 'gabrielle 'lorna 'rosalind 'melissa<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>d-parker <span style="color: #907373;">(</span>amb 'maryann 'gabrielle 'lorna 'rosalind 'melissa<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>y-moore <span style="color: #907373;">(</span>amb 'maryann 'gabrielle 'lorna 'rosalind 'melissa<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>y-downing <span style="color: #907373;">(</span>amb 'maryann 'gabrielle 'lorna 'rosalind 'melissa<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>y-hall <span style="color: #907373;">(</span>amb 'maryann 'gabrielle 'lorna 'rosalind 'melissa<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>y-barnacle <span style="color: #907373;">(</span>amb 'maryann 'gabrielle 'lorna 'rosalind 'melissa<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>y-parker <span style="color: #907373;">(</span>amb 'maryann 'gabrielle 'lorna 'rosalind 'melissa<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>require <span style="color: #709870;">(</span>eq? d-moore 'maryann<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>require <span style="color: #709870;">(</span>eq? y-barnacle 'gabrielle<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>require <span style="color: #709870;">(</span>eq? y-moore 'lorna<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>require <span style="color: #709870;">(</span>eq? y-hall 'rosalind<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>require <span style="color: #709870;">(</span>eq? d-barnacle 'melissa<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>require <span style="color: #709870;">(</span>eq? y-downing 'melissa<span style="color: #709870;">)</span><span style="color: #909183;">)</span>

    <span style="color: #909183;">(</span>require <span style="color: #709870;">(</span>not <span style="color: #907373;">(</span>eq? d-moore y-moore<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>require <span style="color: #709870;">(</span>not <span style="color: #907373;">(</span>eq? d-downing y-downing<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>require <span style="color: #709870;">(</span>not <span style="color: #907373;">(</span>eq? d-hall y-hall<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>require <span style="color: #709870;">(</span>not <span style="color: #907373;">(</span>eq? d-barnacle y-barnacle<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>require <span style="color: #709870;">(</span>not <span style="color: #907373;">(</span>eq? d-parker y-parker<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>

    <span style="color: #b22222;">;; </span><span style="color: #b22222;">How to encode "Gabrielle's father owns the yacht that is named after</span>
    <span style="color: #b22222;">;; </span><span style="color: #b22222;">Dr. Parker's daughter"?</span>

    <span style="color: #b22222;">;; </span><span style="color: #b22222;">More conditions</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">let</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>daughters <span style="color: #6276ba;">(</span>list d-moore d-downing d-hall d-barnacle d-parker<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>list-index <span style="color: #907373;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #6276ba;">(</span>x<span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>eq? x 'lorna<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span> daughters<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
The solution is:
</p>

<ul class="org-ul">
<li>Daughters:
<ul class="org-ul">
<li>Mr. Moore: Mary Ann</li>
<li>Colonel Downing: Lorna</li>
<li>Mr. Hall: Gabrielle</li>
<li>Sir Barnacle Hood: Melissa</li>
<li>Dr. Parker: Rosalind</li>
</ul></li>

<li>Yachts:
<ul class="org-ul">
<li>Mr. Moore: Lorna</li>
<li>Colonel Downing: Melissa</li>
<li>Mr. Hall: Rosalind</li>
<li>Sir Barnacle Hood: Gabrielle</li>
<li>Dr. Parker: Mary Ann</li>
</ul></li>
</ul>
</div>
</div>
