ch4/ch4.html

<div id="outline-container-orgheadline73" class="outline-5">
<h5 id="orgheadline73"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-28.html#%_thm_4.44">Exercise 4.44</a></h5>
<div class="outline-text-5" id="text-orgheadline73">
<ul class="org-ul">
<li>Note taken on <span class="timestamp-wrapper"><span class="timestamp">[2015-05-17 Sun 19:29] </span></span> <br  />
TODO: Verify that you can actually apply <code>amb</code> like I'm doing here.</li>
</ul>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> sicp<span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">queens</span> board-size<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">queen-cols</span> k<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">if</span> <span style="color: #709870;">(</span>= k 0<span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>list empty-board<span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span><span style="color: #a020f0;">let</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>positions
               <span style="color: #858580;">(</span>apply amb
                      <span style="color: #80a880;">(</span>flatmap
                       <span style="color: #887070;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #707183;">(</span>rest-of-queens<span style="color: #707183;">)</span>
                         <span style="color: #707183;">(</span><span style="color: #a020f0;">map</span> <span style="color: #7388d6;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #909183;">(</span>new-row<span style="color: #909183;">)</span>
                                <span style="color: #909183;">(</span>adjoin-position new-row k rest-of-queens<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
                              <span style="color: #7388d6;">(</span>enumerate-interval 1 board-size<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span>
                       <span style="color: #887070;">(</span>queen-cols <span style="color: #707183;">(</span>- k 1<span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>require <span style="color: #6276ba;">(</span>safe? k positions<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
          positions<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>queen-cols board-size<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #b22222;">;; </span><span style="color: #b22222;">The representation of an empty board</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #0000ff;">empty-board</span> '<span style="color: #7388d6;">()</span><span style="color: #707183;">)</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">Add a position (new-row . k) to the list rest-of-queens containing positions</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">for queens.</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">adjoin-position</span> new-row k rest-of-queens<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>cons <span style="color: #909183;">(</span>cons new-row k<span style="color: #909183;">)</span> rest-of-queens<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">Is the position of the queen in column k safe with respect to the positions</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">in the list positions?</span>
<span style="color: #707183;">(</span><span style="color: #a020f0;">define</span> <span style="color: #7388d6;">(</span><span style="color: #0000ff;">safe?</span> k positions<span style="color: #7388d6;">)</span>
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">Are positions p1 and p2 safe with respect to each other?</span>
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">p1 and p2 are pairs (x . y).</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">define</span> <span style="color: #909183;">(</span><span style="color: #0000ff;">pos-safe?</span> p1 p2<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #a020f0;">let</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>x1 <span style="color: #6276ba;">(</span>car p1<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>y1 <span style="color: #6276ba;">(</span>cdr p1<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>x2 <span style="color: #6276ba;">(</span>car p2<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>y2 <span style="color: #6276ba;">(</span>cdr p2<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #a020f0;">let</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>dx <span style="color: #858580;">(</span>- x2 x1<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
            <span style="color: #6276ba;">(</span>dy <span style="color: #858580;">(</span>- y2 y1<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span><span style="color: #a020f0;">or</span> <span style="color: #6276ba;">(</span><span style="color: #a020f0;">and</span> <span style="color: #858580;">(</span>= x1 x2<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>= y1 y2<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
            <span style="color: #6276ba;">(</span>not <span style="color: #858580;">(</span><span style="color: #a020f0;">or</span> <span style="color: #80a880;">(</span>= 0 dx<span style="color: #80a880;">)</span>
                     <span style="color: #80a880;">(</span>= 0 dy<span style="color: #80a880;">)</span>
                     <span style="color: #80a880;">(</span>= <span style="color: #887070;">(</span>abs dx<span style="color: #887070;">)</span> <span style="color: #887070;">(</span>abs dy<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #b22222;">;; </span><span style="color: #b22222;">Each column has a queen in only one row - find the position in column k</span>
  <span style="color: #7388d6;">(</span><span style="color: #a020f0;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>last-position <span style="color: #907373;">(</span>find <span style="color: #6276ba;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #858580;">(</span>position<span style="color: #858580;">)</span>
                               <span style="color: #858580;">(</span>= k <span style="color: #80a880;">(</span>cdr position<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
                             positions<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #b22222;">;; </span><span style="color: #b22222;">Filter list to contain only unsafe positions.</span>
    <span style="color: #909183;">(</span>not <span style="color: #709870;">(</span>find <span style="color: #907373;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #6276ba;">(</span>point<span style="color: #6276ba;">)</span>
                 <span style="color: #6276ba;">(</span>not <span style="color: #858580;">(</span>pos-safe? point last-position<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
               positions<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span>test '<span style="color: #7388d6;">(</span>1 0 0 2 10 4 40 92<span style="color: #7388d6;">)</span>
      <span style="color: #7388d6;">(</span><span style="color: #a020f0;">map</span> <span style="color: #909183;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #709870;">(</span>x<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>length <span style="color: #907373;">(</span>queens x<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span> <span style="color: #909183;">(</span>iota 8 1<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span>include <span style="color: #8b2252;">"ex-4-44"</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> test<span style="color: #707183;">)</span>

<span style="color: #707183;">(</span>test '<span style="color: #7388d6;">(</span>1 0 0 2 10 4 40 92<span style="color: #7388d6;">)</span>
      <span style="color: #7388d6;">(</span><span style="color: #a020f0;">map</span> <span style="color: #909183;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #709870;">(</span>x<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>length <span style="color: #907373;">(</span>queens x<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span> <span style="color: #909183;">(</span>iota 8 1<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline74" class="outline-5">
<h5 id="orgheadline74"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-28.html#%_thm_4.45">Exercise 4.45</a></h5>
</div>
<div id="outline-container-orgheadline75" class="outline-5">
<h5 id="orgheadline75"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-28.html#%_thm_4.46">Exercise 4.46</a></h5>
</div>
<div id="outline-container-orgheadline76" class="outline-5">
<h5 id="orgheadline76"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-28.html#%_thm_4.47">Exercise 4.47</a></h5>
</div>
<div id="outline-container-orgheadline77" class="outline-5">
<h5 id="orgheadline77"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-28.html#%_thm_4.48">Exercise 4.48</a></h5>
</div>
<div id="outline-container-orgheadline78" class="outline-5">
<h5 id="orgheadline78"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-28.html#%_thm_4.49">Exercise 4.49</a></h5>
</div>
</div>
<div id="outline-container-orgheadline86" class="outline-4">
<h4 id="orgheadline86"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-28.html#%_sec_4.3.3">4.3.3: Implementing the Amb Evaluator</a> <code>[/]</code></h4>
<div class="outline-text-4" id="text-orgheadline86">
</div><div id="outline-container-orgheadline80" class="outline-5">
<h5 id="orgheadline80"><span class="todo TODO">TODO</span> Read SICP 4.3.3</h5>
</div>
