ch4/ch4.org
**** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-28.html#%_thm_4.50][Exercise 4.50]]
**** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-28.html#%_thm_4.51][Exercise 4.51]]
**** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-28.html#%_thm_4.52][Exercise 4.52]]
**** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-28.html#%_thm_4.53][Exercise 4.53]]
**** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-28.html#%_thm_4.54][Exercise 4.54]]

** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_sec_4.4][4.4: Logic Programming]] [%]
*** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_sec_4.4.1][4.4.1: Deductive Information Retrieval]] [7/10]
    - Note taken on [2015-08-24 Mon 16:18] \\
      Trying to figure out how to use evaluator from the SICP egg.
    :LOGBOOK:
    CLOCK: [2015-08-24 Mon 16:18]--[2015-08-24 Mon 16:25] =>  0:07
    CLOCK: [2015-08-24 Mon 16:12]--[2015-08-24 Mon 16:18] =>  0:06
    :END:
**** DONE Read SICP 4.4.1
**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_thm_4.55][Exercise 4.55]]
     CLOCK: [2015-08-24 Mon 16:57]--[2015-08-24 Mon 17:07] =>  0:10
     CLOCK: [2015-08-17 Mon 17:34]--[2015-08-17 Mon 17:35] =>  0:01
     CLOCK: [2015-08-17 Mon 17:31]--[2015-08-17 Mon 17:34] =>  0:03

#+BEGIN_SRC scheme
  (use sicp-eval-logic test)

  (with-microshaft-database
   (lambda ()
     (test-group
      "Exercise 4.55"
      (test "a. all people supervised by Ben Bitdiddle;"
            '((supervisor (Tweakit Lem E) (Bitdiddle Ben))
              (supervisor (Fect Cy D) (Bitdiddle Ben))
              (supervisor (Hacker Alyssa P) (Bitdiddle Ben)))
            (qeval* '(supervisor ?x (Bitdiddle Ben)))))

     (test "b. the names and jobs of all people in the accounting division;"
           '((job (Cratchet Robert) (accounting scrivener))
             (job (Scrooge Eben) (accounting chief accountant)))
           (qeval* '(job ?x (accounting . ?type))))


     (test "c. the names and addresses of all people who live in Slumerville."
           '((address (Aull DeWitt) (Slumerville (Onion Square) 5))
             (address (Reasoner Louis) (Slumerville (Pine Tree Road) 80))
             (address (Bitdiddle Ben) (Slumerville (Ridge Road) 10)))
           (qeval* '(address ?x (Slumerville . ?addr))))))
#+END_SRC

