ch4/ch4.html
<div id="outline-container-orgheadline81" class="outline-5">
<h5 id="orgheadline81"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-28.html#%_thm_4.50">Exercise 4.50</a></h5>
</div>
<div id="outline-container-orgheadline82" class="outline-5">
<h5 id="orgheadline82"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-28.html#%_thm_4.51">Exercise 4.51</a></h5>
</div>
<div id="outline-container-orgheadline83" class="outline-5">
<h5 id="orgheadline83"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-28.html#%_thm_4.52">Exercise 4.52</a></h5>
</div>
<div id="outline-container-orgheadline84" class="outline-5">
<h5 id="orgheadline84"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-28.html#%_thm_4.53">Exercise 4.53</a></h5>
</div>
<div id="outline-container-orgheadline85" class="outline-5">
<h5 id="orgheadline85"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-28.html#%_thm_4.54">Exercise 4.54</a></h5>
</div>
</div>
</div>

<div id="outline-container-orgheadline121" class="outline-3">
<h3 id="orgheadline121"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_sec_4.4">4.4: Logic Programming</a> <code>[%]</code></h3>
<div class="outline-text-3" id="text-orgheadline121">
</div><div id="outline-container-orgheadline88" class="outline-4">
<h4 id="orgheadline88"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_sec_4.4.1">4.4.1: Deductive Information Retrieval</a> <code>[7/10]</code></h4>
<div class="outline-text-4" id="text-orgheadline88">
<ul class="org-ul">
<li>Note taken on <span class="timestamp-wrapper"><span class="timestamp">[2015-08-24 Mon 16:18] </span></span> <br  />
Trying to figure out how to use evaluator from the SICP egg.</li>
</ul>
</div>
<div id="outline-container-orgheadline89" class="outline-5">
<h5 id="orgheadline89"><span class="done DONE">DONE</span> Read SICP 4.4.1</h5>
</div>
<div id="outline-container-orgheadline90" class="outline-5">
<h5 id="orgheadline90"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_thm_4.55">Exercise 4.55</a></h5>
<div class="outline-text-5" id="text-orgheadline90">
<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> sicp-eval-logic test<span style="color: #707183;">)</span>

<span style="color: #707183;">(</span>with-microshaft-database
 <span style="color: #7388d6;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #909183;">()</span>
   <span style="color: #909183;">(</span><span style="color: #a020f0;">test-group</span>
    <span style="color: #8b2252;">"Exercise 4.55"</span>
    <span style="color: #709870;">(</span>test <span style="color: #8b2252;">"a. all people supervised by Ben Bitdiddle;"</span>
          '<span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>supervisor <span style="color: #858580;">(</span>Tweakit Lem E<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>Bitdiddle Ben<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
            <span style="color: #6276ba;">(</span>supervisor <span style="color: #858580;">(</span>Fect Cy D<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>Bitdiddle Ben<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
            <span style="color: #6276ba;">(</span>supervisor <span style="color: #858580;">(</span>Hacker Alyssa P<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>Bitdiddle Ben<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>qeval* '<span style="color: #6276ba;">(</span>supervisor ?x <span style="color: #858580;">(</span>Bitdiddle Ben<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>

   <span style="color: #909183;">(</span>test <span style="color: #8b2252;">"b. the names and jobs of all people in the accounting division;"</span>
         '<span style="color: #709870;">(</span><span style="color: #907373;">(</span>job <span style="color: #6276ba;">(</span>Cratchet Robert<span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>accounting scrivener<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span>job <span style="color: #6276ba;">(</span>Scrooge Eben<span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>accounting chief accountant<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>qeval* '<span style="color: #907373;">(</span>job ?x <span style="color: #6276ba;">(</span>accounting . ?type<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>


   <span style="color: #909183;">(</span>test <span style="color: #8b2252;">"c. the names and addresses of all people who live in Slumerville."</span>
         '<span style="color: #709870;">(</span><span style="color: #907373;">(</span>address <span style="color: #6276ba;">(</span>Aull DeWitt<span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>Slumerville <span style="color: #858580;">(</span>Onion Square<span style="color: #858580;">)</span> 5<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span>address <span style="color: #6276ba;">(</span>Reasoner Louis<span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>Slumerville <span style="color: #858580;">(</span>Pine Tree Road<span style="color: #858580;">)</span> 80<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span>address <span style="color: #6276ba;">(</span>Bitdiddle Ben<span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>Slumerville <span style="color: #858580;">(</span>Ridge Road<span style="color: #858580;">)</span> 10<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>qeval* '<span style="color: #907373;">(</span>address ?x <span style="color: #6276ba;">(</span>Slumerville . ?addr<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
