ch4/ch4.org
**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_thm_4.56][Exercise 4.56]]
     :PROPERTIES:
     :ORDERED:  t
     :END:
     CLOCK: [2015-08-24 Mon 17:10]--[2015-08-24 Mon 17:20] =>  0:10
     CLOCK: [2015-08-24 Mon 17:07]--[2015-08-24 Mon 17:10] =>  0:00
     CLOCK: [2015-08-17 Mon 17:37]--[2015-08-17 Mon 17:45] =>  0:08

#+BEGIN_SRC scheme
  (use sicp-eval-logic test)

  (with-microshaft-database
   (lambda ()
     (test-group
      "Exercise 4.56"
      (test "a. the names of all people who are supervised by Ben Bitdiddle, together with their addresses;"
            '((and (supervisor (Tweakit Lem E) (Bitdiddle Ben))
                   (address (Tweakit Lem E) (Boston (Bay State Road) 22)))
              (and (supervisor (Fect Cy D) (Bitdiddle Ben))
                   (address (Fect Cy D) (Cambridge (Ames Street) 3)))
              (and (supervisor (Hacker Alyssa P) (Bitdiddle Ben))
                   (address (Hacker Alyssa P) (Cambridge (Mass Ave) 78))))
            (qeval* '(and (supervisor ?person (Bitdiddle Ben))
                          (address ?person ?where))))

      (test "b. all people whose salary is less than Ben Bitdiddle's, together with their salary and Ben Bitdiddle's salary;"
            '((and (salary (Bitdiddle Ben) 60000)
                   (salary (Aull DeWitt) 25000)
                   (lisp-value < 25000 60000))
              (and (salary (Bitdiddle Ben) 60000)
                   (salary (Cratchet Robert) 18000)
                   (lisp-value < 18000 60000))
              (and (salary (Bitdiddle Ben) 60000)
                   (salary (Reasoner Louis) 30000)
                   (lisp-value < 30000 60000))
              (and (salary (Bitdiddle Ben) 60000)
                   (salary (Tweakit Lem E) 25000)
                   (lisp-value < 25000 60000))
              (and (salary (Bitdiddle Ben) 60000)
                   (salary (Fect Cy D) 35000)
                   (lisp-value < 35000 60000))
              (and (salary (Bitdiddle Ben) 60000)
                   (salary (Hacker Alyssa P) 40000)
                   (lisp-value < 40000 60000)))
            (qeval* '(and (salary (Bitdiddle Ben) ?bb-amount)
                          (salary ?person ?amount)
                          (lisp-value < ?amount ?bb-amount))))

      (test "c. all people who are supervised by someone who is not in the computer division, together with the supervisor's name and job."
            '((and (supervisor (Aull DeWitt) (Warbucks Oliver))
                   (not (job (Warbucks Oliver) (computer . ?type))))
              (and (supervisor (Cratchet Robert) (Scrooge Eben))
                   (not (job (Scrooge Eben) (computer . ?type))))
              (and (supervisor (Scrooge Eben) (Warbucks Oliver))
                   (not (job (Warbucks Oliver) (computer . ?type))))
              (and (supervisor (Bitdiddle Ben) (Warbucks Oliver))
                   (not (job (Warbucks Oliver) (computer . ?type)))))
            (qeval* '(and (supervisor ?person ?sup)
                          (not (job ?sup (computer . ?type)))))))))
#+END_SRC

