ch4/ch4.html

<div id="outline-container-orgheadline91" class="outline-5">
<h5 id="orgheadline91"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_thm_4.56">Exercise 4.56</a></h5>
<div class="outline-text-5" id="text-orgheadline91">
<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> sicp-eval-logic test<span style="color: #707183;">)</span>

<span style="color: #707183;">(</span>with-microshaft-database
 <span style="color: #7388d6;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #909183;">()</span>
   <span style="color: #909183;">(</span><span style="color: #a020f0;">test-group</span>
    <span style="color: #8b2252;">"Exercise 4.56"</span>
    <span style="color: #709870;">(</span>test <span style="color: #8b2252;">"a. the names of all people who are supervised by Ben Bitdiddle, together with their addresses;"</span>
          '<span style="color: #907373;">(</span><span style="color: #6276ba;">(</span><span style="color: #a020f0;">and</span> <span style="color: #858580;">(</span>supervisor <span style="color: #80a880;">(</span>Tweakit Lem E<span style="color: #80a880;">)</span> <span style="color: #80a880;">(</span>Bitdiddle Ben<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                 <span style="color: #858580;">(</span>address <span style="color: #80a880;">(</span>Tweakit Lem E<span style="color: #80a880;">)</span> <span style="color: #80a880;">(</span>Boston <span style="color: #887070;">(</span>Bay State Road<span style="color: #887070;">)</span> 22<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
            <span style="color: #6276ba;">(</span><span style="color: #a020f0;">and</span> <span style="color: #858580;">(</span>supervisor <span style="color: #80a880;">(</span>Fect Cy D<span style="color: #80a880;">)</span> <span style="color: #80a880;">(</span>Bitdiddle Ben<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                 <span style="color: #858580;">(</span>address <span style="color: #80a880;">(</span>Fect Cy D<span style="color: #80a880;">)</span> <span style="color: #80a880;">(</span>Cambridge <span style="color: #887070;">(</span>Ames Street<span style="color: #887070;">)</span> 3<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
            <span style="color: #6276ba;">(</span><span style="color: #a020f0;">and</span> <span style="color: #858580;">(</span>supervisor <span style="color: #80a880;">(</span>Hacker Alyssa P<span style="color: #80a880;">)</span> <span style="color: #80a880;">(</span>Bitdiddle Ben<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                 <span style="color: #858580;">(</span>address <span style="color: #80a880;">(</span>Hacker Alyssa P<span style="color: #80a880;">)</span> <span style="color: #80a880;">(</span>Cambridge <span style="color: #887070;">(</span>Mass Ave<span style="color: #887070;">)</span> 78<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>qeval* '<span style="color: #6276ba;">(</span><span style="color: #a020f0;">and</span> <span style="color: #858580;">(</span>supervisor ?person <span style="color: #80a880;">(</span>Bitdiddle Ben<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                        <span style="color: #858580;">(</span>address ?person ?where<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>

    <span style="color: #709870;">(</span>test <span style="color: #8b2252;">"b. all people whose salary is less than Ben Bitdiddle's, together with their salary and Ben Bitdiddle's salary;"</span>
          '<span style="color: #907373;">(</span><span style="color: #6276ba;">(</span><span style="color: #a020f0;">and</span> <span style="color: #858580;">(</span>salary <span style="color: #80a880;">(</span>Bitdiddle Ben<span style="color: #80a880;">)</span> 60000<span style="color: #858580;">)</span>
                 <span style="color: #858580;">(</span>salary <span style="color: #80a880;">(</span>Aull DeWitt<span style="color: #80a880;">)</span> 25000<span style="color: #858580;">)</span>
                 <span style="color: #858580;">(</span>lisp-value &lt; 25000 60000<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
            <span style="color: #6276ba;">(</span><span style="color: #a020f0;">and</span> <span style="color: #858580;">(</span>salary <span style="color: #80a880;">(</span>Bitdiddle Ben<span style="color: #80a880;">)</span> 60000<span style="color: #858580;">)</span>
                 <span style="color: #858580;">(</span>salary <span style="color: #80a880;">(</span>Cratchet Robert<span style="color: #80a880;">)</span> 18000<span style="color: #858580;">)</span>
                 <span style="color: #858580;">(</span>lisp-value &lt; 18000 60000<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
            <span style="color: #6276ba;">(</span><span style="color: #a020f0;">and</span> <span style="color: #858580;">(</span>salary <span style="color: #80a880;">(</span>Bitdiddle Ben<span style="color: #80a880;">)</span> 60000<span style="color: #858580;">)</span>
                 <span style="color: #858580;">(</span>salary <span style="color: #80a880;">(</span>Reasoner Louis<span style="color: #80a880;">)</span> 30000<span style="color: #858580;">)</span>
                 <span style="color: #858580;">(</span>lisp-value &lt; 30000 60000<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
            <span style="color: #6276ba;">(</span><span style="color: #a020f0;">and</span> <span style="color: #858580;">(</span>salary <span style="color: #80a880;">(</span>Bitdiddle Ben<span style="color: #80a880;">)</span> 60000<span style="color: #858580;">)</span>
                 <span style="color: #858580;">(</span>salary <span style="color: #80a880;">(</span>Tweakit Lem E<span style="color: #80a880;">)</span> 25000<span style="color: #858580;">)</span>
                 <span style="color: #858580;">(</span>lisp-value &lt; 25000 60000<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
            <span style="color: #6276ba;">(</span><span style="color: #a020f0;">and</span> <span style="color: #858580;">(</span>salary <span style="color: #80a880;">(</span>Bitdiddle Ben<span style="color: #80a880;">)</span> 60000<span style="color: #858580;">)</span>
                 <span style="color: #858580;">(</span>salary <span style="color: #80a880;">(</span>Fect Cy D<span style="color: #80a880;">)</span> 35000<span style="color: #858580;">)</span>
                 <span style="color: #858580;">(</span>lisp-value &lt; 35000 60000<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
            <span style="color: #6276ba;">(</span><span style="color: #a020f0;">and</span> <span style="color: #858580;">(</span>salary <span style="color: #80a880;">(</span>Bitdiddle Ben<span style="color: #80a880;">)</span> 60000<span style="color: #858580;">)</span>
                 <span style="color: #858580;">(</span>salary <span style="color: #80a880;">(</span>Hacker Alyssa P<span style="color: #80a880;">)</span> 40000<span style="color: #858580;">)</span>
                 <span style="color: #858580;">(</span>lisp-value &lt; 40000 60000<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>qeval* '<span style="color: #6276ba;">(</span><span style="color: #a020f0;">and</span> <span style="color: #858580;">(</span>salary <span style="color: #80a880;">(</span>Bitdiddle Ben<span style="color: #80a880;">)</span> ?bb-amount<span style="color: #858580;">)</span>
                        <span style="color: #858580;">(</span>salary ?person ?amount<span style="color: #858580;">)</span>
                        <span style="color: #858580;">(</span>lisp-value &lt; ?amount ?bb-amount<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>

    <span style="color: #709870;">(</span>test <span style="color: #8b2252;">"c. all people who are supervised by someone who is not in the computer division, together with the supervisor's name and job."</span>
          '<span style="color: #907373;">(</span><span style="color: #6276ba;">(</span><span style="color: #a020f0;">and</span> <span style="color: #858580;">(</span>supervisor <span style="color: #80a880;">(</span>Aull DeWitt<span style="color: #80a880;">)</span> <span style="color: #80a880;">(</span>Warbucks Oliver<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                 <span style="color: #858580;">(</span>not <span style="color: #80a880;">(</span>job <span style="color: #887070;">(</span>Warbucks Oliver<span style="color: #887070;">)</span> <span style="color: #887070;">(</span>computer . ?type<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
            <span style="color: #6276ba;">(</span><span style="color: #a020f0;">and</span> <span style="color: #858580;">(</span>supervisor <span style="color: #80a880;">(</span>Cratchet Robert<span style="color: #80a880;">)</span> <span style="color: #80a880;">(</span>Scrooge Eben<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                 <span style="color: #858580;">(</span>not <span style="color: #80a880;">(</span>job <span style="color: #887070;">(</span>Scrooge Eben<span style="color: #887070;">)</span> <span style="color: #887070;">(</span>computer . ?type<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
            <span style="color: #6276ba;">(</span><span style="color: #a020f0;">and</span> <span style="color: #858580;">(</span>supervisor <span style="color: #80a880;">(</span>Scrooge Eben<span style="color: #80a880;">)</span> <span style="color: #80a880;">(</span>Warbucks Oliver<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                 <span style="color: #858580;">(</span>not <span style="color: #80a880;">(</span>job <span style="color: #887070;">(</span>Warbucks Oliver<span style="color: #887070;">)</span> <span style="color: #887070;">(</span>computer . ?type<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
            <span style="color: #6276ba;">(</span><span style="color: #a020f0;">and</span> <span style="color: #858580;">(</span>supervisor <span style="color: #80a880;">(</span>Bitdiddle Ben<span style="color: #80a880;">)</span> <span style="color: #80a880;">(</span>Warbucks Oliver<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                 <span style="color: #858580;">(</span>not <span style="color: #80a880;">(</span>job <span style="color: #887070;">(</span>Warbucks Oliver<span style="color: #887070;">)</span> <span style="color: #887070;">(</span>computer . ?type<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>qeval* '<span style="color: #6276ba;">(</span><span style="color: #a020f0;">and</span> <span style="color: #858580;">(</span>supervisor ?person ?sup<span style="color: #858580;">)</span>
                        <span style="color: #858580;">(</span>not <span style="color: #80a880;">(</span>job ?sup <span style="color: #887070;">(</span>computer . ?type<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
