ch4/ch4.org
**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_thm_4.57][Exercise 4.57]]
     CLOCK: [2015-08-24 Mon 17:20]--[2015-08-24 Mon 17:47] =>  0:27
     CLOCK: [2015-08-17 Mon 17:46]--[2015-08-17 Mon 17:56] =>  0:10

Define a rule that says that person 1 can replace person 2 if either person 1
does the same job as person 2 or someone who does person 1's job can also do
person 2's job, and if person 1 and person 2 are not the same person.

#+NAME: rule-same
#+BEGIN_SRC scheme
  (qeval* '(assert! (rule (same ?x ?x))))
#+END_SRC

#+NAME: rule-substitute-for
#+BEGIN_SRC scheme
  <<rule-same>>
  (qeval* '(assert! (can-do-job (computer wizard)
                                (computer programmer))))
  (qeval* '(assert! (can-do-job (computer wizard)
                                (computer technician))))
  (qeval* '(assert! (can-do-job (computer programmer)
                                (computer programmer trainee))))
  (qeval* '(assert! (can-do-job (administration secretary)
                                (administration big wheel))))
  (qeval* '(assert! (rule (substitute-for ?person-1 ?person-2)
                          (and (job ?person-1 ?job-1)
                               (job ?person-2 ?job-2)
                               (or (same ?job-1 ?job-2)
                                   (can-do-job ?job-1 ?job-2))
                               (not (same ?person-1 ?person-2))))))
#+END_SRC

Queries:

#+BEGIN_SRC scheme :tangle ex-4-57-test.scm
  (use sicp-eval-logic test)

  (with-microshaft-database
   (lambda ()
    <<rule-substitute-for>>

     (test-group
      "Exercise 4.57"
      (test "a. all people who can replace Cy D. Fect;"
            '((substitute-for (Bitdiddle Ben) (Fect Cy D))
              (substitute-for (Hacker Alyssa P) (Fect Cy D))
              (substitute-for (Hacker Alyssa P) (Fect Cy D)))
            (qeval* '(substitute-for ?person (Fect Cy D))))

      (test "b. all people who can replace someone who is being paid more than they are, together with the two salaries."
            '((and (salary (Aull DeWitt) 25000)
                   (salary (Warbucks Oliver) 150000)
                   (lisp-value < 25000 150000)
                   (substitute-for (Aull DeWitt) (Warbucks Oliver)))
              (and (salary (Fect Cy D) 35000)
                   (salary (Hacker Alyssa P) 40000)
                   (lisp-value < 35000 40000)
                   (substitute-for (Fect Cy D) (Hacker Alyssa P)))
              (and (salary (Fect Cy D) 35000)
                   (salary (Hacker Alyssa P) 40000)
                   (lisp-value < 35000 40000)
                   (substitute-for (Fect Cy D) (Hacker Alyssa P))))
            (qeval* '(and (salary ?person-1 ?amount-1)
                          (salary ?person-2 ?amount-2)
                          (lisp-value < ?amount-1 ?amount-2)
                          (substitute-for ?person-1 ?person-2)))))))
#+END_SRC

