ch4/ch4.html

<div id="outline-container-orgheadline92" class="outline-5">
<h5 id="orgheadline92"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_thm_4.57">Exercise 4.57</a></h5>
<div class="outline-text-5" id="text-orgheadline92">
<p>
Define a rule that says that person 1 can replace person 2 if either person 1
does the same job as person 2 or someone who does person 1's job can also do
person 2's job, and if person 1 and person 2 are not the same person.
</p>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock43"><span style="color: #707183;">(</span>qeval* '<span style="color: #7388d6;">(</span>assert! <span style="color: #909183;">(</span>rule <span style="color: #709870;">(</span>same ?x ?x<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-scheme" id="orgsrcblock44"><span style="color: #228b22;">&lt;&lt;rule-same&gt;&gt;</span>
<span style="color: #707183;">(</span>qeval* '<span style="color: #7388d6;">(</span>assert! <span style="color: #909183;">(</span>can-do-job <span style="color: #709870;">(</span>computer wizard<span style="color: #709870;">)</span>
                              <span style="color: #709870;">(</span>computer programmer<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>qeval* '<span style="color: #7388d6;">(</span>assert! <span style="color: #909183;">(</span>can-do-job <span style="color: #709870;">(</span>computer wizard<span style="color: #709870;">)</span>
                              <span style="color: #709870;">(</span>computer technician<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>qeval* '<span style="color: #7388d6;">(</span>assert! <span style="color: #909183;">(</span>can-do-job <span style="color: #709870;">(</span>computer programmer<span style="color: #709870;">)</span>
                              <span style="color: #709870;">(</span>computer programmer trainee<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>qeval* '<span style="color: #7388d6;">(</span>assert! <span style="color: #909183;">(</span>can-do-job <span style="color: #709870;">(</span>administration secretary<span style="color: #709870;">)</span>
                              <span style="color: #709870;">(</span>administration big wheel<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>qeval* '<span style="color: #7388d6;">(</span>assert! <span style="color: #909183;">(</span>rule <span style="color: #709870;">(</span>substitute-for ?person-1 ?person-2<span style="color: #709870;">)</span>
                        <span style="color: #709870;">(</span><span style="color: #a020f0;">and</span> <span style="color: #907373;">(</span>job ?person-1 ?job-1<span style="color: #907373;">)</span>
                             <span style="color: #907373;">(</span>job ?person-2 ?job-2<span style="color: #907373;">)</span>
                             <span style="color: #907373;">(</span><span style="color: #a020f0;">or</span> <span style="color: #6276ba;">(</span>same ?job-1 ?job-2<span style="color: #6276ba;">)</span>
                                 <span style="color: #6276ba;">(</span>can-do-job ?job-1 ?job-2<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
                             <span style="color: #907373;">(</span>not <span style="color: #6276ba;">(</span>same ?person-1 ?person-2<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
Queries:
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> sicp-eval-logic test<span style="color: #707183;">)</span>

<span style="color: #707183;">(</span>with-microshaft-database
 <span style="color: #7388d6;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #909183;">()</span>
  <span style="color: #228b22;">&lt;&lt;rule-substitute-for&gt;&gt;</span>

   <span style="color: #909183;">(</span><span style="color: #a020f0;">test-group</span>
    <span style="color: #8b2252;">"Exercise 4.57"</span>
    <span style="color: #709870;">(</span>test <span style="color: #8b2252;">"a. all people who can replace Cy D. Fect;"</span>
          '<span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>substitute-for <span style="color: #858580;">(</span>Bitdiddle Ben<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>Fect Cy D<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
            <span style="color: #6276ba;">(</span>substitute-for <span style="color: #858580;">(</span>Hacker Alyssa P<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>Fect Cy D<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
            <span style="color: #6276ba;">(</span>substitute-for <span style="color: #858580;">(</span>Hacker Alyssa P<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>Fect Cy D<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>qeval* '<span style="color: #6276ba;">(</span>substitute-for ?person <span style="color: #858580;">(</span>Fect Cy D<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>

    <span style="color: #709870;">(</span>test <span style="color: #8b2252;">"b. all people who can replace someone who is being paid more than they are, together with the two salaries."</span>
          '<span style="color: #907373;">(</span><span style="color: #6276ba;">(</span><span style="color: #a020f0;">and</span> <span style="color: #858580;">(</span>salary <span style="color: #80a880;">(</span>Aull DeWitt<span style="color: #80a880;">)</span> 25000<span style="color: #858580;">)</span>
                 <span style="color: #858580;">(</span>salary <span style="color: #80a880;">(</span>Warbucks Oliver<span style="color: #80a880;">)</span> 150000<span style="color: #858580;">)</span>
                 <span style="color: #858580;">(</span>lisp-value &lt; 25000 150000<span style="color: #858580;">)</span>
                 <span style="color: #858580;">(</span>substitute-for <span style="color: #80a880;">(</span>Aull DeWitt<span style="color: #80a880;">)</span> <span style="color: #80a880;">(</span>Warbucks Oliver<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
            <span style="color: #6276ba;">(</span><span style="color: #a020f0;">and</span> <span style="color: #858580;">(</span>salary <span style="color: #80a880;">(</span>Fect Cy D<span style="color: #80a880;">)</span> 35000<span style="color: #858580;">)</span>
                 <span style="color: #858580;">(</span>salary <span style="color: #80a880;">(</span>Hacker Alyssa P<span style="color: #80a880;">)</span> 40000<span style="color: #858580;">)</span>
                 <span style="color: #858580;">(</span>lisp-value &lt; 35000 40000<span style="color: #858580;">)</span>
                 <span style="color: #858580;">(</span>substitute-for <span style="color: #80a880;">(</span>Fect Cy D<span style="color: #80a880;">)</span> <span style="color: #80a880;">(</span>Hacker Alyssa P<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
            <span style="color: #6276ba;">(</span><span style="color: #a020f0;">and</span> <span style="color: #858580;">(</span>salary <span style="color: #80a880;">(</span>Fect Cy D<span style="color: #80a880;">)</span> 35000<span style="color: #858580;">)</span>
                 <span style="color: #858580;">(</span>salary <span style="color: #80a880;">(</span>Hacker Alyssa P<span style="color: #80a880;">)</span> 40000<span style="color: #858580;">)</span>
                 <span style="color: #858580;">(</span>lisp-value &lt; 35000 40000<span style="color: #858580;">)</span>
                 <span style="color: #858580;">(</span>substitute-for <span style="color: #80a880;">(</span>Fect Cy D<span style="color: #80a880;">)</span> <span style="color: #80a880;">(</span>Hacker Alyssa P<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>qeval* '<span style="color: #6276ba;">(</span><span style="color: #a020f0;">and</span> <span style="color: #858580;">(</span>salary ?person-1 ?amount-1<span style="color: #858580;">)</span>
                        <span style="color: #858580;">(</span>salary ?person-2 ?amount-2<span style="color: #858580;">)</span>
                        <span style="color: #858580;">(</span>lisp-value &lt; ?amount-1 ?amount-2<span style="color: #858580;">)</span>
                        <span style="color: #858580;">(</span>substitute-for ?person-1 ?person-2<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
