ch4/ch4.org
**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_thm_4.58][Exercise 4.58]]
     CLOCK: [2015-08-24 Mon 19:00]--[2015-08-24 Mon 19:11] =>  0:11
     CLOCK: [2015-08-17 Mon 18:25]--[2015-08-17 Mon 18:28] =>  0:03

#+BEGIN_SRC scheme
  (use sicp-eval-logic test)

  (with-microshaft-database
   (lambda ()
     (qeval* '(assert!
               (rule (big-shot ?shot)
                     (and (job ?shot (?shot-division . ?shot-type))
                          (or (not (supervisor ?shot ?sup))
                              (and (supervisor ?shot ?sup)
                                   (not (job ?sup (?shot-division . ?sup-type)))))))))
     (test "Foo"
           '((big-shot (Warbucks Oliver))
             (big-shot (Scrooge Eben))
             (big-shot (Bitdiddle Ben)))
           (qeval* '(big-shot ?person)))))
#+END_SRC

**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_thm_4.59][Exercise 4.59]]
     CLOCK: [2015-08-17 Mon 18:46]--[2015-08-17 Mon 18:53] =>  0:07

- a. All meetings on Friday:

     #+BEGIN_SRC scheme
     (meeting ?division (Friday . $time))
     #+END_SRC

- b. Alyssa's rule:

     #+BEGIN_SRC scheme
     (rule (meeting-time ?person ?day-and-time)
           (or (meeting whole-company ?day-and-time)
               (and (job ?person (?division . ?type))
                    (meeting ?division ?day-and-time))))
     #+END_SRC

- c. Alyssa's meetings on Wednesday:

     #+BEGIN_SRC scheme
     (meeting-time (Hacker Alyssa P) (Wednesday . ?time))
     #+END_SRC

**** DONE [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_thm_4.60][Exercise 4.60]]
     CLOCK: [2015-08-17 Mon 18:56]--[2015-08-17 Mon 19:00] =>  0:04

#+BEGIN_SRC scheme
(and (lives-near ?person-1 ?person-2)
     (not (lives-near ?person-2 ?person-1)))
#+END_SRC

**** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_thm_4.61][Exercise 4.61]]
**** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_thm_4.62][Exercise 4.62]]
**** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_thm_4.63][Exercise 4.63]]
*** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_sec_4.4.2][4.4.2: How the Query System Works]] [/]

No exercises.

**** TODO Read SICP 4.4.2
*** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_sec_4.4.3][4.4.3: Is Logic Programming Mathematical Logic?]] [/]
**** TODO Read SICP 4.4.3
**** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_thm_4.64][Exercise 4.64]]
**** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_thm_4.65][Exercise 4.65]]
**** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_thm_4.66][Exercise 4.66]]
**** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_thm_4.67][Exercise 4.67]]
**** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_thm_4.68][Exercise 4.68]]
**** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_thm_4.69][Exercise 4.69]]
*** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_sec_4.4.4][4.4.4: Implementing the Query System]] [/]
**** TODO Read SICP 4.4.4
**** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_thm_4.70][Exercise 4.70]]
**** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_thm_4.71][Exercise 4.71]]
**** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_thm_4.72][Exercise 4.72]]
**** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_thm_4.73][Exercise 4.73]]
**** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_thm_4.74][Exercise 4.74]]
**** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_thm_4.75][Exercise 4.75]]
**** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_thm_4.76][Exercise 4.76]]
**** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_thm_4.77][Exercise 4.77]]
**** TODO [[http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_thm_4.78][Exercise 4.78]]
