ch4/ch4.html

<div id="outline-container-orgheadline93" class="outline-5">
<h5 id="orgheadline93"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_thm_4.58">Exercise 4.58</a></h5>
<div class="outline-text-5" id="text-orgheadline93">
<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">use</span> sicp-eval-logic test<span style="color: #707183;">)</span>

<span style="color: #707183;">(</span>with-microshaft-database
 <span style="color: #7388d6;">(</span><span style="color: #a020f0;">lambda</span> <span style="color: #909183;">()</span>
   <span style="color: #909183;">(</span>qeval* '<span style="color: #709870;">(</span>assert!
             <span style="color: #907373;">(</span>rule <span style="color: #6276ba;">(</span>big-shot ?shot<span style="color: #6276ba;">)</span>
                   <span style="color: #6276ba;">(</span><span style="color: #a020f0;">and</span> <span style="color: #858580;">(</span>job ?shot <span style="color: #80a880;">(</span>?shot-division . ?shot-type<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                        <span style="color: #858580;">(</span><span style="color: #a020f0;">or</span> <span style="color: #80a880;">(</span>not <span style="color: #887070;">(</span>supervisor ?shot ?sup<span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
                            <span style="color: #80a880;">(</span><span style="color: #a020f0;">and</span> <span style="color: #887070;">(</span>supervisor ?shot ?sup<span style="color: #887070;">)</span>
                                 <span style="color: #887070;">(</span>not <span style="color: #707183;">(</span>job ?sup <span style="color: #7388d6;">(</span>?shot-division . ?sup-type<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span>test <span style="color: #8b2252;">"Foo"</span>
         '<span style="color: #709870;">(</span><span style="color: #907373;">(</span>big-shot <span style="color: #6276ba;">(</span>Warbucks Oliver<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span>big-shot <span style="color: #6276ba;">(</span>Scrooge Eben<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span>big-shot <span style="color: #6276ba;">(</span>Bitdiddle Ben<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>qeval* '<span style="color: #907373;">(</span>big-shot ?person<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline94" class="outline-5">
<h5 id="orgheadline94"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_thm_4.59">Exercise 4.59</a></h5>
<div class="outline-text-5" id="text-orgheadline94">
<ul class="org-ul">
<li><p>
a. All meetings on Friday:
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span>meeting ?division <span style="color: #7388d6;">(</span>Friday . $time<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div></li>

<li><p>
b. Alyssa's rule:
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span>rule <span style="color: #7388d6;">(</span>meeting-time ?person ?day-and-time<span style="color: #7388d6;">)</span>
      <span style="color: #7388d6;">(</span><span style="color: #a020f0;">or</span> <span style="color: #909183;">(</span>meeting whole-company ?day-and-time<span style="color: #909183;">)</span>
          <span style="color: #909183;">(</span><span style="color: #a020f0;">and</span> <span style="color: #709870;">(</span>job ?person <span style="color: #907373;">(</span>?division . ?type<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
               <span style="color: #709870;">(</span>meeting ?division ?day-and-time<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div></li>

<li><p>
c. Alyssa's meetings on Wednesday:
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span>meeting-time <span style="color: #7388d6;">(</span>Hacker Alyssa P<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>Wednesday . ?time<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline95" class="outline-5">
<h5 id="orgheadline95"><span class="done DONE">DONE</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_thm_4.60">Exercise 4.60</a></h5>
<div class="outline-text-5" id="text-orgheadline95">
<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #a020f0;">and</span> <span style="color: #7388d6;">(</span>lives-near ?person-1 ?person-2<span style="color: #7388d6;">)</span>
     <span style="color: #7388d6;">(</span>not <span style="color: #909183;">(</span>lives-near ?person-2 ?person-1<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline96" class="outline-5">
<h5 id="orgheadline96"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_thm_4.61">Exercise 4.61</a></h5>
</div>
<div id="outline-container-orgheadline97" class="outline-5">
<h5 id="orgheadline97"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_thm_4.62">Exercise 4.62</a></h5>
</div>
<div id="outline-container-orgheadline98" class="outline-5">
<h5 id="orgheadline98"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_thm_4.63">Exercise 4.63</a></h5>
</div>
</div>
<div id="outline-container-orgheadline99" class="outline-4">
<h4 id="orgheadline99"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_sec_4.4.2">4.4.2: How the Query System Works</a> <code>[/]</code></h4>
<div class="outline-text-4" id="text-orgheadline99">
<p>
No exercises.
</p>
</div>

<div id="outline-container-orgheadline100" class="outline-5">
<h5 id="orgheadline100"><span class="todo TODO">TODO</span> Read SICP 4.4.2</h5>
</div>
</div>
<div id="outline-container-orgheadline108" class="outline-4">
<h4 id="orgheadline108"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_sec_4.4.3">4.4.3: Is Logic Programming Mathematical Logic?</a> <code>[/]</code></h4>
<div class="outline-text-4" id="text-orgheadline108">
</div><div id="outline-container-orgheadline101" class="outline-5">
<h5 id="orgheadline101"><span class="todo TODO">TODO</span> Read SICP 4.4.3</h5>
</div>
<div id="outline-container-orgheadline102" class="outline-5">
<h5 id="orgheadline102"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_thm_4.64">Exercise 4.64</a></h5>
</div>
<div id="outline-container-orgheadline103" class="outline-5">
<h5 id="orgheadline103"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_thm_4.65">Exercise 4.65</a></h5>
</div>
<div id="outline-container-orgheadline104" class="outline-5">
<h5 id="orgheadline104"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_thm_4.66">Exercise 4.66</a></h5>
</div>
<div id="outline-container-orgheadline105" class="outline-5">
<h5 id="orgheadline105"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_thm_4.67">Exercise 4.67</a></h5>
</div>
<div id="outline-container-orgheadline106" class="outline-5">
<h5 id="orgheadline106"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_thm_4.68">Exercise 4.68</a></h5>
</div>
<div id="outline-container-orgheadline107" class="outline-5">
<h5 id="orgheadline107"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_thm_4.69">Exercise 4.69</a></h5>
</div>
</div>
<div id="outline-container-orgheadline120" class="outline-4">
<h4 id="orgheadline120"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_sec_4.4.4">4.4.4: Implementing the Query System</a> <code>[/]</code></h4>
<div class="outline-text-4" id="text-orgheadline120">
</div><div id="outline-container-orgheadline109" class="outline-5">
<h5 id="orgheadline109"><span class="todo TODO">TODO</span> Read SICP 4.4.4</h5>
</div>
<div id="outline-container-orgheadline110" class="outline-5">
<h5 id="orgheadline110"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_thm_4.70">Exercise 4.70</a></h5>
</div>
<div id="outline-container-orgheadline111" class="outline-5">
<h5 id="orgheadline111"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_thm_4.71">Exercise 4.71</a></h5>
</div>
<div id="outline-container-orgheadline112" class="outline-5">
<h5 id="orgheadline112"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_thm_4.72">Exercise 4.72</a></h5>
</div>
<div id="outline-container-orgheadline113" class="outline-5">
<h5 id="orgheadline113"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_thm_4.73">Exercise 4.73</a></h5>
</div>
<div id="outline-container-orgheadline114" class="outline-5">
<h5 id="orgheadline114"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_thm_4.74">Exercise 4.74</a></h5>
</div>
<div id="outline-container-orgheadline115" class="outline-5">
<h5 id="orgheadline115"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_thm_4.75">Exercise 4.75</a></h5>
</div>
<div id="outline-container-orgheadline116" class="outline-5">
<h5 id="orgheadline116"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_thm_4.76">Exercise 4.76</a></h5>
</div>
<div id="outline-container-orgheadline117" class="outline-5">
<h5 id="orgheadline117"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_thm_4.77">Exercise 4.77</a></h5>
</div>
<div id="outline-container-orgheadline118" class="outline-5">
<h5 id="orgheadline118"><span class="todo TODO">TODO</span> <a href="http://mitpress.mit.edu/sicp/full-text/book/book-Z-H-29.html#%_thm_4.78">Exercise 4.78</a></h5>
</div>
